
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Дополнительно.Заголовок = ДополнительныеРеквизитыСтрокой();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Функция ДополнительныеРеквизитыСтрокой()
	
	Возврат Справочники.Номенклатура.ОписаниеДополнительныхРеквизитовНоменклатуры(Объект.Ссылка);

КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// ++ rarus makole 2020-12-29 
	ОбновитьВидимостьРеквизитов();
	// -- rarus makole 2020-12-29 
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) Экспорт
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды() Экспорт
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ++ rarus makole 2020-12-29 
&НаКлиенте
Процедура ОбновитьВидимостьРеквизитов()
	
	ТипТовар = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар");
	ТипТара = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара");
	
	// ++ rarus atyutyakin 15.02.2021  [ФТ.ИМ.02.01]
	// Категория должна быть видна независимо от функц.опции.
	Элементы.Категория.Видимость = (Объект.ТипНоменклатуры = ТипТара ИЛИ Объект.ТипНоменклатуры = ТипТовар И НЕ Объект.ЭтоТопливо);
	//Элементы.Категория.Видимость = ОпцияИмуществоВключена() И (Объект.ТипНоменклатуры = ТипТара ИЛИ Объект.ТипНоменклатуры = ТипТовар И НЕ Объект.ЭтоТопливо);
	// -- rarus atyutyakin 15.02.2021
	
КонецПроцедуры

// ++ rarus makole 2021-04-23
//&НаСервереБезКонтекста
//Функция ОпцияИмуществоВключена()
//	Возврат рарусИмущественныйУчетСервер.ИспользоватьИмущественныйУчет();
//КонецФункции
// -- rarus makole 2021-04-23

&НаСервереБезКонтекста
Функция РеквизитыОбъекта(Ссылка, Реквизиты)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
КонецФункции

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	Реквизиты = РеквизитыОбъекта(Объект.ВидНоменклатуры, "ТипНоменклатуры, ЭтоТопливо");
	Объект.ТипНоменклатуры = Реквизиты.ТипНоменклатуры;
	Объект.ЭтоТопливо = Реквизиты.ЭтоТопливо;
	ОбновитьВидимостьРеквизитов();
	
КонецПроцедуры
// -- rarus makole 2020-12-29 