
&НаСервере
Процедура ИдентификаторТехКартыПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	впТехКарты.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
	|	впТехКарты.Ссылка КАК ТехКарта
	|ИЗ
	|	Справочник.впТехКарты КАК впТехКарты
	|ГДЕ
	|	впТехКарты.ИдентификаторТехКарты = &ИдентификаторТехКарты";
	Запрос.УстановитьПараметр( "ИдентификаторТехКарты", ИдентификаторТехКарты);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТехКарта = Выборка.ТехКарта;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторТехКартыПриИзменении(Элемент)
	ИдентификаторТехКартыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если ЗначениеЗаполнено(Параметры.Подразделение) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	впОбъектыРемонта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.впОбъектыРемонта КАК впОбъектыРемонта
		|ГДЕ
		|	впОбъектыРемонта.ПодразделениеИсполнитель = &Судно
		|	И впОбъектыРемонта.Родитель = ЗНАЧЕНИЕ(Справочник.впОбъектыРемонта.ПУстаяСсылка) ";
		Запрос.УстановитьПараметр( "Судно", Параметры.Подразделение);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбъектРемонта = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	СтрутураВозврата = Новый Структура;
	СтрутураВозврата.Вставить("ТехКарта",ТехКарта);
	СтрутураВозврата.Вставить("ИдентификаторТехКарты",ИдентификаторТехКарты);
	СтрутураВозврата.Вставить("ОбъектРемонта",ОбъектРемонта);
	СтрутураВозврата.Вставить("ВидРемонта",ВидРемонта);
	Закрыть(СтрутураВозврата);
КонецПроцедуры
