///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	РедактируемыеРеквизиты.Добавить("Комментарий");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(Владелец.ВладелецФайла)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(Владелец.ВладелецФайла)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма       = "Обработка.РаботаСФайлами.Форма.ВерсияПрисоединенногоФайла";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли

// ++ rarus makole 2020-12-04 [БСО.ПРОТОКОЛ Р-58 03.12.2020]
// Функция возвращает связанную с объектом информацию, обязательную к выгрузке
//
// Параметры:
//  СсылкаНаОбъект  - СправочникСсылка.ВерсииФайлов - ссылка на объект, связанные объекты которого требуется вернуть
//
// Возвращаемое значение:
//   Массив   - Массив структур с ключами "ИмяТипа, Отбор", где ИмяТипа - Строка, представляет полное имя
//				объекта метаданных, Отбор - структура с ключами, соответствующими основному отбору
//
Функция СвязанныеДанные(СсылкаНаОбъект) Экспорт
	
	МассивСвязанных = Новый Массив;
	
	СтруктураОтбора = Новый Структура("Файл", СсылкаНаОбъект);
	СтруктураСведения = Новый Структура("ИмяТипа, Отбор", "РегистрСведений.СведенияОФайлах", СтруктураОтбора);
	МассивСвязанных.Добавить(СтруктураСведения);
	  
	СтруктураОтбора = Новый Структура("ОбъектСФайлами", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект,"ВладелецФайла"));
	СтруктураНаличие = Новый Структура("ИмяТипа, Отбор", "РегистрСведений.НаличиеФайлов", СтруктураОтбора);
	МассивСвязанных.Добавить(СтруктураНаличие);
	  
	Возврат МассивСвязанных;
	  
КонецФункции // -- rarus makole 2020-12-04 [БСО.ПРОТОКОЛ Р-58 03.12.2020]