// ++ rarus makole 2020-10-19
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ОбменДаннымиСервер.ЭтоПодчиненныйУзелРИБ()
		И ДанныеЗаполнения = Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПолныйСуда.Судно КАК Судно
			|ИЗ
			|	ПланОбмена.Полный.Суда КАК ПолныйСуда
			|ГДЕ
			|	ПолныйСуда.Ссылка = &ЭтотУзел";
		
		Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.Полный.ЭтотУзел());
		
		ВыборкаПоСудну = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаПоСудну.Следующий() Тогда
			Судно = ВыборкаПоСудну.Судно
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры // -- rarus makole 2020-10-19