// Устанавливает ключ в строках табличной части
//
// Параметры:
//  Объект							 - ДокументОбъект.* - Изменяемый документ
//  ИмяТабличнойЧасти				 - Строка - Название табличной части
//  РеквизитМаксимальныйКодСтроки	 - Строка - Имя реквизита максимального кода строки объекта
//  ИмяРеквизитаТЧ					 - Строка - Имя реквизита кода строки в ТЧ объекта
//
Процедура УстановитьКлючВСтрокахТабличнойЧасти(Объект,
											ИмяТабличнойЧасти,
											РеквизитМаксимальныйКодСтроки = "МаксимальныйКодСтроки",
											ИмяРеквизитаТЧ = "КодСтроки") Экспорт

	СтрокиБезКлюча = Объект[ИмяТабличнойЧасти].НайтиСтроки(Новый Структура(ИмяРеквизитаТЧ, 0));
	Если СтрокиБезКлюча.Количество() > 0 Тогда
		
		ТекущийКод = Объект[РеквизитМаксимальныйКодСтроки];
		
		Для Каждого СтрокаТовары Из СтрокиБезКлюча Цикл
			
			ТекущийКод = ТекущийКод + 1;
			СтрокаТовары[ИмяРеквизитаТЧ] = ТекущийКод;
			
		КонецЦикла;
		
		Объект[РеквизитМаксимальныйКодСтроки] = ТекущийКод;
		
	КонецЕсли;

КонецПроцедуры
