#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Судно") Тогда
		Судно = Параметры.Судно;
	Иначе
		Отказ = Истина;	
	КонецЕсли;
	
	ЗаполнитьТаблицуЗначенийНаСервере(Судно);
		
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Если Элементы.ДанныеДляПодбора.ВыделенныеСтроки.Количество()>0 Тогда	
		Строка = ДанныеДляПодбора.НайтиПоИдентификатору(Элементы.ДанныеДляПодбора.ВыделенныеСтроки[0]);
		ТекущаяСтрока = Строка;
	КонецЕсли;

	Закрыть(ТекущаяСтрока);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуЗначенийНаСервере(ПараметрОтбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеПланГрафиков.Номер КАК Номер,
	|	ДанныеПланГрафиков.Дата КАК Дата,
	|	ДанныеПланГрафиков.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДанныеПланГрафиков.Наименование КАК Наименование,
	|	ДанныеПланГрафиков.Организация КАК Организация,
	|	ДанныеПланГрафиков.Комментарий КАК Комментарий,
	|	ДанныеПланГрафиков.Статус КАК Статус,
	|	ДанныеПланГрафиков.Согласующий КАК Согласующий,
	|	ДанныеПланГрафиков.Ответственный КАК Ответственный,
	|	ДанныеПланГрафиков.ПериодПланирования КАК ПериодПланирования,
	|	ДанныеПланГрафиков.ДатаНачала КАК ДатаНачала,
	|	ДанныеПланГрафиков.ДатаОкончания КАК ДатаОкончания,
	|	ДанныеПланГрафиков.ОбъектПроверки КАК ОбъектПроверки,
	|	ДанныеПланГрафиков.ВидМероприятия КАК ВидМероприятия,
	|	ДанныеПланГрафиков.Обозначение КАК Обозначение,
	|	ДанныеПланГрафиков.ПериодС КАК ПериодС,
	|	ДанныеПланГрафиков.ПериодПо КАК ПериодПо,
	|	ДанныеПланГрафиков.КомментарийТч КАК КомментарийТч,
	|	ДанныеПланГрафиков.ПредыдущаяДата КАК ПредыдущаяДата
	|ИЗ
	|	РегистрСведений.рарусДанныеПланГрафиковМероприятийСУБ КАК ДанныеПланГрафиков
	|ГДЕ
	|	ДанныеПланГрафиков.ОбъектПроверки = &ОбъектПроверки";
	
	Запрос.УстановитьПараметр("ОбъектПроверки",ПараметрОтбора);
	
	ДанныеДляПодбора.Загрузить(Запрос.Выполнить().Выгрузить());
	 
КонецПроцедуры

#КонецОбласти
