Функция ИспользуетсяСудовоеСнабжениеДляУзла(Узел) Экспорт
	
	Используется = Ложь;
	
	Если Узел <> Неопределено тогда
		
		Если Узел.ИспользоватьОтборПоСудам тогда
			
			Для Каждого СтрокаСудно Из Узел.Суда цикл
				
				Если ИспользуетсяСудовоеСнабжениеДляСудна(СтрокаСудно.Судно) тогда
					Используется = Истина;
					Прервать;
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат Используется;
	
КонецФункции

Функция ИспользуетсяСудовоеСнабжениеДляСудна(Судно) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Судно", Судно);
	
	Возврат ПолучитьФункциональнуюОпцию("рарусИспользоватьСудовоеСнабжение", Параметры);
	
КонецФункции

Функция ПроверитьПолучателяПоСудну(Узел, Судно) Экспорт
	
	Используется = Ложь;
	
	Если Узел <> Неопределено тогда
		
		Если Узел.ИспользоватьОтборПоСудам тогда
			
			Для Каждого СтрокаСудно Из Узел.Суда цикл
				
				Если СтрокаСудно.Судно = Судно тогда
					Используется = Истина;
					Прервать;
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат Используется;
	
КонецФункции

// ++ rarus ilshill
Функция ОпределитьПолучателейДокументацииСУБ(Узел) Экспорт
	
	СоответствиеПолучателей = Новый Соответствие;
	
	Если Узел <> Неопределено тогда
		
		Если Узел.ИспользоватьОтборПоСудам тогда
			
			Для Каждого СтрокаСудно Из Узел.Суда цикл
				
				СоответствиеПолучателей.Вставить(СтрокаСудно.Судно, Истина);
				
			КонецЦикла;	
			
			СоответствиеПолучателей.Вставить("рарусИспользоватьФункционалСУБ", 
			                                   ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ"));
			
		КонецЕсли;
		
	КонецЕсли;
				
	Возврат СоответствиеПолучателей;
	
КонецФункции

Функция ПолномочияАудитораСУБ(Пользователь = Неопределено) Экспорт
	Возврат Пользователи.РолиДоступны("рарусПолномочияАудитора", Пользователь, Ложь);
КонецФункции
// -- rarus ilshill

//rarus_AfoD 15.09.2021 < 
Функция ИспользоватьСтатусыЗаявокНаПереносРабот() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("рарусИспользоватьСтатусыЗаявокНаПереносРабот");
КонецФункции
//rarus_AfoD 15.09.2021 > 