// ++ rarus Чернавин Г.К 17.03.2020
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция МанервыИлиОжидание(Параметр) Экспорт
	
	Если Параметр = Справочники.vftТиповыеОперации.Маневры Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.МаневрыНаПереходе Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ФормированиеСостава Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ОжиданиеПогрузки Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ОжиданиеВыгрузки Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ОжиданиеПаузки Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ОжиданиеДогрузки Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.НачалоРейса Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
#КонецЕсли
// -- rarus Чернавин Г.К 17.03.2020

// ++ rarus Камаев П.В. 25.01.2021
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Наименование");
	Поля.Добавить("КодОперации");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ОсновноеСудно	= vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно");
	ЭтоСудноМСГФ	= рарусОбщегоНазначенияВызовСервера.ЭтоСудноМСГФ(ОсновноеСудно);
	
	Если ЗначениеЗаполнено(Данные.КодОперации) И ЭтоСудноМСГФ Тогда
		Представление = Данные.КодОперации + " (" + Данные.Наименование + ")";
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры
// -- rarus Камаев П.В. 25.01.2021