// Выполняет проверку модифицированности Даты и Организации документа
// Если дата не входит в предыдущий период или изменен реквизит Организация, то номер документа обнуляется.
// Это необходимо для назначения нового номера документу
//
// Параметры:
//  Источник - ДокументОбъект - источник события подписки
//  Отказ    - Булево - флаг отказа
// 
Процедура ПроверитьНомерДокументаПоДатеИСудну(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ПроверитьНомерОбъектаПоДатеИСудну(Источник);
	
КонецПроцедуры

Процедура ПроверитьНомерОбъектаПоДатеИСудну(Объект)
	
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	ИначеЕсли Объект.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.vftРейс") Тогда
		Если vftПрефиксацияОбъектов.ДатаИлиСудноОбъектаИзменены(Объект.Ссылка, Объект.ДатаНачала, Объект.Судно, Объект.Метаданные().ПолноеИмя()) Тогда
			
			// ++ rarus Камаев П.В. 30.03.2020 Задача № 20647 
			//Объект.Номер = "";
			// -- rarus Камаев П.В. 30.03.2020
						
		КонецЕсли;
		
	ИначеЕсли  ТипЗнч(Объект.Ссылка)=Тип("СправочникСсылка.vftДокладыОНесоответствии") Тогда
		Если vftПрефиксацияОбъектов.ДатаИлиСудноОбъектаИзменены(Объект.Ссылка, Объект.Дата, Объект.Судно, Объект.Метаданные().ПолноеИмя()) Тогда
			
			Объект.Код = "";
			
		КонецЕсли 
	Иначе
		Если vftПрефиксацияОбъектов.ДатаИлиСудноОбъектаИзменены(Объект.Ссылка, Объект.Дата, Объект.Судно, Объект.Метаданные().ПолноеИмя()) Тогда
			
			Объект.Номер = "";
			
		КонецЕсли;
	КонецЕсли; 
	
	
КонецПроцедуры