&НаКлиенте
Перем ЗакрытиеИзОбработчикаОжидания;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВернутьСозданный") Тогда
		ВернутьСозданный = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
        Возврат;
    КонецЕсли; 
    
	Если ВернутьСозданный = Истина 
		И ЗакрытиеИзОбработчикаОжидания <> Истина Тогда
		Отказ = Истина;
        ПодключитьОбработчикОжидания("ВернутьСозданнуюЗапись", 0.1, Истина);
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ВернутьСозданнуюЗапись() Экспорт
    
	ЗакрытиеИзОбработчикаОжидания = Истина;
	Закрыть(Новый Структура("ЕстьЗапись, ДанныеЗаписи", ЕстьЗапись, Запись));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Отказ Тогда
		ЕстьЗапись = Истина;
	КонецЕсли;
	
КонецПроцедуры

