
&НаКлиенте
Процедура ПостроитьМаршрут(Команда)
		ПостроитьМаршрутНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПостроитьМаршрутНаСервере()
	
	текОбъект = РеквизитФормыВЗначение("Объект");
	текОбъект.ПунктыПрохождения.Очистить();
	
	АлгоритмПостроенияНаСервере(текОбъект);
	ЗначениеВДанныеФормы(текОбъект, Объект)

КонецПроцедуры

&НаСервере
Процедура АлгоритмПостроенияНаСервере(текОбъект)
	
	текОбъект.АлгоритмПостроенияНаСервере(текОбъект.ПунктОтправления, текОбъект.ПунктСледования, текОбъект.Судно, текОбъект.ТипСостава, текОбъект.Дата);
		
КонецПроцедуры


