#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ИспользоватьФункционалСУБ = ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ");
	
	Если Не ВидДокумента.ИмеетСрокДействия 
		Или СлужебныйПризнак 
		Или Не ИспользоватьФункционалСУБ Тогда	
		МассивНепроверяемыхРеквизитов.Добавить("СрокДействия");
		МассивНепроверяемыхРеквизитов.Добавить("ПодтвердитьДо");
	КонецЕсли;
	
	Если Не ВидДокумента.ТребуетсяУказаниеОборудования
		Или СлужебныйПризнак 
		Или Не ИспользоватьФункционалСУБ Тогда	
		МассивНепроверяемыхРеквизитов.Добавить("Оборудование");		
	КонецЕсли;
	
	Если СлужебныйПризнак Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаВыдачи");		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Если (Не СлужебныйПризнак И НЕ ВАрхиве) 
			Или Не ИспользоватьФункционалСУБ Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА 
			|ИЗ
			|	РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
			|ГДЕ
			|	НаличиеФайлов.ОбъектСФайлами = &ВладелецФайла
			|";
			Запрос.УстановитьПараметр("ВладелецФайла",Ссылка);
			
			Выборка = Запрос.Выполнить();
			
			Если Выборка.Пустой() Тогда
				
				ТекстОшибки = НСтр("ru = 'К сертификату должны быть прикреплены файлы';
				|en = 'Files must be attached to the certificate'");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,, , Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
