
&НаСервере
Функция СформироватьНаСервере()
	
	мОтчет = РеквизитФормыВЗначение("Отчет");
	Возврат мОтчет.СформироватьТабДок(Документ, Секция);

КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	ТабДок = СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	Элементы.Секция.СписокВыбора.Очистить();
	Элементы.Секция.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивБарж());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивБарж()
	
	Массив = новый Массив;
	Для Каждого Стр из Документ.Баржи Цикл
		Если ЗначениеЗаполнено(Стр.БаржаПриход) Тогда
			Если Массив.Найти(Стр.БаржаПриход) = Неопределено Тогда
				Массив.Добавить(Стр.БаржаПриход);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив

КонецФункции
