#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура по переданной ссылке на заказ расчитывает и записывает в регистр сведений состояние заказа.
//
//	Параметры:
//		МассивЗаказов - Массив - Массив документов типов ЗаказНаПеремещение, ЗаказНаСборку, ЗаказНаВнутреннееПотребление
//								 в рамках проведения которого перерасчитывается состояние
//		Отказ - Булево - признак прерывания обработки проведения.
//
Процедура ЗаполнитьИдентификаторНабора(Набор) Экспорт
	
	Для Каждого Запись Из Набор цикл
		
		Если Запись.Идентификатор = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() тогда
			Запись.Идентификатор = Новый УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли