
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОсновноеСудно	= vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно");
	
	Список.Параметры.УстановитьЗначениеПараметра(
		"ОсновноеСудно", ОсновноеСудно);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОсновным(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Список.ТекущиеДанные.Ссылка = ОсновноеСудно Тогда
		ОсновноеСудно	= Неопределено;
	Иначе
		ОсновноеСудно	= Элементы.Список.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	vftОбщегоНазначенияКлиент.УстановитьОсновноеСудно(ОсновноеСудно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменениеОсновногоСудна" Тогда
		
		ОсновноеСудно	= Параметр;
		Список.Параметры.УстановитьЗначениеПараметра("ОсновноеСудно", ОсновноеСудно);
		
		УправлениеФормойКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойКлиент()
 
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаИспользоватьОсновным.Пометка	= 
	    Элементы.Список.ТекущиеДанные.Свойство("Ссылка")
		И Элементы.Список.ТекущиеДанные.Ссылка = ОсновноеСудно;
		
	Элементы.ФормаИспользоватьОсновным.Доступность	= 
	    Элементы.Список.ТекущиеДанные.Свойство("Ссылка");

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	УправлениеФормойКлиент();
КонецПроцедуры
