//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для плана обмена "ОбменПолный" (РИБ)

Процедура ОбменПолныйЗарегистрироватьИзменение(Источник, Отказ) Экспорт
	
	// ++ rarus yukuzi 21.07.2021   //
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ГруппыПользователей") И не vftОбщегоНазначения.ЭтоГлавныйУзел() Тогда
		Возврат;
	КонецЕсли;
	// -- rarus yukuzi 21.07.2021
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("Полный", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменПолныйЗарегистрироватьИзменениеДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("Полный", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбменПолныйЗарегистрироватьИзменениеКонстанты(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("Полный", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменПолныйЗарегистрироватьИзменениеНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("Полный", Источник, Отказ, Замещение);
	
КонецПроцедуры

Процедура ОбменПолныйЗарегистрироватьУдаление(Источник, Отказ) Экспорт
	
	// ++ rarus Камаев П.В. 06.10.2020 Задача № 24955
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.vftРейс") И ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	// -- rarus Камаев П.В. 06.10.2020
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("Полный", Источник, Отказ);
	
КонецПроцедуры

