Функция ДанныеФайла(Файлы) Экспорт

	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Файлы, "ПометкаУдаления");
	
КонецФункции

Процедура ОчиститьИдентификаторФайла(Таблица) Экспорт
	
	Для Каждого Строка Из Таблица Цикл 
		Строка.ИдентификаторФайлов = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	КонецЦикла;	
	
КонецПроцедуры

Функция ПометитьНаУдалениеФайл(Идентификатор, ТаблицаХранения) Экспорт

	СтрокиФайлы = ТаблицаХранения.НайтиСтроки(Новый Структура("ИдентификаторФайлов", Идентификатор));
	
	Для Каждого СтрокаФайла из СтрокиФайлы цикл
		
		Если ЗначениеЗаполнено(СтрокаФайла.Файл)
			И ОбщегоНазначения.СсылкаСуществует(СтрокаФайла.Файл)
			И Не СтрокаФайла.Файл.ПометкаУдаления тогда
			
			Попытка 
				СтрокаФайла.Файл.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			Исключение
				ВызватьИсключение;
			КонецПопытки;
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецФункции