#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ТипМероприятия");
	Результат.Добавить("Обозначение");
	Результат.Добавить("ОбъектМероприятия");
	Результат.Добавить("ТипОсвидетельствования");
	Результат.Добавить("ВидДокумента");
	Результат.Добавить("ВидМероприятия");
	Результат.Добавить("КонтролирующийОрган");
	Результат.Добавить("ПериодическоеМероприятие");
	Результат.Добавить("ИмеетРезультатВыполнения");
	Результат.Добавить("ШаблонОпроса");
	Результат.Добавить("Комментарий");
	Результат.Добавить("Периодичность");
	Результат.Добавить("ХарактерМероприятия");
	Результат.Добавить("Подразделение");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли