
&НаКлиенте
Процедура РемонтныеРаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(ПолучитьМассивСтрок(Элементы.РемонтныеРаботы.ВыделенныеСтроки));
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивСтрок(ВыбранныеСтроки);
	
	МассивСтрок = Новый Массив;
	Для Каждого Стр из Элементы.РемонтныеРаботы.ВыделенныеСтроки Цикл
		СтруктураСтроки = Новый Структура("ВидРемонтныхРабот, ОбъектРемонта, ДатаНачала, ДатаОкончания, ДокументИсточник, ID");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, РемонтныеРаботы.НайтиПоИдентификатору(Стр));
		МассивСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат МассивСтрок;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	ОбъектыРемонта.Добавить(Параметры.ОбъектРемонта);
	Если Параметры.Свойство("ID") ТОгда
		ID_Список.Добавить(Параметры.ID);
	КонецЕсли;
	//Период.ДатаНачала = НачалоМесяца(Параметры.ВладелецДата);
	//Период.ДатаОкончания = КонецМесяца(Параметры.ВладелецДата);
	//СписокИскл.Загрузить(Параметры.СписокИД.Выгрузить());
	Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	//Период.ДатаНачала = НачалоГода(ТекущаяДата());
	//Период.ДатаОкончания = КонецГода(ТекущаяДата());
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	ЗаполнитьТаблицуРемонтов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРемонтов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ОбъектыРемонта", ОбъектыРемонта);
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	Запрос.УстановитьПараметр("ID", ID_Список);
	Запрос.УстановитьПараметр("НеИспользоватьID", ID_Список.Количество() = 0);
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	впПланГрафикППР.УникальныйИдентификатор КАК ID,
	|	впПланГрафикППР.ДатаНачалаПлан КАК ДатаНачала,
	|	впПланГрафикППР.ДатаОкончанияПлан КАК ДатаОкончания,
	|	впПланГрафикППР.ОбъектРемонта КАК ОбъектРемонта,
	|	впПланГрафикППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	впПланГрафикППР.ПланГрафик КАК ДокументИсточник,
	|	ЛОЖЬ КАК ЗакрываетПредписание
	|ИЗ
	|	РегистрСведений.впПланГрафикППР КАК впПланГрафикППР
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впАктыПоРемонтам КАК впАктыПоРемонтам
	|		ПО впПланГрафикППР.УникальныйИдентификатор = впАктыПоРемонтам.IDРемонта
	|ГДЕ
	|	НЕ впПланГрафикППР.Удален
	|	И НЕ впПланГрафикППР.Завершен
	|	И НЕ впПланГрафикППР.ЕстьЗаявка
	|	И впПланГрафикППР.ДатаНачалаПлан МЕЖДУ &НачПериода И &КонПериода
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	|	И впПланГрафикППР.ОбъектРемонта В ИЕРАРХИИ (&ОбъектыРемонта)
	//|	И впПланГрафикППР.ОбъектРемонта.ПодразделениеИсполнитель = &Подразделение
	|	И (впПланГрафикППР.УникальныйИдентификатор В (&ID) ИЛИ &НеИспользоватьID)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впАктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	впВыявленныеДефектыСписокДефектов.ID,
	|	впВыявленныеДефектыСписокДефектов.ДатаНачалаРемонта,
	|	впВыявленныеДефектыСписокДефектов.ДатаОкончанияРемонта,
	|	впВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент,
	|	впВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Значение,
	|	впВыявленныеДефектыСписокДефектов.Ссылка,
	|	впВыявленныеДефектыСписокДефектов.ЗакрываетПредписание
	|ИЗ
	|	Документ.впВыявленныеДефекты.СписокДефектов КАК впВыявленныеДефектыСписокДефектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.впВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК впВидРемонтаПриВводеНаОснованииВыявленныхДефектов
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впЗаявкиПоРемонтам КАК впЗаявкиПоРемонтам
	|		ПО впВыявленныеДефектыСписокДефектов.ID = впЗаявкиПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впАктыПоРемонтам КАК впАктыПоРемонтам
	|		ПО впВыявленныеДефектыСписокДефектов.ID = впАктыПоРемонтам.IDРемонта
	|ГДЕ
	|	впЗаявкиПоРемонтам.IDРемонта ЕСТЬ NULL
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И впВыявленныеДефектыСписокДефектов.Ссылка.Подразделение = &Подразделение
	|	И впВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент В ИЕРАРХИИ (&ОбъектыРемонта)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впВыявленныеДефектыСписокДефектов.Ссылка.Проведен
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И НЕ впВыявленныеДефектыСписокДефектов.ID В (&ИД)
	|	И (впВыявленныеДефектыСписокДефектов.ID В (&ID) ИЛИ &НеИспользоватьID)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впАктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.ID,
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.ПлановаяДатаРемонта,
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.ПлановаяДатаРемонта,
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.ОбъектРемонта,
	|	впВидРемонтаПриВводеНаОснованииВнешнихОснований.Значение,
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка,
	|	ИСТИНА
	|ИЗ
	|	Документ.впВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК впВнешнееОснованиеДляРаботОбследованноеОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.впВидРемонтаПриВводеНаОснованииВнешнихОснований КАК впВидРемонтаПриВводеНаОснованииВнешнихОснований
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впЗаявкиПоРемонтам КАК впЗаявкиПоРемонтам
	|		ПО впВнешнееОснованиеДляРаботОбследованноеОборудование.ID = впЗаявкиПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впАктыПоРемонтам КАК впАктыПоРемонтам
	|		ПО впВнешнееОснованиеДляРаботОбследованноеОборудование.ID = впАктыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.впВыявленныеДефекты.СписокДефектов КАК впВыявленныеДефектыСписокДефектов
	|		ПО впВнешнееОснованиеДляРаботОбследованноеОборудование.ID = впВыявленныеДефектыСписокДефектов.ID
	|ГДЕ
	|	впЗаявкиПоРемонтам.IDРемонта ЕСТЬ NULL
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И впВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.Подразделение = &Подразделение
	|	И впВнешнееОснованиеДляРаботОбследованноеОборудование.ОбъектРемонта В ИЕРАРХИИ (&ОбъектыРемонта)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.Проведен
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И НЕ впВнешнееОснованиеДляРаботОбследованноеОборудование.ID В (&ИД)
	|	И (впВнешнееОснованиеДляРаботОбследованноеОборудование.ID В (&ID) ИЛИ &НеИспользоватьID)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впАктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И впВыявленныеДефектыСписокДефектов.ID ЕСТЬ NULL
	// rarus evgenu 2020_12_01 ++ 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РемонтыОборудования.ID,
	|	РемонтыОборудования.ДатаНачала,
	|	РемонтыОборудования.ДатаОкончания,
	|	РемонтыОборудования.ОбъектРемонта,
	|	РемонтыОборудования.ВидРемонтныхРабот,
	|	РемонтыОборудования.Ссылка,
	|	ИСТИНА
	|ИЗ
	|	Документ.впЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыОборудования
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впЗаявкиПоРемонтам КАК впЗаявкиПоРемонтам
	//|		ПО РемонтыОборудования.ID = впЗаявкиПоРемонтам.IDРемонта
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впАктыПоРемонтам КАК впАктыПоРемонтам
	|		ПО РемонтыОборудования.ID = впАктыПоРемонтам.IDРемонта
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.впВыявленныеДефекты.СписокДефектов КАК впВыявленныеДефектыСписокДефектов
	//|		ПО РемонтыОборудования.ID = впВыявленныеДефектыСписокДефектов.ID
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|ГДЕ
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	впЗаявкиПоРемонтам.IDРемонта ЕСТЬ NULL
	//|	И РемонтыОборудования.Ссылка.Подразделение = &Подразделение
	|	РемонтыОборудования.ОбъектРемонта В ИЕРАРХИИ (&ОбъектыРемонта)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И РемонтыОборудования.Ссылка.Проведен
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И НЕ РемонтыОборудования.ID В (&ИД)
	|	И (РемонтыОборудования.ID В (&ID) ИЛИ &НеИспользоватьID)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впАктыПоРемонтам.IDРемонта ЕСТЬ NULL
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И впВыявленныеДефектыСписокДефектов.ID ЕСТЬ NULL";
	|	";
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	// rarus evgenu 2020_12_01 --
				   
	РемонтныеРаботы.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

// ++ rarus selmik 29.03.2021
&НаКлиенте
Процедура ОтображениеИерархииИКодаИерархии()
	Для Каждого СтрокаОбъектаРемонта Из РемонтныеРаботы Цикл
		
		ИерархияИКодИерархии = ПолучитьИерархиюИКодИерархииОбъектаРемонта(СтрокаОбъектаРемонта.ОбъектРемонта);
		ЗаполнитьЗначенияСвойств(СтрокаОбъектаРемонта, ИерархияИКодИерархии);
		
	КонецЦикла;	
КонецПроцедуры  // -- rarus selmik 29.03.2021

// ++ rarus selmik 29.03.2021
&НаСервере
Функция ПолучитьИерархиюИКодИерархииОбъектаРемонта(пОбъектРемонта)
	КодИерархии = "";
	Иерархия	= "";
	
	МассивРодителей = Новый Массив;
	
	Если ЗначениеЗаполнено(пОбъектРемонта) Тогда
		КодИерархии = пОбъектРемонта.рарусКодИерархии;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель.Родитель.Родитель.Родитель.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Родитель.Родитель.Родитель.Родитель.Наименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель.Родитель.Родитель.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Родитель.Родитель.Родитель.Наименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель.Родитель.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Родитель.Родитель.Наименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Родитель.Наименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Наименование);
		КонецЕсли;
	КонецЕсли;
	
	Счетчик = 0;
	Для Каждого ЭлементМассива Из МассивРодителей Цикл
		Если Счетчик < 2 Тогда
			Счетчик = Счетчик + 1;
			Продолжить;
		ИначеЕсли Счетчик = 2 Тогда
			Иерархия = ЭлементМассива;
		Иначе
			Иерархия = Иерархия + "->" + ЭлементМассива;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("КодИерархии", КодИерархии);
	СтруктураВозврата.Вставить("Иерархия"	, Иерархия);
	
	Возврат СтруктураВозврата;
	
КонецФункции // -- rarus selmik 29.03.2021


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьТаблицуРемонтов();
	// ++ rarus selmik 29.03.2021
	ОтображениеИерархииИКодаИерархии();
	// -- rarus selmik 29.03.2021
КонецПроцедуры

&НаКлиенте
Процедура РемонтныеРаботыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыборе(ПолучитьМассивСтрок(Элементы.РемонтныеРаботы.ВыделенныеСтроки));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// ++ rarus selmik 29.03.2021
	ОтображениеИерархииИКодаИерархии();
	// -- rarus selmik 29.03.2021
	
	// ++ rarus selmik 29.09.2021 РАIT-0023505
	НастройкаВидимостиУточненияПричиныЗакрытияПереноса();
	// -- rarus selmik 29.09.2021 РАIT-0023505
КонецПроцедуры

// ++ rarus selmik 29.09.2021 РАIT-0023505
&НаКлиенте
Процедура НастройкаВидимостиУточненияПричиныЗакрытияПереноса()
	Если ПричинаЗакрытия = ПредопределенноеЗначение("Справочник.впПричиныЗакрытияРемонтов.Прочее") Тогда
		Элементы.УточнениеПричиныПереноса.Видимость = Истина;
		Элементы.УточнениеПричиныЗакрытия.Видимость = Истина;
	Иначе
		Элементы.УточнениеПричиныПереноса.Видимость = Ложь;
		Элементы.УточнениеПричиныЗакрытия.Видимость = Ложь;
		УточнениеПричиныЗакрытияПереноса = "";
	КонецЕсли;
КонецПроцедуры // -- rarus selmik 29.09.2021 РАIT-0023505

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура ПеренестиОтменить(ПараметрыПереносаОтмены)
	
	ЗакрываемыеРемонты = Новый СписокЗначений;
	Для Каждого ВыделеннаяСтрока Из Элементы.РемонтныеРаботы.ВыделенныеСтроки Цикл
		ТекущиеДанные = РемонтныеРаботы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтруктураДанных = Новый Структура("Отменен, Перенесен, НоваяДатаНачала, НоваяДатаОкончания, ПричинаЗакрытия, УточнениеПричины");
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ПараметрыПереносаОтмены);
		
		СтруктураДанных.Вставить("ОбъектРемонта", ТекущиеДанные.ОбъектРемонта);
		СтруктураДанных.Вставить("ВидРемонта", ТекущиеДанные.ВидРемонтныхРабот);
		СтруктураДанных.Вставить("ДатаНачала", ТекущиеДанные.ДатаНачала);
		СтруктураДанных.Вставить("ДатаОкончания", ТекущиеДанные.ДатаОкончания);
		СтруктураДанных.Вставить("ДокументОснование", ТекущиеДанные.ДокументИсточник);
		СтруктураДанных.Вставить("ID", ТекущиеДанные.ID);
		
		ЗакрываемыеРемонты.Добавить(СтруктураДанных, 
			СтрШаблон("%1 %2 %3 %4", 
				Строка(ТекущиеДанные.ОбъектРемонта), 
				Строка(ТекущиеДанные.ВидРемонтныхРабот), 
				Строка(ТекущиеДанные.ДатаНачала), 
				Строка(ТекущиеДанные.ДатаОкончания)));
	КонецЦикла;
	ЗначенияЗаполнения = Новый Структура("ЗакрываемыеРемонты", ЗакрываемыеРемонты);		
	ОткрытьФорму("Документ.впЗакрытиеЗаявокИРемонтов.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
		ЭтотОбъект,
		1,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "впЗакрытиеЗаявокИРемонтов_Запись"  
		//RARUS-NN EvgenU РАIT-0023371 2021_06_11 ++   
		ИЛИ ИмяСобытия = "впАктОВыполненииЭтапаРабот_Запись" Тогда
		//RARUS-NN EvgenU РАIT-0023371 2021_06_11 --
		ЗаполнитьТаблицуРемонтов();
		// ++ rarus selmik 29.03.2021
		ОтображениеИерархииИКодаИерархии();
		// -- rarus selmik 29.03.2021

	ИначеЕсли ИмяСобытия = "ДобавитьОбъектРемонтаДляЗакрытияПереноса" 
		И ТипЗнч(Параметр) = Тип("Структура")
		И Параметр.Свойство("ОбъектРемонта") Тогда
		
		Если Параметр.Свойство("ID") ТОгда
			ID_Список.Добавить(Параметр.ID);
		КонецЕсли;
		ОбъектыРемонта.Добавить(Параметр.ОбъектРемонта);
		ЗаполнитьТаблицуРемонтов();
		// ++ rarus selmik 29.03.2021
		ОтображениеИерархииИКодаИерархии();
		// -- rarus selmik 29.03.2021
		Источник.СписокРемонтовУжеОткрыт = Истина;
	КонецЕсли;
	
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура Отменить(Команда)
	ПараметрыПереносаОтмены = Новый Структура;
	ПараметрыПереносаОтмены.Вставить("Отменен", ИСТИНА);
	ПараметрыПереносаОтмены.Вставить("ПричинаЗакрытия"	, ПричинаЗакрытия);
	ПараметрыПереносаОтмены.Вставить("УточнениеПричины"	, УточнениеПричиныЗакрытияПереноса);
	ПеренестиОтменить(ПараметрыПереносаОтмены);	
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура Перенести(Команда)
	ПараметрыПереносаОтмены = Новый Структура;
	ПараметрыПереносаОтмены.Вставить("Перенесен"			, ИСТИНА);
	ПараметрыПереносаОтмены.Вставить("ПричинаЗакрытия"		, ПричинаЗакрытия);
	ПараметрыПереносаОтмены.Вставить("НоваяДатаНачала"		, ПериодПереноса.ДатаНачала);
	ПараметрыПереносаОтмены.Вставить("НоваяДатаОкончания"	, ПериодПереноса.ДатаОкончания);
	ПараметрыПереносаОтмены.Вставить("НоваяДатаОкончания"	, ПериодПереноса.ДатаОкончания);
	ПараметрыПереносаОтмены.Вставить("УточнениеПричины"		, УточнениеПричиныЗакрытияПереноса);
	ПеренестиОтменить(ПараметрыПереносаОтмены);	
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023371 2021_06_11 ++
&НаКлиенте
Процедура Акт(Команда)

	РемонтыОборудования = Новый СписокЗначений;
	Для Каждого ВыделеннаяСтрока Из Элементы.РемонтныеРаботы.ВыделенныеСтроки Цикл
		ТекущиеДанные = РемонтныеРаботы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтруктураДанных = Новый Структура();
		//ЗаполнитьЗначенияСвойств(СтруктураДанных, ПараметрыПереносаОтмены);
		
		СтруктураДанных.Вставить("ОбъектРемонта", ТекущиеДанные.ОбъектРемонта);
		СтруктураДанных.Вставить("ВидРемонтныхРабот", ТекущиеДанные.ВидРемонтныхРабот);
		СтруктураДанных.Вставить("ДатаНачала", ТекущиеДанные.ДатаНачала);
		СтруктураДанных.Вставить("ДатаОкончания", ТекущиеДанные.ДатаОкончания);
		СтруктураДанных.Вставить("ДокументИсточник", ТекущиеДанные.ДокументИсточник);
		СтруктураДанных.Вставить("ID", ТекущиеДанные.ID);
		
		РемонтыОборудования.Добавить(СтруктураДанных, 
			СтрШаблон("%1 %2 %3 %4", 
				Строка(ТекущиеДанные.ОбъектРемонта), 
				Строка(ТекущиеДанные.ВидРемонтныхРабот), 
				Строка(ТекущиеДанные.ДатаНачала), 
				Строка(ТекущиеДанные.ДатаОкончания)));
	КонецЦикла;
	ЗначенияЗаполнения = Новый Структура("РемонтыОборудования", РемонтыОборудования);		
	ОткрытьФорму("Документ.впАктОВыполненииЭтапаРабот.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
		ЭтотОбъект,
		1,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023371 2021_06_11 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура РемонтныеРаботыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.РемонтныеРаботы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПериодПереноса.ДатаНачала = ТекДанные.ДатаНачала;
		ПериодПереноса.ДатаОкончания = ТекДанные.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура ПериодПереносаДатаНачалаПриИзменении(Элемент)
	Если ПериодПереноса.ДатаНачала > ПериодПереноса.ДатаОкончания Тогда
		ПериодПереноса.ДатаОкончания = ПериодПереноса.ДатаНачала;
	КонецЕсли;
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура ПериодПереносаДатаОкончанияПриИзменении(Элемент)
	Если ПериодПереноса.ДатаНачала > ПериодПереноса.ДатаОкончания Тогда
		ПериодПереноса.ДатаНачала = ПериодПереноса.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

// ++ rarus selmik 29.09.2021 РАIT-0023505
&НаКлиенте
Процедура ПричинаЗакрытия1ПриИзменении(Элемент)
	НастройкаВидимостиУточненияПричиныЗакрытияПереноса();
КонецПроцедуры // -- rarus selmik 29.09.2021 РАIT-0023505

// ++ rarus selmik 29.09.2021 РАIT-0023505
&НаКлиенте
Процедура ПричинаЗакрытияПриИзменении(Элемент)
	НастройкаВидимостиУточненияПричиныЗакрытияПереноса()
КонецПроцедуры // -- rarus selmik 29.09.2021 РАIT-0023505

	

