
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отбор = Новый Структура("СтатусСогласования", СтатусСогласованияНаДоработку());
		
	БыстрыеОтборы = Новый Структура("СтатусСогласования", Новый Структура("Видимость", Ложь));
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("Заголовок", "Заявки на доработку");	
	ПараметрыФормы.Вставить("БыстрыеОтборы", БыстрыеОтборы);
	
	КлючУникальности = ПараметрыВыполненияКоманды.НавигационнаяСсылка;
	ОткрытьФорму("Документ.впЗаявкаНаСнабжение.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, КлючУникальности, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция СтатусСогласованияНаДоработку()
	
	Возврат рарусЗаявкаНаСнабжениеСервер.СтатусСогласованияНаДоработкуВЗависимотстиОтРолиПользователя();	
	
КонецФункции	