// Процедура-обработчик обновления и первоначального заполнения
// данных ИБ, которая выполняется однократно при переходе на версию 1.0.0.20.
//
Процедура ПерейтиНаВерсию_1_0_0_20() Экспорт
	
	ПреобразоватьКоординатыВДокументахРДО();
	
КонецПроцедуры

Процедура ПреобразоватьКоординатыВДокументахРДО()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.Текст = "ВЫБРАТЬ
	               |	vftРДО.Ссылка
	               |ИЗ
	               |	Документ.vftРДО КАК vftРДО
	               |ГДЕ
	               |	vftРДО.ДислокацияКоординаты <> &ПустаяСтрока";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументО = Выборка.Ссылка.ПолучитьОбъект();
		ПервоначальнаяСтрокаКоординат = ДокументО.ДислокацияКоординаты;
		
		
		СимволТочки = Найти(ПервоначальнаяСтрокаКоординат,".");
		//СимволПробел = Найти(ПервоначальнаяСтрокаКоординат," ");
		КN = Лев(ПервоначальнаяСтрокаКоординат,СимволТочки-1);
		КN = СтрЗаменить(КN,"'", "");
		Попытка
			KN_Число = Число(КN);
		Исключение
		    KN_Число = 0;//ОписаниеОшибки()
		КонецПопытки;
		
		Для СимволПроверки = СимволТочки+1 По СтрДлина(ПервоначальнаяСтрокаКоординат) Цикл
			СимволТек = Сред(ПервоначальнаяСтрокаКоординат,СимволПроверки,1);
			Если СимволТек = "." Тогда
				Прервать;
			КонецЕсли; 	
		КонецЦикла;
		
		СимволВторичнойПроверки = СимволПроверки;
		Пока СимволВторичнойПроверки<>0 Цикл
			СимволТек = Сред(ПервоначальнаяСтрокаКоординат,СимволВторичнойПроверки,1);
			Если СимволТек = " " Тогда
				Прервать;
			КонецЕсли; 
			СимволВторичнойПроверки= СимволВторичнойПроверки-1;	
		КонецЦикла; 
		
		Для СимволТретьейПроверки = СимволВторичнойПроверки По СимволПроверки-1 Цикл
			СимволТек = Сред(ПервоначальнаяСтрокаКоординат,СимволТретьейПроверки,1);
			Если СимволТек<>"0" Тогда
				Прервать;
			КонецЕсли; 	
		КонецЦикла; 
		
		КE = Сред(ПервоначальнаяСтрокаКоординат, СимволТретьейПроверки,СимволПроверки - СимволТретьейПроверки+1);
		КE = СтрЗаменить(КE,"'","");
		Попытка
			КE_Число = Число(КE);
		Исключение
		   	КE_Число = 0;
		КонецПопытки;
		
		ДокументО.ОбменДанными.Загрузка = Истина;
		ДокументО.КоординатыN = KN_Число;
		ДокументО.КоординатыE = КE_Число;
		
		ДокументО.Записать(РежимЗаписиДокумента.Запись);
	
	КонецЦикла; 
КонецПроцедуры
 