
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыПечати = Новый Структура("ОбъектыПечати, МенеджерПечати, Идентификатор, Параметры, Форма", 
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрКоманды), 
		"Документ.впАктОВыполненииЭтапаРабот", 
		"ОтчетОВыполненииРемонта", 
		Новый Массив, 
		ПараметрыВыполненияКоманды.Источник);
	впПечать.НапечататьДокумент(
		ПараметрыПечати.МенеджерПечати, 
		ПараметрыПечати.Идентификатор, 
		ПараметрыПечати.ОбъектыПечати, 
		Новый Структура);		
КонецПроцедуры
