&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ДатаВходящегоДокумента = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ПараметрыЗакрытия());
	
КонецПроцедуры


&НаСервере
Функция ПараметрыЗакрытия()
	
	Массив = Новый Массив;
	Для Каждого Строка Из ПриложенныеФайлы Цикл
		СтруктураФайла = Новый Структура;
		СтруктураФайла.Вставить("ИмяФайла", Строка.ИмяФайла);
		СтруктураФайла.Вставить("СведенияОФайле", Строка.СведенияОФайле);
		// ++ rarus makole 2021-04-23
		СтруктураФайла.Вставить("ПутьКВременномуФайлу", Строка.тПуть);
		// -- rarus makole 2021-04-23
		Массив.Добавить(СтруктураФайла);
	КонецЦикла;
	
	Структура = Новый Структура();
	Структура.Вставить("ДатаВходящегоДокумента", ДатаВходящегоДокумента);
	Структура.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
	Структура.Вставить("Комментарий", Комментарий);
	Структура.Вставить("СведенияОФайлах", Массив);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура КонтрольЗаполненияПараметров()
	
	ПараметрыЗаполнены = Истина;
	
	Если НЕ ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
		ПараметрыЗаполнены = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерВходящегоДокумента) Тогда
		ПараметрыЗаполнены = Ложь;
	КонецЕсли;
	
	Если ПриложенныеФайлы.Количество() = 0 Тогда
		ПараметрыЗаполнены = Ложь;
	КонецЕсли;
	
	Элементы.ОК.Доступность = ПараметрыЗаполнены;
	
КонецПроцедуры
&НаКлиенте
Процедура НомерВходящегоДокументаПриИзменении(Элемент)
	
	КонтрольЗаполненияПараметров();
	
КонецПроцедуры
&НаКлиенте
Процедура ДатаВходящегоДокументаПриИзменении(Элемент)
	
	КонтрольЗаполненияПараметров();
	
КонецПроцедуры
&НаКлиенте
Процедура ПриложенныеФайлыИмяФайлаПриИзменении(Элемент)
	
	КонтрольЗаполненияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	АдресВременногоХранилища = "";
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//Фильтр = НСтр("ru = 'Текст'; en = 'Text'") + "(*.txt)|*.txt";
	//ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Для Каждого ВыбранныйФайл Из ДиалогОткрытияФайла.ВыбранныеФайлы Цикл
			Попытка
				Файл = Новый Файл(ВыбранныйФайл);
				//ДвоичныеДанные = Новый ДвоичныеДанные(ВыбранныйФайл);
				//АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Параметры.UID);
				
				// +
				ПомещаемыеФайлы = Новый Массив;
				Описание = Новый ОписаниеПередаваемогоФайла(Файл.ПолноеИмя, "");
				ПомещаемыеФайлы.Добавить(Описание);
				
				ПомещенныеФайлы = Новый Массив;
				
				Если НЕ ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь, Параметры.UID) Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка при помещении файла
					|""%1""
					|в программу.'"),
					Файл.ПолноеИмя) );
					Продолжить;
				КонецЕсли;
				
				АдресВременногоХранилища = ПомещенныеФайлы[0].Хранение;				
				// -;
				
				СведенияОФайле = РаботаСФайламиКлиентСервер.СведенияОФайле("Файл", Файл);
				СведенияОФайле.ИмяСправочникаХранилищаФайлов = "рарусАктВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"; 
				СведенияОФайле.АдресВременногоХранилищаФайла = АдресВременногоХранилища;
				СведенияОФайле.АдресВременногоХранилищаТекста = "";
				
				Строка = ПриложенныеФайлы.Добавить();
				Строка.СведенияОФайле = СведенияОФайле;
				Строка.ИмяФайла = Файл.Имя;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ПоказатьПредупреждение(, ОписаниеОшибки ,,"Ошибка");
			КонецПопытки;
		КонецЦикла;
		КонтрольЗаполненияПараметров();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	ТекущиеДанные = Элементы.ПриложенныеФайлы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПриложенныеФайлы.Удалить(ТекущиеДанные);
		КонтрольЗаполненияПараметров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьФайл(Команда)
	
	#Если НЕ ВебКлиент Тогда
	ТекущиеДанные = Элементы.ПриложенныеФайлы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ТекущиеДанные.СведенияОФайле.АдресВременногоХранилищаФайла);
		// ++ rarus makole 2021-04-23
		// сохраним пути ко временным файлам для их последующего удаления
		
		//тПуть = ПолучитьИмяВременногоФайла(ТекущиеДанные.СведенияОФайле.РасширениеБезТочки);
		//ДвоичныеДанные.Записать(тПуть);
		//Попытка
		//	ЗапуститьПриложение(тПуть);
		//Исключение
		//	ОписаниеОшибки = ОписаниеОшибки();
		//	ПоказатьПредупреждение(, ОписаниеОшибки ,,"Ошибка");
		//КонецПопытки
		ТекущиеДанные.тПуть = ПолучитьИмяВременногоФайла(ТекущиеДанные.СведенияОФайле.РасширениеБезТочки);
		ДвоичныеДанные.Записать(ТекущиеДанные.тПуть);
		ФайловаяСистемаКлиент.ОткрытьФайл(ТекущиеДанные.тПуть);
		// -- rarus makole 2021-04-23	
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры



