#Область Конвертация

Процедура ПриходТМЦПослеЗагрузки(Объект, Ссылка, ОбъектНайден, ОбъектМодифицирован, ПараметрыОбъекта = Неопределено, Отказ = Ложь) Экспорт
	
	УстановитьВидОперации(Объект, ОбъектНайден, ПараметрыОбъекта);
			
КонецПроцедуры

Процедура УстановитьВидОперации(Объект, Знач ОбъектНайден, ПараметрыОбъекта)
		
	Если НЕ ОбъектНайден И НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаУПоставщика;
		
		Если ПараметрыОбъекта <> Неопределено тогда
			
			ЗакупкаЧерезПодотчетноеЛицо = Неопределено;
			Если ПроверитьСвойство(ПараметрыОбъекта, "ЗакупкаЧерезПодотчетноеЛицо", ЗакупкаЧерезПодотчетноеЛицо) Тогда
				Если ЗакупкаЧерезПодотчетноеЛицо = Истина Тогда
					ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаЧерезПодотчетноеЛицо;
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЕсли;
		
		Объект.ВидОперации = ВидОперации;
		
	КонецЕсли;
	
	// ++ rarus makole 2021-03-31
	// Признак удалён
	//// ++ rarus atyutyakin 20.02.2021  [ФТ.ИМ.02.01]
	//рарусИмущественныйУчетСервер.УстановитьПризнакПолученияВБМ(Объект);
	//// -- rarus atyutyakin 20.02.2021
	// -- rarus makole 2021-03-31

КонецПроцедуры	

#КонецОбласти 

Функция ПроверитьСвойство(ПараметрыОбъекта, ИмяСвойства, Значение = Неопределено)
	
	Значение = ПараметрыОбъекта.Получить(ИмяСвойства);
	
	Возврат Значение <> Неопределено;
	
КонецФункции
