#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьНастройкиПоУмолчанию(Вариант = Неопределено) Экспорт
	
	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("Загружать2", Новый ОписаниеТипов("Булево"));
	ТаблицаНастроек.Колонки.Добавить("Выгружать2", Новый ОписаниеТипов("Булево"));
	ТаблицаНастроек.Колонки.Добавить("Загружать1", Новый ОписаниеТипов("Булево"));
	ТаблицаНастроек.Колонки.Добавить("Выгружать1", Новый ОписаниеТипов("Булево"));
	ТаблицаНастроек.Колонки.Добавить("Объект", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	
#Область Документы
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусАктВыполненныхРаботОказанныхУслуг"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впАктОВыполненииЭтапаРабот"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.vftАнализСУБ"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.Анкета"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впВнешнееОснованиеДляРабот"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.Встреча"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впВыявленныеДефекты"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.vftДокладОСостоянииБезопасности"), Истина, Истина, Истина, Истина);

	// ++ rarus makole 2021-08-12
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусЗаказКлиента"), Ложь, Ложь, Истина, Истина);
	// -- rarus makole 2021-08-12

	// ++ rarus makole 2021-06-16
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусЗаказНаПеремещение"), Ложь, Ложь, Истина, Истина);
	// -- rarus makole 2021-06-16
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впЗаказПоставщику"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впЗакрытиеЗаявокИРемонтов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.ЗапланированноеВзаимодействие"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впЗаявкаНаРемонт"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впЗаявкаНаСнабжение"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусИзменениеСтатусаТМЦ"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусИнвентаризацияТМЦ"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.НазначениеОпросов"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.ОтзывСогласияНаОбработкуПерсональныхДанных"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусОтражениеИмуществаВУчете"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впПеремещениеТоваров"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впПланГрафикРемонта"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впПриходТМЦ"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.vftРапортОПоврежденииНеисправности"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусРасходТМЦ"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.vftРДО"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.vftРейс"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.СогласиеНаОбработкуПерсональныхДанных"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.СообщениеSMS"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.vftСообщениеОПотенциальномИнциденте"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впСостоянияОбъектовРемонта"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.ТелефонныйЗвонок"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.впУчетНаработкиОборудования"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусМероприятиеСУБ"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусУчение"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("ДокументСсылка.рарусОтчетСУБ"), Истина, Истина, Истина, Истина);

#КонецОбласти

#Область Справочники
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусАналитикиПростоя"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусАтласы"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftБассейны"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Валюты"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ВерсииФайлов"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впВидыДефектов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ВидыКонтактнойИнформации"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ВидыНоменклатуры"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ВидыПроверок"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусВидыРемонтныхВедомостей"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впВидыРемонтов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впВидыЭксплуатации"), Ложь, Ложь, Истина, Истина);

	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftВнешниеИсточники"), Ложь, Ложь, Истина, Ложь);
	
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ВнешниеПользователи"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftВодныеУчастки"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ВопросыШаблонаАнкеты"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Календари"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftГрузы"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ГруппыВнешнихПользователей"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ГруппыДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ГруппыИсполнителейЗадач"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ГруппыПользователей"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftГруппыСудов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftДокладыОНесоответствии"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ЗначенияСвойствОбъектов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ЕдиницыИзмерения"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впКвалификацииРемонтногоПерсонала"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впЗаведование"), Истина, Истина, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Заметки"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впИдентификаторыТехКарт"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусКатегорииНоменклатуры"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.КлассификаторБанков"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусКлассыСудов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.КлючиДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.КлючевыеОперации"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Контрагенты"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впКритичностьДефекта"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусЛоцманы"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусМаркиТоплива"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впМодельРДО"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.НаборыГруппДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.НаборыДополнительныхРеквизитовИСведений"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.НаборыУпаковок"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftНесоответствия"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftНесоответствияПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Номенклатура"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусНоменклатураПоставщиков"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впОбъектыРемонта"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусОператорыСпутниковогоСегмента"), Истина, Истина, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Организации"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ВариантыОтчетов"), Ложь, Ложь, Ложь, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ПапкиФайлов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ПапкиЭлектронныхПисем"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ПараметрыВыработкиОС"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftПодразделенияКомпании"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Пользователи"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ПользовательскиеНастройкиОтчетов"), Ложь, Ложь, Ложь, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ПравилаПроверкиУчета"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ПредопределенныеВариантыОтчетов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впПриоритетыОбъектовРемонта"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Производители"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впАктОВыполненииЭтапаРаботПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусАктВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ВстречаПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впВыявленныеДефектыПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ЗапланированноеВзаимодействиеПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впЗаявкаНаРемонтПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впЗаявкаНаСнабжениеПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впОбъектыРемонтаПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впПриходТМЦПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftРейсПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.СообщениеSMSПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	// ++ rarus makole 2021-07-21
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусСтепениРиска"), Ложь, Ложь, Истина, Истина);
	// -- rarus makole 2021-07-21
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ТелефонныйЗвонокПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впТехКартыПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ШаблоныСообщенийПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впПричиныДефектов"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впПричиныЗакрытияЗаявок"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впПричиныЗакрытияРемонтов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впПричиныПростояОборудования"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ПрограммыЭлектроннойПодписиИШифрования"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftПроектыСудов"), Ложь, Ложь, Истина, Истина);

	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ПроизводственныеКалендари"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ПрофилиГруппДоступа"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусПрочиеСуда"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftПунктыСледования"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.РолиИсполнителей"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftСУБ"), Истина, Истина, Истина, Истина);

	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftСУБПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Склады"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впСпособыПланированияРемонтныхРабот"), Ложь, Ложь, Истина, Истина);

	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусСправочникСсылок"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусСтандартыПередачиДанных"), Истина, Истина, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.СтраныМира"), Истина, Истина, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.СтроковыеКонтактыВзаимодействий"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftСуда"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впТехКарты"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впТехнологическиеОперации"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftТиповыеОперации"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусТипыПунктовСледования"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусТипыСоставов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.впУсловияВыявленияДефекта"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусУчасткиСОЛП"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.Файлы"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ФизическиеЛица"), Ложь, Ложь, Истина, Истина);

	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ШаблоныАнкет"), Ложь, Ложь, Истина, Истина);

	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftШаблоныРДО"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ШаблоныСообщений"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftСообщениеОПотенциальномИнцидентеПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);	
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftДокладОСостоянииБезопасностиПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);	
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.vftАнализСУБПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусЗоныОтветственности"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусКлассификаторыКодовУстраненияЗамечаний"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусКлассификаторыКодовЗамечаний"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусСвидетельстваСудов"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусСвидетельстваСудовПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусУчениеПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусМероприятиеСУБПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусВидыМероприятийСУБ"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусКонтролирующиеОрганы"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусТипыОсвидетельствования"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусВидыМероприятийСУБПрисоединенныеФайлы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусВидыДокументовОсвидетельствования"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусГруппыДокументовСудов"), Истина, Истина, Истина, Истина);
	//++ rarus zalikh 2021-04-30 [27309]
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.ВариантыОтветовАнкет"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусТипыСудов"), Ложь, Ложь, Истина, Истина);
	//-- rarus zalikh 2021-04-30
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусТребования"), Истина, Истина, Истина, Истина);
	// ++ rarus yukuzi 30.08.2021   //
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусКонвенции"), Ложь, Ложь, Истина, Ложь);
	// -- rarus yukuzi 30.08.2021
	// ++ rarus yukuzi 14.09.2021   //
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусВиджеты"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусПоказателиВиджетов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусПериодыВиджетовПоУмолчанию"), Ложь, Ложь, Истина, Ложь);
	// -- rarus yukuzi 14.09.2021
	
	// ++ rarus makole 2021-09-30 [РАIT-0023495]
	// Доработка отдельных механизмов по учёту и списанию ТМЦ на судах
	ДобавитьНастройку(ТаблицаНастроек, Тип("СправочникСсылка.рарусРасходТМЦПрисоединенныеФайлы"), Ложь, Ложь, Истина, Истина);
	// -- rarus makole 2021-09-30 [РАIT-0023495]
	
#КонецОбласти

#Область ПланыВидовХарактеристик

	//++ rarus zalikh 2021-04-30 [27309]
	ДобавитьНастройку(ТаблицаНастроек, Тип("ПланВидовХарактеристикСсылка.ВопросыДляАнкетирования"), Ложь, Ложь, Истина, Истина);
	//-- rarus zalikh 2021-04-30
	
#КонецОбласти

#Область РегистрыСведений
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусАктуальныеНормыСледованияПоПроектамСудов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впАктыПоРемонтам"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ДанныеБизнесПроцессов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ВерсииОбъектов"), Ложь, Ложь, Ложь, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ВерсииПодсистем"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ВерсииПодсистемОбластейДанных"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.vftВнешниеДанные"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ГруппыЗначенийДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусГруппыТиповыхОперацийИАналитикДляОтчетов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ДанныеОбработанныеВЦентральномУзлеРИБ"), Ложь, Ложь, Ложь, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ДанныеПроизводственногоКалендаря"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ДатыЗапретаИзменения"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ДатыПоследнейЗагрузкиПочтовыхСообщений"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ДвоичныеДанныеФайлов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ДополнительныеСведения"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ЗависимостиПравДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впЗапчасти"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впЗаявкиНаСнабжение"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впЗаявкиПоРемонтам"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ЗначенияГруппДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ЗначенияГруппДоступаПоУмолчанию"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ИдентификаторыПолученныхЭлектронныхПисем"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впИнтеграцияДокументов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ИсполнителиЗадач"), Ложь, Ложь, Истина, Истина);

	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КалендарныеГрафики"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КлючиДоступаВнешнихПользователей"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КлючиДоступаГруппДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КлючиДоступаКОбъектам"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КлючиДоступаКРегистрам"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КлючиДоступаКРегиструРезультатыПроверкиУчета"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КлючиДоступаНаборовГруппДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КлючиДоступаПользователей"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КодировкиФайлов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КонтактыВзаимодействий"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.КурсыВалют"), Истина, Истина, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусЛогСменыВариантаСинхронизации"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впМаксПериодБезНаработки"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НазначениеДополнительныхОбработок"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НаличиеФайлов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НапоминанияПользователя"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впНаработкаОбъектовРемонта"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НаследованиеНастроекПравОбъектов"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НастройкиВариантовОтчетов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НастройкиВерсионированияОбъектов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НастройкиКомандПечати"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НастройкиОчисткиФайлов"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.vftНастройкиПользователей"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НастройкиПравОбъектов"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НастройкиУчетныхЗаписейЭлектроннойПочты"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впНормативныеРемонтыОборудования"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впНормыЗапчастейНаОбъектыРемонта"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.vftНормыСледования"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ОбновлениеКлючейДоступаКДанным"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ОбновлениеКлючейДоступаПользователей"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ОтветыНаВопросыАнкет"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впОтмененныеПеренесенныеРемонты"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусОчередьОбработкиДублей"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ПакетыИнформацииПриЗапуске"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впПараметрыНаработкиОбъектовРемонта"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ПараметрыОграниченияДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ПараметрыРаботыПрограммы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впПланГрафикППР"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ПользовательскиеМакетыПечати"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ПользовательскиеНастройкиДоступаКОбработкам"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ПраваРолей"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ПредметыПапкиВзаимодействий"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусПринадлежностьIPАдресовСпутниковомуСегменту"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусПринадлежностьСуднаКБТОФ"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ПроцессыДляЗапуска"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.РучныеИзмененияГрафиковРаботы"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.СведенияОФайлах"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.vftСвязьПунктовСледования"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.СертификатыШифрования"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.СклоненияПредставленийОбъектов"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.СогласияНаОбработкуПерсональныхДанных"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусСоответствиеПользователяФизическомуЛицу"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.СоставыГруппПользователей"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусСостоянияЗаявокНаСнабжение"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусСостоянияСтрокЗаявокНаСнабжение"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.СубъектыДляСкрытияПерсональныхДанных"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.vftТаблицаДвижения"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.vftТаблицаМорскихРасстояний"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ТаблицыГруппДоступа"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.впТекущееСостояниеОР"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.УведомленияОПрочтении"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.ЭлектронныеПодписи"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусДанныеПланГрафиковМероприятийСУБ"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусПлановыеСрокиОсвидетельствованийРМРС"), Истина, Истина, Истина, Истина);
	// ++ rarus PleA 23.04.2021 [28827 ]
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусМинимальныеОстаткиНоменклатуры"), Ложь, Ложь, Истина, Истина);
	// -- rarus PleA
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусЦеныНоменклатуры"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусШтрихкодыНоменклатуры"), Ложь, Ложь, Истина, Истина);
	//rarus_AfoD 20.07.2021 < 
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусВерсииКонфигурации"), Ложь, Истина, Ложь, Истина);
	//rarus_AfoD 20.07.2021 > 
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрСведенийНаборЗаписей.рарусДополнительныеДанныеЗамечаний"), Истина, Истина, Истина, Истина);

#КонецОбласти

#Область РегистрыНакопления
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрНакопленияНаборЗаписей.впТоварыНаСкладах"), Ложь, Ложь, Истина, Истина);
	// ++ rarus makole 2021-06-16
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрНакопленияНаборЗаписей.рарусТоварыКОтгрузке"), Ложь, Ложь, Истина, Истина);
	// -- rarus makole 2021-06-16
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрНакопленияНаборЗаписей.впТоварыКПоступлению"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрНакопленияНаборЗаписей.рарусОказанныеУслуги"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрНакопленияНаборЗаписей.впПроцентВыполненныхРабот"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрНакопленияНаборЗаписей.впВремяПростояОборудования"), Истина, Истина, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрНакопленияНаборЗаписей.рарусИмуществоНаСудах"), Ложь, Ложь, Истина, Истина);
	ДобавитьНастройку(ТаблицаНастроек, Тип("РегистрНакопленияНаборЗаписей.рарусТоварыЗаявокНаСнабжение"), Истина, Истина, Истина, Истина);
#КонецОбласти
	
 #Область Константы

	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ВерсияКлассификатораБанков"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.впВидРемонтаПриВводеНаОснованииВнешнихОснований"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.впВидРемонтаПриВводеНаОснованииВыявленныхДефектов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ДетализироватьОбновлениеИБВЖурналеРегистрации"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ДнейДоСкрытияПерсональныхДанныхСубъектов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ДополнительныйЯзык1"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ДополнительныйЯзык2"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ЕдиницаИзмеренияВеса"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ЕдиницаИзмеренияОбъема"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ЗапретитьОтображениеНебезопасногоСодержимогоВПисьмах"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ЗапрещатьЗагрузкуФайловПоРасширению"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИзменятьЗаданияЗаднимЧислом"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьАнкетирование"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьБизнесПроцессыИЗадачи"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьВерсионированиеОбъектов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьВнешнихПользователей"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьГруппыПользователей"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьДатуИВремяВСрокахЗадач"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьДатуНачалаЗадач"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьДатыЗапретаЗагрузки"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьДатыЗапретаИзменения"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьДополнительныеОтчетыИОбработки"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьДополнительныеРеквизитыИСведения"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьДополнительныйЯзык1"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьДополнительныйЯзык2"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьЗаметки"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.рарусИспользоватьКонтрольВыбораПунктов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьНапоминанияПользователя"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьНесколькоПроизводственныхКалендарей"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьОнлайнПоддержку"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьОтправкуSMSВШаблонахСообщений"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьПодчиненныеБизнесПроцессы"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьПолнотекстовыйПоиск"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьПочтовыйКлиент"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьПризнакРассмотрено"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьПрочиеВзаимодействия"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьСервисСклоненияMorpher"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьСкрытиеПерсональныхДанныхСубъектов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьУдалениеПомеченныхОбъектов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьШаблоныСообщений"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьШифрование"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьЭлектроннуюПочтуВШаблонахСообщений"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ИспользоватьЭлектронныеПодписи"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.МаксимальныйРазмерФайла"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.МаксимальныйРазмерФайлаОбластиДанных"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.рарусМаксимальныйРазмерФайлаДляСпутника"), Истина, Истина, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.НастройкиКолонтитулов"), Ложь, Ложь, Истина, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.НастройкиПодчиненногоУзлаРИБ"), Ложь, Ложь, Ложь, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.vftНачалоВыгрузки"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.vftНачалоПогрузки"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ОграничиватьДоступНаУровнеЗаписей"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ОграничиватьДоступНаУровнеЗаписейУниверсально"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.vftОкончаниеВыгрузки"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.vftОкончаниеПогрузки"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.впОсновнаяОрганизация"), Истина, Истина, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ОсновнойЯзык"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ОтложенноеОбновлениеВГлавномУзлеЗавершеноУспешно"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ОтложенноеОбновлениеЗавершеноУспешно"), Ложь, Ложь, Ложь, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ОтправлятьПисьмаВФорматеHTML"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.ПровайдерSMS"), Ложь, Ложь, Ложь, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.СведенияОБлокируемыхОбъектах"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.СведенияОбОбновленииИБ"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.СписокЗапрещенныхРасширений"), Ложь, Ложь, Ложь, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.СписокЗапрещенныхРасширенийОбластиДанных"), Ложь, Ложь, Ложь, Ложь);

	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.СписокРасширенийТекстовыхФайлов"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.СписокРасширенийФайловOpenDocumentОбластиДанных"), Ложь, Ложь, Истина, Ложь);
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.СписокРасширенийФайловOpenDocument"), Ложь, Ложь, Истина, Ложь);
	// ++ rarus makole 2021-04-22 [РАIT-0023257. ТОИР.СНБ.01.ИМУЩ]
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.рарусУчетКартНавигацииКакУслуги"), Истина, Истина, Истина, Ложь);
	// -- rarus makole 2021-04-22 [РАIT-0023257. ТОИР.СНБ.01.ИМУЩ]
	//rarus_AfoD 17.09.2021 < 
	ДобавитьНастройку(ТаблицаНастроек, Тип("КонстантаМенеджер.рарусИспользоватьСтатусыЗаявокНаПереносРабот"), Ложь, Ложь, Истина, Ложь);
	//rarus_AfoD 17.09.2021 > 
	
#КонецОбласти

#Область Задачи
	ДобавитьНастройку(ТаблицаНастроек, Тип("ЗадачаСсылка.ЗадачаИсполнителя"), Ложь, Ложь, Истина, Истина);
#КонецОбласти
	
#Область БизнесПроцессы
	ДобавитьНастройку(ТаблицаНастроек, Тип("БизнесПроцессСсылка.Задание"), Ложь, Ложь, Истина, Истина);
#КонецОбласти
		
	Если Вариант = 1 Тогда
		
		ТаблицаНастроек.Колонки.Удалить("Выгружать2");
		ТаблицаНастроек.Колонки.Удалить("Загружать2");
		
	ИначеЕсли Вариант = 2 Тогда
		
		ТаблицаНастроек.Колонки.Удалить("Выгружать1");
		ТаблицаНастроек.Колонки.Удалить("Загружать1");
		
	КонецЕсли;
		
	Возврат ТаблицаНастроек
		
КонецФункции

Процедура ДобавитьНастройку(ТаблицаНастроек, ТипОбъекта, Выгружать1, Загружать1, Выгружать2, Загружать2)
	
	СтрокаОбъекта = ТаблицаНастроек.Добавить();
	СтрокаОбъекта.Объект = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	СтрокаОбъекта.Выгружать1 = Выгружать1;
	СтрокаОбъекта.Загружать1 = Загружать1;
	СтрокаОбъекта.Выгружать2 = Выгружать2;
	СтрокаОбъекта.Загружать2 = Загружать2;
	
КонецПроцедуры

Функция ЕстьОтключенные(МетаданныеОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МИНИМУМ(рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.Выгружать), ЛОЖЬ) КАК Выгружать
		|ИЗ
		|	РегистрСведений.рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег КАК рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег
		|ГДЕ
		|	рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.Объект = &Объект
		|	И рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.Вариант В (1, 2)";
	
	Запрос.УстановитьПараметр("Объект", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеОбъекта));
	
	ВыборкаПоПризнакуВыгрузки = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаПоПризнакуВыгрузки.Следующий() Тогда
		Результат = ВыборкаПоПризнакуВыгрузки.Выгружать = Ложь
	Иначе
		Результат = Истина
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// ++ rarus makole 2021-08-13
Процедура ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	НаборЗаписейНастроек = РегистрыСведений.рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.СоздатьНаборЗаписей();
	НаборЗаписейНастроек.Отбор.КодУзла.Установить(ПараметрыЗаписи.КодУзла);
	НаборЗаписейНастроек.Отбор.Объект.Установить(ПараметрыЗаписи.Объект);
	НаборЗаписейНастроек.Отбор.Вариант.Установить(ПараметрыЗаписи.Вариант);
	
	НоваяЗапись = НаборЗаписейНастроек.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ПараметрыЗаписи);
	
	НаборЗаписейНастроек.Записать(Истина);
	
КонецПроцедуры

Функция СохраненныеНастройки(КодУзла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.Объект КАК Объект,
		|	рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.Вариант КАК Вариант,
		|	рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.Выгружать КАК Выгружать,
		|	рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.Загружать КАК Загружать
		|ИЗ
		|	РегистрСведений.рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег КАК рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег
		|ГДЕ
		|	рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.КодУзла = &КодУзла
		|	И рарусНастройкиСоставаОбъектовСинхронизацииСудноБерег.Вариант В (1, 2)";
	
	Запрос.УстановитьПараметр("КодУзла", КодУзла);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции
// --rarus makole 2021-08-13

#КонецЕсли