
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ") Тогда
		
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Отправлен"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Закрыт"));
		
		Если Параметры.Свойство("Ссылка") Тогда	
			
			Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.рарусУчение") Тогда
				
				ДанныеВыбора.Очистить();
				//rarus_AfoD 10.09.2021 < 
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
				//rarus_AfoD 10.09.2021 > 
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Проведено"));
				
			КонецЕсли;
			
			Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.рарусМероприятиеСУБ") Тогда
				
				ДанныеВыбора.Очистить();
				
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Проведено"));
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
			
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Отправлен"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Закрыт"));
		
	КонецЕсли;
	
КонецПроцедуры
