
&НаКлиенте
Процедура Настройки(Команда)
	
	ИнвертироватьПанельНастройки();
	УстановитьВидимостьПанелиНастроек();
	
КонецПроцедуры

&НаКлиенте 
Процедура ИнвертироватьПанельНастройки()
	
	ПанельНастроек = НЕ ПанельНастроек;
	Элементы.КнопкаНастройки.Пометка = ПанельНастроек;
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьВидимостьПанелиНастроек()
	
	Элементы.ГруппаНастройки.Видимость = ПанельНастроек;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПанельНастроек = ЛОЖЬ;
	УстановитьВидимостьПанелиНастроек();
	vftОбщиеПроцедурыДокументовКлиент.УстановитьУсловноеОформление(Список);	
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
	//rarus_rasuli_06.03.18 ++
	УсловноеОформлениеПоПредложениям();
	//rarus_rasuli_06.03.18 --	
КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппаСудовОчистка(Элемент, СтандартнаяОбработка)
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппаСудовПриИзменении(Элемент)
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
КонецПроцедуры

//rarus_rasuli_06.03.18 ++
&НаСервере
Процедура УсловноеОформлениеПоПредложениям()
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить(); 
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПредоложенияПоКорректуреСудовойСУБ.НомерСтроки"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено; // либо задаем свой
	ЭлементОтбора.Использование = Истина; 	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Синий);
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Статус");

	ЭлементОформления.Использование = Истина;
КонецПроцедуры
//rarus_rasuli_06.03.18 --