
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КонтролироватьВыборЗаблокированных", КонтролироватьВыборЗаблокированных);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// ++ rarus PleA 21.12.2020 [26103]
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	ПолеЭлемента.Использование = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СтатусНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.рспбСтатусыНоменклатуры.НеЗаблокирован;
	ОтборЭлемента.Использование = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СтатусНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;	
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗаблокированныйРеквизитЦвет);
	
	// -- rarus PleA
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если КонтролироватьВыборЗаблокированных И ЭтоЗаблокированнаяНоменклатура(ВыбраннаяСтрока) тогда
		
		рарусНоменклатураКлиент.ВыборЗаблокированнойНоменклатуры(ЭтаФорма, ВыбраннаяСтрока, СтандартнаяОбработка);
			
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЭтоЗаблокированнаяНоменклатура(ВыбраннаяСтрока)
	
	Возврат рарусНоменклатураСервер.ЭтоЗаблокированнаяНоменклатура(ВыбраннаяСтрока);
	
КонецФункции 

&НаКлиенте
Процедура ВыборЗаблокированнойЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> Неопределено И РезультатВопроса.Значение = "ВыбратьЗаблокированную" Тогда
		
		ОповеститьОВыбореНоменклатуры(ДополнительныеПараметры.Номенклатура);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОВыбореНоменклатуры(Номенклатура)
	
	ОповеститьОВыборе(Номенклатура);
	
КонецПроцедуры	
