
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)

	//Префикс =  Судно.КодБыстрогоВвода;
	
	Префикс = СформироватьПрефиксНомераДокумента();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	vftОбщиеПроцедурыДокументовСервер.ПриКопировании(ЭтотОбъект,ОбъектКопирования);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	// ++ rarus ilshill 19.01.2020 
	// - перенес в "обработчикПроверкиЗаолнения" 
	
	//МассивРеквизитовДляОбязательногоЗаполнения = Новый Массив;
	//
	//Если Статус <> Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
	//	
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ДатаВремя");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ОписаниеПотенциальногоИнцидента");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ПричинаВозникновения");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ВозможныеПоследствия");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ПредпринятыеДействия");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ЛицоСообщившееОбИнциденте");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ФИОЛицоСообщившееОбИнциденте");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ФИОКапитана");
	//		
	//КонецЕсли; 
	//
	//Если Статус = Перечисления.vftСтатусыДокументовСообщений.Получен 
	//	или Статус = Перечисления.vftСтатусыДокументовСообщений.Закрыт  Тогда
	//	
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ОтветКомпании");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("Ответственный");

	//КонецЕсли; 
	//
	//Отказ = НЕ ПроверитьЗаполнение();
	//vftОбщиеПроцедурыДокументовСервер.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект,МассивРеквизитовДляОбязательногоЗаполнения,Отказ);
	//
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ") Тогда		
		рарусСУБСервер.ОбработкаЗаполнениеДокументовСУБ(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ДатаВремя");
		МассивНепроверяемыхРеквизитов.Добавить("ОписаниеПотенциальногоИнцидента");
		МассивНепроверяемыхРеквизитов.Добавить("ПричинаВозникновения");
		МассивНепроверяемыхРеквизитов.Добавить("ВозможныеПоследствия");
		МассивНепроверяемыхРеквизитов.Добавить("ПредпринятыеДействия");
		МассивНепроверяемыхРеквизитов.Добавить("ЛицоСообщившееОбИнциденте");
		МассивНепроверяемыхРеквизитов.Добавить("ФИОЛицоСообщившееОбИнциденте");
		МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитана");
		МассивНепроверяемыхРеквизитов.Добавить("Примечание");
		
	КонецЕсли;
	
	Если Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик 
		Или Статус = Перечисления.vftСтатусыДокументовСообщений.Отправлен  Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ОтветКомпании");
		МассивНепроверяемыхРеквизитов.Добавить("Ответственный");
		
	КонецЕсли; 
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);	
	
КонецПроцедуры

Функция СформироватьПрефиксНомераДокумента() Экспорт
	
	Префикс = "";
	
	Префикс = Префикс + ?(Судно <> Справочники.vftСуда.ПустаяСсылка(), Судно.КодБыстрогоВвода, "      ");
	Префикс = Префикс + "-";
	Префикс = Префикс + ?(Дата = Дата("00010101000000"), "  ", Прав(Формат(Дата, "ДФ=yyyy"), 2));
	Префикс = Префикс + "-";
	
	Возврат Префикс;
	
КонецФункции

