&НаСервере
//raruskzn AydaFZ 15.11.2019{
Функция ПолучитьСписокМоделей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	впМодельРДО.Ссылка КАК Модель
		|ИЗ
		|	Справочник.впМодельРДО КАК впМодельРДО
		|ГДЕ
		|	НЕ впМодельРДО.ПометкаУдаления";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Список = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Модель");
		
	КонецЕсли;
			
	Возврат Список;
	
КонецФункции  //raruskzn AydaFZ 15.11.2019}

