&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивТД = vftОбщиеПроцедурыДокументовСервер.ПолучитьТабличныеДокументыАнализСУБ(ПараметрКоманды);
	
	Макет	= ПолучитьМакетДляПечати();
	
	vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивТД, Макет, 1);

	//vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивТД, "Документ.vftАнализСУБ.ПФ_DOC_АнализСУБ",1);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетДляПечати()
	
	Макет = ?(ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ"),
	               "Документ.vftАнализСУБ.ПФ_DOC_АнализСУБ_new", "Документ.vftАнализСУБ.ПФ_DOC_АнализСУБ");

	Возврат Макет;
	
КонецФункции