Процедура ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ) Экспорт
	
	ЗарегистрироватьВерсии(ТекущийОбъект);
	
КонецПроцедуры

Процедура ЗарегистрироватьВерсии(ТекущийОбъект)
	
	Если НеобходимоЗарегистрироватьВерсии(ТекущийОбъект) тогда 
		рарусОбщегоНазначенияСервер.ОбновитьВерсиюКонфигурацииСудна();
	КонецЕсли;

КонецПроцедуры

Функция НеобходимоЗарегистрироватьВерсии(ТекущийОбъект)
	
	НеобходимоЗарегистрироватьВерсии = Не ТекущийОбъект.ЭтотУзел И ОбменДаннымиСервер.ЭтоПодчиненныйУзелРИБ();
	
	Возврат НеобходимоЗарегистрироватьВерсии;
	
КонецФункции

// ++ rarus yukuzi 23.09.2021   //
Процедура ЗарегистрироватьПоказателиВиджетов()Экспорт
УзлыРИБ = СтандартныеПодсистемыПовтИсп.УзлыРИБ();
МассивУзлов = УзлыРИБ.ВыгрузитьЗначения();
ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов , Метаданные.Справочники.рарусПоказателиВиджетов);
ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов , Метаданные.Справочники.рарусПериодыВиджетовПоУмолчанию);
КонецПроцедуры

// -- rarus yukuzi 23.09.2021
	