#Область ПрограммныйИнтерфейс

// Заполняет служебные реквизиты в табличной части формы зависящие от локализации
//
// Параметры:
//   Форма               - УправляемаяФорма - заполняемая форма
//   ПараметрыЗаполнения - Произвольный     - сценарий и параметры заполнения
//
Процедура ЗаполнитьСлужебныеРеквизиты(Форма, ПараметрыЗаполнения = Неопределено) Экспорт
	
	//++ Локализация
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	//++ Локализация
		
КонецПроцедуры
 
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, СтруктураДействийЗаполнения) Экспорт
	
	//++ Локализация
		
КонецПроцедуры

Процедура ДополнитьПоддерживаемыеДействияЗаполненияТЧ(Действия) Экспорт
	
	//++ Локализация
		
КонецПроцедуры

Процедура ПриОпределенииШаблонаПоляВыборкиПоКлючуДействия(КлючДействия, Шаблон) Экспорт
	
	//++ Локализация
	
	Если КлючДействия = "ЗаполнитьПризнакМаркируемаяПродукция" Тогда
		Шаблон = ",
		|	ВЫБОР 
		|		КОГДА втТаблицаНоменклатуры.%Ключ%.АлкогольнаяПродукцияВоВскрытойТаре ТОГДА
		|			ЛОЖЬ
		|		КОГДА втТаблицаНоменклатуры.%Ключ%.ТабачнаяПродукция
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЕСТЬNULL(втТаблицаНоменклатуры.%Ключ%.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)
		|	КОНЕЦ КАК %Значение%";
	КонецЕсли;
	
	Если КлючДействия = "ЗаполнитьПризнакМаркируемаяПродукцияТабачная" Тогда
		Шаблон = ",
		|	втТаблицаНоменклатуры.%Ключ%.ТабачнаяПродукция КАК %Значение%";
	КонецЕсли;
	
	Если КлючДействия = "ЗаполнитьПризнакМаркируемаяПродукцияАлкогольная" Тогда
		Шаблон = ",
		|	ВЫБОР 
		|		КОГДА втТаблицаНоменклатуры.%Ключ%.АлкогольнаяПродукцияВоВскрытойТаре ТОГДА
		|			ЛОЖЬ
		|		ИНАЧЕ ЕСТЬNULL(втТаблицаНоменклатуры.%Ключ%.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)
		|	КОНЕЦ КАК %Значение%";
	КонецЕсли;
	
	Если КлючДействия = "ЗаполнитьПризнакАлкогольнаяПродукция" Тогда
		Шаблон = ",
		|	втТаблицаНоменклатуры.%Ключ%.АлкогольнаяПродукция КАК %Значение%";
	КонецЕсли;
	
	Если КлючДействия = "ЗаполнитьПризнакПодакцизныйТовар" Тогда
		Шаблон = ",
		|	втТаблицаНоменклатуры.%Ключ%.ПодакцизныйТовар КАК %Значение%";
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
