
&НаКлиенте
Процедура СписокСудовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Выбрать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СписокПрочиеСудаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Выбрать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбранноеЗначение = Неопределено;
	Если Элементы.ГруппаСудаПрочиеСуда.ТекущаяСтраница = Элементы.ГруппаСуда Тогда
		ТекСтрока = Элементы.СписокСудов.ТекущиеДанные;
		Если ТекСтрока <> Неопределено Тогда
			ВыбранноеЗначение = ТекСтрока.Ссылка;
		КонецЕсли;
	Иначе
		ТекСтрока = Элементы.СписокПрочиеСуда.ТекущиеДанные;
		Если ТекСтрока <> Неопределено Тогда
			ВыбранноеЗначение = ТекСтрока.Ссылка;
		КонецЕсли;
	КонецЕсли;
				
	ЗакрытьФорму(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(ВыбранноеЗначение)
	ЭтаФорма.Закрыть(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры

