
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ИспользоватьФункционалСУБ() Тогда
		
		ПараметрыФормы = Новый Структура("КлючНазначенияФормы", "ДокументыСУБ");
		
		ОткрытьФорму("Обработка.рарусЖурналСообщенийСУБ.Форма.ФормаОсновная", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	Иначе	
		ПараметрыКоманды = Новый Структура;
		ОткрытьФорму("ОбщаяФорма.vftЖурналДокументов",ПараметрыКоманды, 
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИспользоватьФункционалСУБ()	
	Возврат ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ")
КонецФункции
