
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.vftРейс.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	//raruskzn AydaFZ 25.11.2019 {
	Оповещение = Новый ОписаниеОповещения("ВывестиДокументНаПечать", ЭтотОбъект);
	УправлениеПечатьюКлиент.ПроверитьПроведенностьДокументов(Оповещение, ПараметрКоманды);
	//raruskzn AydaFZ 25.11.2019}

КонецПроцедуры

&НаКлиенте
Процедура ВывестиДокументНаПечать(ПараметрКоманды, Параметры)Экспорт 
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.vftРейс", "ПутевойЖурналННФ", 
													ПараметрКоманды, Параметры);

	
КонецПроцедуры
