#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

//++ rarus isaeva 10.08.2021

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - параметры учетного механизма (См. ПроведениеДокументов.ПараметрыУчетногоМеханизма()).
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	//При пометке на удаление требуется также обновление регистра
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		ИЛИ Документ.ПометкаУдаления Тогда
		Параметры.НезависимыеРегистры.Добавить(Метаданные.РегистрыСведений.рарусЖурналИзмененийНоменклатурыПоАналогам);
	КонецЕсли;
	
	Возврат Параметры;
	

КонецФункции

// Процедура формирования движений по подчиненным регистрам
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "рарусЖурналИзмененийНоменклатурыПоАналогам");
	
КонецПроцедуры

// Процедура формирования движений по независимым регистрам
//
// Параметры:
//	ТаблицыДляДвижений - Структура - таблицы данных документа
//	Документ - ДокументСсылка - ссылка на документ
//	Отказ - Булево - признак отказа от проведения документа.
//
Процедура ЗаписатьДанные(ТаблицыДляДвижений, Документ, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//УстановитьПривилегированныйРежим(Истина);
	//
	//ПериодЗаписи = ТекущаяДата();  
	//Набор = РегистрыСведений.рарусЖурналИзмененийНоменклатурыПоАналогам.СоздатьНаборЗаписей();
	//Набор.Отбор.Документ.Установить(Документ);
	//Набор.Отбор.Период.Установить(ПериодЗаписи);
	////Набор.ЗагрузитьСОбработкой(Документ, ПериодЗаписи);
	//Набор.ЗагрузитьДвижения(ТаблицыДляДвижений, "рарусЖурналИзмененийНоменклатурыПоАналогам", ПериодЗаписи, Документ);
	//Набор.Записать();
	//
	////УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

//-- rarus isaeva 10.08.2021

#КонецОбласти

#КонецЕсли
