#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Процедура ЗагрузитьДвижения(ТаблицыДляДвижений, ИмяРегистра, ПериодЗаписи, Документ) Экспорт
//	
//	ИмяТаблицыДвижений = "Таблица" + ИмяРегистра;
//	
//	Если ТаблицыДляДвижений.Свойство(ИмяТаблицыДвижений)
//		И ЗначениеЗаполнено(ТаблицыДляДвижений[ИмяТаблицыДвижений]) Тогда
//		ТЗ = ТаблицыДляДвижений[ИмяТаблицыДвижений];
//		ТЗ.Колонки.Добавить("Период");
//		ТЗ.ЗаполнитьЗначения(ПериодЗаписи, "Период");

//		Если ТипЗнч(Документ) = Тип("ДокументСсылка.впЗаявкаНаСнабжение") Тогда
//			ЗаполнитьДатуДробленияИДатуСОгласования(ТЗ, ПериодЗаписи);
//		КОнецЕсли;
//		  		
//		ЭтотОбъект.Загрузить(ТЗ);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура  ЗаполнитьДатуДробленияИДатуСОгласования(ТЗ, ПериодЗаписи)
//	ТЗ.Колонки.Добавить("ДатаДробленияСтрок");
//	ТЗ.ЗаполнитьЗначения(ПериодЗаписи, "ДатаДробленияСтрок");
//	
//	ТЗ.Колонки.Добавить("ДатаСогласования");
//	Для каждого Строка Из ТЗ Цикл
//		Если Строка.СогласованиеПрошло Тогда
//			 Строка.ДатаСогласования = ПериодЗаписи;
//		 КонецЕсли;
//	 КонецЦикла;
//	 
//	ТЗ.Колонки.Добавить("ДатаВозвратаРезультатаСогласования");
//	ТЗ.ЗаполнитьЗначения(ПериодЗаписи, "ДатаВозвратаРезультатаСогласования");

//КонецПроцедуры

#КонецОбласти

#КонецЕсли
