
#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьДоступность()

	ИспользоватьСтатусыЗаявокНаПереносРабот = рарусОбщегоНазначенияПовтИсп.ИспользоватьСтатусыЗаявокНаПереносРабот();
	Если ИспользоватьСтатусыЗаявокНаПереносРабот Тогда
	
		Элементы.Согласовано.Видимость = ЛОЖЬ;
	
	КонецЕсли; 

КонецПроцедуры

//RARUS-NN EvgenU РАIT-0023372 2021_06_28 ++
&НаКлиенте
Процедура НаКлиенте_СписокТЧ_УстановитьПараметр()
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		НаСервере_СписокТЧ_УстановитьПараметр(Неопределено);	
	Иначе
		НаСервере_СписокТЧ_УстановитьПараметр(ТекСтрока.Ссылка);	
	КонецЕсли;

КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_28 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_28 ++
&НаСервере
Процедура НаСервере_СписокТЧ_УстановитьПараметр(Ссылка)
	СписокТЧ.Параметры.УстановитьЗначениеПараметра("Ссылка", Ссылка);
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_28 --

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//RARUS-NN EvgenU РАIT-0023372 2021_06_28 ++
	НаСервере_СписокТЧ_УстановитьПараметр(Неопределено);	
	//RARUS-NN EvgenU РАIT-0023372 2021_06_28 --
		
	//rarus_AfoD 15.09.2021 < 
	УстановитьВидимостьДоступность();
	//rarus_AfoD 15.09.2021 > 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//RARUS-NN EvgenU РАIT-0023372 2021_06_28 ++
	ОтключитьОбработчикОжидания("НаКлиенте_СписокТЧ_УстановитьПараметр");
	ПодключитьОбработчикОжидания("НаКлиенте_СписокТЧ_УстановитьПараметр", 0.1, ИСТИНА);
	//RARUS-NN EvgenU РАIT-0023372 2021_06_28 --
	
КонецПроцедуры

#КонецОбласти
