#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	// ++ rarus makole 2021-09-16	
Функция ВерсияКонфигурацииУзла(Узел) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(рарусВерсииКонфигурации.НомерВерсии, """") КАК Версия
		|ИЗ
		|	РегистрСведений.ОбщиеНастройкиУзловИнформационныхБаз КАК ОбщиеНастройкиУзловИнформационныхБаз
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рарусВерсииКонфигурации КАК рарусВерсииКонфигурации
		|		ПО ОбщиеНастройкиУзловИнформационныхБаз.Префикс = рарусВерсииКонфигурации.УзелПрефикс
		|ГДЕ
		|	ОбщиеНастройкиУзловИнформационныхБаз.УзелИнформационнойБазы = &Узел";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаВерсии = РезультатЗапроса.Выбрать();
		ВыборкаВерсии.Следующий();
		Результат = ВыборкаВерсии.Версия;
	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции		
// -- rarus makole 2021-09-16

#КонецЕсли