
#Область События_формы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	vftОбщиеПроцедурыДокументовСервер.ПриСозданииНаСервере(Отказ,Объект);
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьКнопкиИзмененияСтатуса(ЭтаФорма,Элементы.ПодменюСтатус,Объект.Статус);	
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьДоступностьЭлементовФормы(ЭтаФорма);
	
	УстановитьСвойстваЭлементов();
	
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел() = Неопределено;
	
	ЭтаФорма.ТолькоПросмотр =  НЕ vftОбщиеПроцедурыДокументовСервер.ПолучитьВозможностьРедактироватьФормуПоСтатусу(Объект.Статус);

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьРеквизитов();
	
	/////rarus_rasuli_26.02.18 ++
	Год = НачалоГода(Объект.Дата);
	ФевральГод = ДобавитьМесяц(Год,1);
	МартГод = ДобавитьМесяц(Год,2);
	АпрельГод = ДобавитьМесяц(Год,3);
	МайГод = ДобавитьМесяц(Год,4);
	ИюньГод = ДобавитьМесяц(Год,5);
	ИюльГод = ДобавитьМесяц(Год,6);
	АвгустГод = ДобавитьМесяц(Год,7);
	СентябрьГод = ДобавитьМесяц(Год,8);
	ОктябрьГод = ДобавитьМесяц(Год,9);
	НоябрьГод = ДобавитьМесяц(Год,10);
	ДекабрьГод = ДобавитьМесяц(Год,11);

	
	Если КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(Год) Тогда
		Объект.МесяцОбзора = "Январь"
	ИначеЕсли КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(ФевральГод) Тогда
		   Объект.МесяцОбзора = "Февраль" 
	ИначеЕсли КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(МартГод) Тогда
		Объект.МесяцОбзора = "Март"
	ИначеЕсли  КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(АпрельГод) Тогда
		Объект.МесяцОбзора = "Апрель"
	ИначеЕсли  КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(МайГод) Тогда		
		Объект.МесяцОбзора = "Май" 
	ИначеЕсли  КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(ИюньГод) Тогда
		Объект.МесяцОбзора = "Июнь" 
	ИначеЕсли  КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(ИюльГод) Тогда
		Объект.МесяцОбзора = "Июль"
	ИначеЕсли  КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(АвгустГод) Тогда
		 Объект.МесяцОбзора = "Август"
	ИначеЕсли  КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(СентябрьГод) Тогда
		Объект.МесяцОбзора = "Сентябрь"
	ИначеЕсли КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(ОктябрьГод) Тогда
		 Объект.МесяцОбзора = "Октябрь"
	ИначеЕсли КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(НоябрьГод) Тогда
		 Объект.МесяцОбзора = "Ноябрь"
	ИначеЕсли  КонецМесяца(Объект.ПериодОбзораПо) = КонецМесяца(ДекабрьГод) Тогда
		Объект.МесяцОбзора = "Декабрь"
	КонецЕсли;
	/////rarus_rasuli_26.02.18 ++
	
КонецПроцедуры

// ++ rarus Камаев П.В. 22.12.2020 Задача № 26135
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСписокЖурналДокументов",,ПолучитьФорму("ОбщаяФорма.vftЖурналДокументов")); 
КонецПроцедуры
// -- rarus Камаев П.В. 22.12.2020
#КонецОбласти 

#Область События_Элементов_Формы
&НаКлиенте
Процедура ОтветКомпанииНаПредложениеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПредоложенияПоКорректуреСудовойСУБ.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено  Тогда
		ТекущиеДанные.ответственный = ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтветКомпанииПриИзменении(Элемент)
	
	Объект.Ответственный = ТекущийПользователь;

КонецПроцедуры

#КонецОбласти

#Область Управление_Доступностью

&НаСервере
Процедура УстановитьДоступностьРеквизитов();
	
	МассивНедоступныхДляРедатированияРеквизитов = ПолучитьЗапрещенныеРеквизиты();
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьДоступностьРеквизитов(ЭтаФорма,МассивНедоступныхДляРедатированияРеквизитов,Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапрещенныеРеквизиты()
	
	Возврат	ПолучитьСоответствиеСтатусаИЗапрещенныхРеквизитов().Получить(Объект.Статус);
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеСтатусаИЗапрещенныхРеквизитов() Экспорт
	
	Соответствие = Новый Соответствие;  

	МассивВсеРеквизиты = vftОбщиеПроцедурыДокументовСервер.ПолучитьВсеЭлементыФормыДокумента(Объект,Ложь);
	
	Если ГлавныйУзел тогда
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Черновик,МассивВсеРеквизиты);	
		
		МассивОтправлен = vftОбщиеПроцедурыДокументовСервер.СкопироватьМассивСтрок(МассивВсеРеквизиты,"#ОтветКомпании#ОтветКомпанииНаПредложение#Ответственный#");		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Отправлен	,МассивОтправлен);
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Получен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Закрыт		,МассивВсеРеквизиты);

	Иначе
		
		МассивЧерновик = Новый Массив;
		МассивЧерновик.Добавить("ОтветКомпании");	
		МассивЧерновик.Добавить("ОтветКомпанииНаПредложение");	
		МассивЧерновик.Добавить("Ответственный");
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Черновик	,МассивЧерновик);
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Отправлен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Получен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Закрыт		,МассивВсеРеквизиты);
		
	КонецЕсли;
	
	Возврат  Соответствие;
	
КонецФункции

&НаКлиенте
Процедура РазрешитьРедактированиеВсехРеквизитов(Команда)
	
РазрешитьРедактированиеВсехРеквизитовСервер();	

КонецПроцедуры

&НаСервере
Процедура РазрешитьРедактированиеВсехРеквизитовСервер()
	
vftОбщиеПроцедурыДокументовСервер.РазрешитьРедактированиеВсехРеквизитов(ЭтаФорма);	

КонецПроцедуры

// ++ rarus ilshill
&НаСервере
Процедура УстановитьСвойстваЭлементов()

	МассивЭлементов = Новый Массив();
	
	Если Не Объект.НесчастныеСлучаи Тогда
		МассивЭлементов.Добавить("ВиднесчастныхСлучаев");
	КонецЕсли;
	
	Если Объект.Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
		
		МассивЭлементов.Добавить("ФИОКапитана");
		МассивЭлементов.Добавить("МесяцОбзора");
		МассивЭлементов.Добавить("Председатель");
		МассивЭлементов.Добавить("ОфицерПоБезопасности");
		МассивЭлементов.Добавить("СПКМ");
		МассивЭлементов.Добавить("СМХ");
		МассивЭлементов.Добавить("ПредставительМоряков");
		МассивЭлементов.Добавить("ПредставительРядовогоСостава");
		МассивЭлементов.Добавить("ТехническоеСостояниеСудна");
		МассивЭлементов.Добавить("СостояниеПротивопожарногоОборудования");
	
		Для Каждого Элемент Из МассивЭлементов Цикл 
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Элемент, "АвтоОтметкаНезаполненного", Ложь);
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Кнопки_Изменения_Статуса

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИзмененияСтатуса(Команда)
	
	Объект.Статус = vftОбщиеПроцедурыДокументовКлиент.ПолучитьСтатусПоИмениКоманды(Команда.Имя);
	
	/////rarus_rasuli_26.02.18 ++
	ИзменениеДатыПриСтатусеОтправлен();
	/////rarus_rasuli_26.02.18 --

КонецПроцедуры

&НаСервере
Функция ПолучитьВозможныеСтатусы() Экспорт
	
	Возврат vftОбщиеПроцедурыДокументовСервер.ПолучитьВозможныеСтатусы();
	
КонецФункции

/////rarus_rasuli_26.02.18 ++
&НаКлиенте
Процедура МесяцОбзораПриИзменении(Элемент)

	Год = НачалоГода(Объект.Дата);
	
	ФевральГод = ДобавитьМесяц(Год,1);
	МартГод = ДобавитьМесяц(Год,2);
	АпрельГод = ДобавитьМесяц(Год,3);
	МайГод = ДобавитьМесяц(Год,4);
	ИюньГод = ДобавитьМесяц(Год,5);
	ИюльГод = ДобавитьМесяц(Год,6);
	АвгустГод = ДобавитьМесяц(Год,7);
	СентябрьГод = ДобавитьМесяц(Год,8);
	ОктябрьГод = ДобавитьМесяц(Год,9);
	НоябрьГод = ДобавитьМесяц(Год,10);
	ДекабрьГод = ДобавитьМесяц(Год,11);
	
	Если Объект.МесяцОбзора = "Январь" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(Год);
		Объект.ПериодОбзораПо = КонецМесяца(Год);
	ИначеЕсли Объект.МесяцОбзора = "Февраль" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(ФевральГод);
		Объект.ПериодОбзораПо = КонецМесяца(ФевральГод);
	ИначеЕсли Объект.МесяцОбзора = "Март" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(МартГод);
		Объект.ПериодОбзораПо = КонецМесяца(МартГод);
	ИначеЕсли Объект.МесяцОбзора = "Апрель" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(АпрельГод);
		Объект.ПериодОбзораПо = КонецМесяца(АпрельГод);
	ИначеЕсли Объект.МесяцОбзора = "Май" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(МайГод);
		Объект.ПериодОбзораПо = КонецМесяца(МайГод);
	ИначеЕсли Объект.МесяцОбзора = "Июнь" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(ИюньГод);
		Объект.ПериодОбзораПо = КонецМесяца(ИюньГод);
	ИначеЕсли Объект.МесяцОбзора = "Июль" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(ИюльГод);
		Объект.ПериодОбзораПо = КонецМесяца(ИюльГод);
	ИначеЕсли Объект.МесяцОбзора = "Август" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(АвгустГод);
		Объект.ПериодОбзораПо = КонецМесяца(АвгустГод);
	ИначеЕсли Объект.МесяцОбзора = "Сентябрь" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(СентябрьГод);
		Объект.ПериодОбзораПо = КонецМесяца(СентябрьГод);
	ИначеЕсли Объект.МесяцОбзора = "Октябрь" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(ОктябрьГод);
		Объект.ПериодОбзораПо = КонецМесяца(ОктябрьГод);
	ИначеЕсли Объект.МесяцОбзора = "Ноябрь" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(НоябрьГод);
		Объект.ПериодОбзораПо = КонецМесяца(НоябрьГод);
	ИначеЕсли Объект.МесяцОбзора = "Декабрь" Тогда
		Объект.ПериодОбзораС = НачалоМесяца(ДекабрьГод);
		Объект.ПериодОбзораПо = КонецМесяца(ДекабрьГод);
	КонецЕсли;

КонецПроцедуры
/////rarus_rasuli_26.02.18 --

 /////rarus_rasuli_26.02.18 ++
 &НаСервере
Функция ИзменениеДатыПриСтатусеОтправлен() 
	
	Если Объект.Статус = Перечисления.vftСтатусыДокументовСообщений.Отправлен Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;	
	
КонецФункции
/////rarus_rasuli_26.02.18 --
#КонецОбласти
