
// ++ rarus Камаев П.В. 29.09.2020 Задача № 24417
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//При создании лоцмана разрешить выбор только лоцманской организации только при открытии из ПЖ 
	УстановитьПараметрыВыбораОрганизацииЛоцмана();
КонецПроцедуры

&Наклиенте
Процедура УстановитьПараметрыВыбораОрганизацииЛоцмана()
	ФормаОткрытаИзПЖ = Ложь;
	
	ФормаВладелец = ЭтаФорма.ВладелецФормы;
	ГлубинаПоиска = 4;
	
	Пока ГлубинаПоиска <> 0 Цикл
		Если ФормаВладелец = Неопределено Тогда
			Прервать;
		КонецЕсли;
		Пока ТипЗнч(ФормаВладелец) <> Тип("УправляемаяФорма") Цикл
			ФормаВладелец = ФормаВладелец.Родитель;
		КонецЦикла;
		Если ФормаВладелец.ИмяФормы = "Документ.vftРейс.ФормаОбъекта"
			ИЛИ ФормаВладелец.ИмяФормы = "Документ.vftРейс.Форма.ФормаДокумента" Тогда
			ФормаОткрытаИзПЖ = Истина;
			Прервать;
		Иначе
			ФормаВладелец = ФормаВладелец.ВладелецФормы;	
		КонецЕсли;
		ГлубинаПоиска = ГлубинаПоиска - 1;
	КонецЦикла;
	
	Если ФормаОткрытаИзПЖ Тогда
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Лоцман", Истина));
		Если ФормаВладелец.ЭтоБуксир Тогда
			НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ЛоцманСЗ", Истина));
		КонецЕсли;	
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.Владелец.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
КонецПроцедуры
// -- rarus Камаев П.В. 29.09.2020
