// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СтоянкаПриИзменении(Элемент)
	УстановитьПризнакСтоянкаОтметка("Стоянка");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакСтоянкаОтметка(Реквизит)
	Если Реквизит = "Закрывать" Тогда
		Если Объект.Закрывать Тогда
			
			Объект.Стоянка = Ложь;
			
		Иначе
			Объект.Стоянка = Истина;
		КонецЕсли;	
	КонецЕсли; 
	
	Если Реквизит = "Стоянка" Тогда
		Если Объект.Стоянка Тогда
			
			Объект.Закрывать = Ложь;
			
		Иначе
			Объект.Закрывать = Истина;
		КонецЕсли;
	КонецЕсли; 
	 		
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если Не Объект.Стоянка И Не Объект.Закрывать Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо установить один из признаков";
		Сообщение.Поле = "Стоянка";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить(); 
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ЗакрыватьПриИзменении(Элемент)
	УстановитьПризнакСтоянкаОтметка("Закрывать");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) Экспорт
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды() Экспорт
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
 
