&НаСервере
Функция ПолучитьСписокШаблонов(МодельРДО) Экспорт
	
	Список = Новый ТаблицаЗначений;
	Список.Колонки.Добавить("Шаблон");
	//raruskzn AydaFZ 15.11.2019{

	//Список.Колонки.Добавить("КодШаблона");
	//Список.Колонки.Добавить("Код");
	
	//ВыборкаСправочник = Справочники.vftШаблоныРДО.Выбрать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vftШаблоныРДО.Ссылка КАК Шаблон
		|ИЗ
		|	Справочник.vftШаблоныРДО КАК vftШаблоныРДО
		|ГДЕ
		|	НЕ vftШаблоныРДО.ПометкаУдаления
		|	И (&ИгнорироватьМодельРДО
		|			ИЛИ vftШаблоныРДО.МодельРДО = &МодельРДО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодШаблона,
		|	Код";
	
	Запрос.УстановитьПараметр("ИгнорироватьМодельРДО", Не ЗначениеЗаполнено(МодельРДО));
	Запрос.УстановитьПараметр("МодельРДО", МодельРДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Список = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Шаблон");
		
	КонецЕсли;
	//Пока ВыборкаСправочник.Следующий() Цикл
	//	
	//	НовыйШаблон = Список.Добавить();
	//	
	//	НовыйШаблон.Шаблон = ВыборкаСправочник.Ссылка;
	//	НовыйШаблон.КодШаблона = ВыборкаСправочник.КодШаблона;
	//	НовыйШаблон.Код = ВыборкаСправочник.Код;
	//	
	//КонецЦикла; 
	
	//Список.Сортировать("КодШаблона,Код");
	//ВозвратСписок = Список.ВыгрузитьКолонку("Шаблон");
		
	Возврат Список;
	//raruskzn AydaFZ 15.11.2019}

КонецФункции

&НаСервере
Функция ЕстьРеквизитВШаблоне(Ссылка) Экспорт
	 		
КонецФункции

&НаСервере
Функция ЭтоУдаляемыйРеквизит(Ссылка, ИмяРеквизита, НомерСтроки) Экспорт
	СтрокаДанных = Ссылка.СтруктураФайла[НомерСтроки - 1].Структура;
	ЕстьУдаляемыеЧасти = Найти(СтрокаДанных,"\");
	Если Не ЕстьУдаляемыеЧасти Тогда
		Возврат Ложь;
	Иначе
		Пока ЕстьУдаляемыеЧасти Цикл
		//проверим, есть ли не заполненные части
		НомерПервого = 0;
		НомерПоследнего = 0;
		Для НомерСимвола = 0 По СтрДлина(СтрокаДанных)  Цикл
			Если Символ(КодСимвола(СтрокаДанных,НомерСимвола))="\" И НомерПервого = 0 Тогда
				НомерПервого = НомерСимвола;
			ИначеЕсли Символ(КодСимвола(СтрокаДанных,НомерСимвола))="\" И НомерПервого <> 0 Тогда 
				НомерПоследнего = НомерСимвола;
				Прервать;
			КонецЕсли; 	
			
			
		КонецЦикла;
		
		ПодстрокаПоиска = Сред(СтрокаДанных,НомерПервого,НомерПоследнего-НомерПервого+1);
		СимволПоказателя = Найти(ПодстрокаПоиска,"["+ИмяРеквизита);
		Если СимволПоказателя Тогда
			Возврат Истина;
		Иначе
			
			СтрокаДанных = СтрЗаменить(СтрокаДанных,ПодстрокаПоиска,"");
			ЕстьУдаляемыеЧасти = Найти(СтрокаДанных,"\");
			Продолжить;
		КонецЕсли; 
		
		
		
		ЕстьУдаляемыеЧасти = Найти(СтрокаДанных,"\");
	КонецЦикла;
КонецЕсли;

Возврат Ложь;
		
КонецФункции
 