&НаСервере
Функция ПолучитьСписокРеквизитовДляФормыДокумента() Экспорт
	ИдентификаторыПоказателейФормулы = Новый Массив;
	Для каждого Строка Из СтруктураФайла Цикл
		НовыеИдентификаторы = vftШаблоныРДО.ИдентификаторыПоказателейФормулы(Строка.Структура);
		Для каждого Ид Из НовыеИдентификаторы Цикл
			ИдентификаторыПоказателейФормулы.Добавить(Ид);	
		КонецЦикла; 	
	КонецЦикла;
	Возврат ИдентификаторыПоказателейФормулы;
КонецФункции

&НаСервере
Функция ПолучитьСписокОбязательныхРеквизитовДляФормыДокумента(Дата) Экспорт
	//raruskzn AydaFZ 18.11.2019 Задача № 17711{
	//Список = ОбязательныеРеквизиты.ВыгрузитьКолонку("Реквизит");
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vftШаблоныРДООбязательныеРеквизиты.Реквизит КАК Реквизит
		|ИЗ
		|	Справочник.vftШаблоныРДО.ОбязательныеРеквизиты КАК vftШаблоныРДООбязательныеРеквизиты
		|ГДЕ
		|	(&ЭтоНачалоМесяца
		|			ИЛИ НЕ vftШаблоныРДООбязательныеРеквизиты.ТолькоНаНачалоМесяца)
		|	И vftШаблоныРДООбязательныеРеквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ЭтоНачалоМесяца", Дата = НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Список = РезультатЗапроса.ВыгрузитьКолонку("Реквизит");
 
	Возврат Список;

	//raruskzn AydaFZ 18.11.2019}
КонецФункции

&НаСервере
Функция ЭтоОбязательныйРеквизит(ИмяРеквизита) Экспорт
	Если ОбязательныеРеквизиты.Найти(ИмяРеквизита,"Реквзиит")<>Неопределено Тогда
		Возврат Истина;
	Иначе Возврат Ложь;
	КонецЕсли; 
КонецФункции
 
