//////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСервер.ФормаНастройкиУзлаПриСозданииНаСервере(ЭтаФорма, "ОбменПолный");
	ПользовательАдминистратор = "Администратор";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтаФорма);
	
КонецПроцедуры

//////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОбменДаннымиКлиент.ФормаНастройкиУзлаКомандаЗакрытьФорму(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

//////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьВидимость()
	
	//Элементы.СтраницаОрганизации.Видимость   = ИспользоватьОтборПоОрганизациям;
	//Элементы.СтраницаСклады.Видимость        = ИспользоватьОтборПоСкладам;
	//Элементы.СтраницаПодразделения.Видимость = ИспользоватьОтборПоПодразделениям;
	Элементы.СтраницаСуда.Видимость = ИспользоватьОтборПоСудам;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоСудамПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
