#Область ПрограммныйИнтерфейс

Процедура ПередОбработкой(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, ПРО) Экспорт
	
	Если ИмяПланаОбмена = "впОбменТОиР20СМ31" тогда
		
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.рарусАктВыполненныхРаботОказанныхУслугПрисоединенныеФайлы")
			ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.рарусАктВыполненныхРаботОказанныхУслугПрисоединенныеФайлы") тогда
			
			ПередОбработкой_впОбменТОиР20СМ31_рарусАктВыполненныхРаботОказанныхУслугПрисоединенныеФайлы(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, ПРО);
			
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.рарусАктВыполненныхРаботОказанныхУслуг")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.рарусАктВыполненныхРаботОказанныхУслуг") тогда
			
			ПередОбработкой_впОбменТОиР20СМ31_рарусАктВыполненныхРаботОказанныхУслуг(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, ПРО);	
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПослеОбработки(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, Получатели) Экспорт
	
	Если ИмяПланаОбмена = "впОбменТОиР20СМ31" тогда
		
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.рарусАктВыполненныхРаботОказанныхУслуг")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.рарусАктВыполненныхРаботОказанныхУслуг") тогда
			
			ПослеОбработки_впОбменТОиР20СМ31_рарусАктВыполненныхРаботОказанныхУслуг(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, Получатели);										
						
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

Процедура ПередОбработкой_впОбменТОиР20СМ31_рарусАктВыполненныхРаботОказанныхУслугПрисоединенныеФайлы(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, ПРО)
	
	Если ЗначениеЗаполнено(Объект.ВладелецФайла) тогда
		
		Документы.рарусАктВыполненныхРаботОказанныхУслуг.ПередОбработкой(ИмяПланаОбмена, Отказ, Объект.ВладелецФайла, Объектметаданных, Выгрузка, ПРО);
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПередОбработкой_впОбменТОиР20СМ31_рарусАктВыполненныхРаботОказанныхУслуг(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, ПРО)
	
	
	
КонецПроцедуры

Процедура ПослеОбработки_впОбменТОиР20СМ31_рарусАктВыполненныхРаботОказанныхУслуг(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, Получатели)

	ВыборкаФайлы = Справочники.рарусАктВыполненныхРаботОказанныхУслугПрисоединенныеФайлы.Выбрать(,,Новый Структура("ВладелецФайла", Объект.Ссылка));	
	
	Пока ВыборкаФайлы.Следующий() цикл
		
		впОбменТОиР20СМ31Обмен.ЗарегистрироватьИзмененияДанных(Получатели, ВыборкаФайлы.Ссылка);
		
	КонецЦикла;	

КонецПроцедуры