
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = Новый Структура("СтатусСогласования", СтатусСогласованияНаСогласованииКапитаном());
	
	БыстрыеОтборы = Новый Структура("СтатусСогласования", Новый Структура("Видимость", Ложь));
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("Заголовок", "Заявки на рассмотрении капитаном");
	ПараметрыФормы.Вставить("БыстрыеОтборы", БыстрыеОтборы);
	
	КлючУникальности = ПараметрыВыполненияКоманды.НавигационнаяСсылка;
	ОткрытьФорму("Документ.впЗаявкаНаСнабжение.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, КлючУникальности, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция СтатусСогласованияНаСогласованииКапитаном()
	
	Возврат рарусЗаявкаНаСнабжениеСервер.СтатусСогласованияНаСогласованииКапитаном();	
	
КонецФункции