&НаСервере
Функция ПолучитьНормыСледования(ТекущийПункт, ПредыдущийПункт, ПроектСудна, ГрузБалласт, ОсновноеСудно) Экспорт
	
	//raruskzn AydaFZ 15.11.2019{
	//Добавил параметр ОсновноеСудно 
	//raruskzn AydaFZ 15.11.2019 }
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПункт",ТекущийПункт);
	Запрос.УстановитьПараметр("ПредыдущийПункт",ПредыдущийПункт);
	Запрос.УстановитьПараметр("ПроектСудна",ПроектСудна);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	//raruskzn AydaFZ 15.11.2019{
	Запрос.УстановитьПараметр("ОсновноеСудно", ОсновноеСудно);

	Запрос.Текст = "ВЫБРАТЬ
	               |	vftНормыСледованияСрезПоследних.Время КАК Время,
	               |	vftНормыСледованияСрезПоследних.ВремяВБалласте КАК ВремяВБалласте,
	               |	vftНормыСледованияСрезПоследних.Расстояние КАК Расстояние
	               |ИЗ
	               |	РегистрСведений.vftНормыСледования.СрезПоследних(
	               |			&Дата,
	               |			Проект = &ПроектСудна
	               |				И Пункт1 = &ПредыдущийПункт
	               |				И Пункт2 = &ТекущийПункт
	               |				И Судно = &ОсновноеСудно) КАК vftНормыСледованияСрезПоследних";
	//raruskzn AydaFZ 15.11.2019}
	Результат = Запрос.Выполнить().Выгрузить();
	СтруктураВозврата = Новый Структура;
	Если ГрузБалласт Тогда
		СтруктураВозврата.Вставить("Время", ?(Результат.Количество()=0,0,Результат[0].Время*60));
	Иначе
		СтруктураВозврата.Вставить("Время", ?(Результат.Количество()=0,0,Результат[0].ВремяВБалласте*60));
	КонецЕсли; 
	
	СтруктураВозврата.Вставить("Расстояние", ?(Результат.Количество()=0,0,Результат[0].Расстояние));
	
	Возврат СтруктураВозврата;
КонецФункции
 