
Процедура ВыборЗаблокированнойНоменклатуры(Форма = Неопределено, ВыбраннаяСтрока, СтандартнаяОбработка) Экспорт	
	
	СтандартнаяОбработка = Ложь;
	// ++ rarus makole 2021-10-05 [РАIT-0023495]
	// Доработка отдельных механизмов по учёту и списанию ТМЦ на судах 
	РазрешенаЗаблокированная = РазрешенаЗаблокированнаяНоменклатура(Форма, ВыбраннаяСтрока);
	// -- rarus makole 2021-10-05 [РАIT-0023495]
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Номенклатура", ВыбраннаяСтрока);
	ДополнительныеПараметры.Вставить("ПредлагатьБольшеНеЗадаватьЭтотВопрос", Ложь);
	ДополнительныеПараметры.Вставить("Заголовок", "Внимание");
	
	Если Форма <> Неопределено тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗаблокированнойЗавершение", Форма, ДополнительныеПараметры);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗаблокированнойЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;	
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		ОписаниеОповещения,  
		"ВНИМАНИЕ: Данная номенклатура заблокирована, и не может быть выбрана. Пожалуйста, выберите незаблокированную.",
		// ++ rarus makole 2021-10-05
		//КонопкиВопросаБлокировки(),
		КонопкиВопросаБлокировки(РазрешенаЗаблокированная),
		// -- rarus makole 2021-10-05
		ДополнительныеПараметры
		);

КонецПроцедуры
	
Процедура ВыборЗаблокированнойЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> Неопределено И РезультатВопроса.Значение = "ВыбратьЗаблокированную" Тогда
		
		
	КонецЕсли; 
	
КонецПроцедуры

// ++ rarus makole 2021-10-05
//Функция КонопкиВопросаБлокировки()
Функция КонопкиВопросаБлокировки(РазрешенаЗаблокированная = Ложь)
// -- rarus makole 2021-10-05	
	
	КнопкиСписок = Новый СписокЗначений;
	//КнопкиСписок.Добавить("ВыбратьЗаблокированную", "Выбрать заблокированную номенклатуру");
	// ++ rarus makole 2021-10-05
	Если РазрешенаЗаблокированная Тогда
		КнопкиСписок.Добавить("ВыбратьЗаблокированную", "Выбрать заблокированную номенклатуру");
	КонецЕсли;
	// -- rarus makole 2021-10-05
	КнопкиСписок.Добавить("Отмена", "Отмена");
	
	Возврат КнопкиСписок;
	
КонецФункции
	
// ++ rarus yukuzi 30.07.2021   //
Процедура ВыборНоменклатурыБезMDG(Форма = Неопределено, ВыбраннаяСтрока, СтандартнаяОбработка) Экспорт	
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Номенклатура", ВыбраннаяСтрока);
	ДополнительныеПараметры.Вставить("ПредлагатьБольшеНеЗадаватьЭтотВопрос", Ложь);
	ДополнительныеПараметры.Вставить("Заголовок", "Внимание");
	
	Если Форма <> Неопределено тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборБезMDGЗавершение", Форма, ДополнительныеПараметры);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборБезMDGЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;	
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		ОписаниеОповещения,  
		"ВНИМАНИЕ: Данная номенклатура не может быть выбрана, поскольку код MDG не заполнен. Пожалуйста, выберите другую номенклатуру.",
		КонопкиВопросаБлокировки(),
		ДополнительныеПараметры
		);

КонецПроцедуры
	
Процедура ВыборБезMDGЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> Неопределено И РезультатВопроса.Значение = "ВыбратьЗаблокированную" Тогда
		
		
	КонецЕсли; 
	
КонецПроцедуры

// -- rarus yukuzi 30.07.2021

// ++ rarus makole 2021-10-05
Функция ОбъектыСРазрешениемПодбораЗаблокированнойНоменклатуры()
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить("Обработка.рарусОформлениеРасходаТМЦ");
	МассивОбъектов.Добавить("Документ.рарусРасходТМЦ");
	МассивОбъектов.Добавить("Документ.впАктОВыполненииЭтапаРабот");
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция РазрешенаЗаблокированнаяНоменклатура(Форма, Номенклатура)
	
	Если Форма = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтатусНоменклатуры = рарусОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура, "СтатусНоменклатуры");
	
	Если СтатусНоменклатуры <> ПредопределенноеЗначение("Перечисление.рспбСтатусыНоменклатуры.БлокирДляЗаготов") Тогда
		Возврат Ложь;
	КонецЕсли;
		
	ОбъектыСРазрешением = ОбъектыСРазрешениемПодбораЗаблокированнойНоменклатуры();
	
	Для каждого Объект Из ОбъектыСРазрешением Цикл
		
		Если СтрНачинаетсяС(Форма.ВладелецФормы.ИмяФормы, Объект) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
// -- rarus makole 2021-10-05