#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
		
	УстановитьУсловноеОформление();
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	УстановитьНастройкиЭлементовФормы(ЭтотОбъект);
	
	Если Параметры.ДополнительныеПараметры.Свойство("ВладецДокумент") Тогда	 
		ДокументВладелец = Истина;
	КонецЕсли;
	  
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если ИмяСобытия = "РедактированиеВидовДокументаОсвидетельствования" Тогда		
		УстановитьНастройкиЭлементовФормы(ЭтотОбъект);	
	КонецЕсли;
	
КонецПроцедуры
		
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СлужебныйПризнак = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)	
	
	Закрыть(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
	ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
	ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура ЗаписатьНаКлиенте(Результат, ПараметрыЗаписи) Экспорт
	
	Записать();
	Закрыть(Объект.Ссылка);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ИмяКоманды", "КомандаЗаписать");
	ЗаписатьНаКлиенте(Неопределено, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ИмяКоманды", "КомандаЗаписатьИЗакрыть");
	ЗаписатьНаКлиенте(Неопределено, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ПриИзмененииРеквизитов

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	УстановитьНастройкиЭлементовФормы(ЭтаФорма);
	
	ЗначениеРеквизитовОбъекта = ПолучитьЗначениеРеквизитовОбъекта(Объект.ВидДокумента);
		
	Если ЗначениеРеквизитовОбъекта.ВладелецДокумента = ПредопределенноеЗначение("Перечисление.рарусВидыВладельцевДокументов.Судно") Тогда
		ДопустимыйТип = Новый ОписаниеТипов("СправочникСсылка.vftСуда");  
	ИначеЕсли ЗначениеРеквизитовОбъекта.ВладелецДокумента = ПредопределенноеЗначение("Перечисление.рарусВидыВладельцевДокументов.Компания") Тогда
		ДопустимыйТип = Новый ОписаниеТипов("СправочникСсылка.Организации");  
	КонецЕсли;
	
	Объект.Владелец = ДопустимыйТип.ПривестиЗначение(Объект.Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНастройкиЭлементовФормы(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ЗначенияРеквизитовОбъекта =  ПолучитьЗначениеРеквизитовОбъекта(Объект.ВидДокумента);
	
	ИмеетСрокДействия = ЗначенияРеквизитовОбъекта.ИмеетСрокДействия;
	
	ТребуетсяУказаниеОборудования =  ЗначенияРеквизитовОбъекта.ТребуетсяУказаниеОборудования;	
	
	Если Не ЗначениеЗаполнено(ТребуетсяУказаниеОборудования) Тогда	
		ТребуетсяУказаниеОборудования = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмеетСрокДействия) Тогда
		ИмеетСрокДействия = Ложь;
	КонецЕсли; 
	
	Форма.Бессрочно = Не ИмеетСрокДействия;
	
	Элементы.СрокДействия.ТолькоПросмотр = Не ИмеетСрокДействия;
	Элементы.ПодтвердитьДо.ТолькоПросмотр = Не ИмеетСрокДействия;	
	Элементы.Оборудование.Видимость = 	ТребуетсяУказаниеОборудования;
	Элементы.СрокДействия.АвтоОтметкаНезаполненного = ИмеетСрокДействия; 
	Элементы.ПодтвердитьДо.АвтоОтметкаНезаполненного = ИмеетСрокДействия;
	
	Если Не ИмеетСрокДействия Тогда	
		Объект.СрокДействия = Дата(1,1,1);	
		Объект.ПодтвердитьДо = Дата(1,1,1);		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияРеквизитовОбъекта.ТребуетсяУказаниеОборудования) Тогда
		Объект.Оборудование = ПредопределенноеЗначение("Справочник.впОбъектыРемонта.ПустаяСсылка");	
	КонецЕсли;
	
	Элементы.Владелец.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.ВидДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитовОбъекта(ВидДокумента)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидДокумента, "ТребуетсяУказаниеОборудования, ИмеетСрокДействия, ВладелецДокумента");
КонецФункции

#КонецОбласти















