Функция ВедетсяУчетКартНавигацииКакУслуги() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("рарусУчетКартНавигацииКакУслуги");
КонецФункции

Функция ИспользуетсяКачествоТоваров() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьКачествоТоваров");
КонецФункции

// ++ rarus makole 2021-08-05 [РАIT-0023494]
// Контроль остатков ТМЦ
Функция КонтролироватьОстаткиТМЦДляДокумента(Объект) Экспорт
	Возврат рарусИмущественныйУчетСервер.КонтролироватьОстаткиТМЦДляДокумента(Объект)
КонецФункции
// -- rarus makole 2021-08-05 [РАIT-0023494]