//raruskzn AydaFZ 04.12.2019 {
&НаСервере
Функция ПолучитьНастройкиВебСервиса(ВнешнийИсточник, Судно = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vftВнешниеДанные.ВнешнийИсточник КАК ВнешнийИсточник,
		|	vftВнешниеДанные.Судно КАК Судно,
		|	vftВнешниеДанные.WSURLВебСервиса КАК WSURLВебСервиса,
		|	vftВнешниеДанные.WSURLПространстваИменСервиса КАК WSURLПространстваИменСервиса,
		|	vftВнешниеДанные.WSИмяПользователя КАК WSИмяПользователя,
		|	vftВнешниеДанные.WSИмяСервиса КАК WSИмяСервиса,
		|	vftВнешниеДанные.WSПароль КАК WSПароль,
		|	vftВнешниеДанные.HTTPСервис КАК HTTPСервис
		|ИЗ
		|	РегистрСведений.vftВнешниеДанные КАК vftВнешниеДанные
		|ГДЕ
		|	vftВнешниеДанные.ВнешнийИсточник = &ВнешнийИсточник
		|	И (&ИгнорироватьСудно
		|			ИЛИ vftВнешниеДанные.Судно = &Судно)
		|	И vftВнешниеДанные.HTTPСервис";
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ВнешнийИсточник);
	Запрос.УстановитьПараметр("Судно", Судно);
	Запрос.УстановитьПараметр("ИгнорироватьСудно", Не ЗначениеЗаполнено(Судно));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка, Неопределено)
	
КонецФункции //raruskzn AydaFZ 04.12.2019}