
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// ++ rarus selmik 04.10.2021 РАIT-0023502
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		НаСервере_СписокТЧ_УстановитьПараметр(Неопределено);	
	Иначе
		НаСервере_СписокТЧ_УстановитьПараметр(ТекСтрока.Ссылка);	
	КонецЕсли;
	// -- rarus selmik 04.10.2021 РАIT-0023502
КонецПроцедуры

// ++ rarus selmik 04.10.2021 РАIT-0023502
&НаСервере
Процедура НаСервере_СписокТЧ_УстановитьПараметр(Ссылка)
	СписокТЧ.Параметры.УстановитьЗначениеПараметра("Ссылка", Ссылка);
КонецПроцедуры // -- rarus selmik 04.10.2021 РАIT-0023502

