
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	//СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	//
	//Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
	//	ТекИерархия = СтрокаПараметр.Значение;
	//Иначе
	//	ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	//		"НастройкиТОиР",
	//		"ОсновнаяСтруктураИерархии",
	//		Справочники.торо_СтруктурыОР.ПустаяСсылка());
	//		
	//	Если СтрокаПараметр <> Неопределено Тогда
	//		СтрокаПараметр.Значение = ТекИерархия;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания");
	//
	//Если ТекИерархия.СтроитсяАвтоматически Тогда
	//			
	//	СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
	//	ПолучитьСодержательнуюЧастьЗапроса()+
	//	"ВЫБРАТЬ
	//	|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
	//	|	ВТ_Данные.ВидРемонта КАК ВидРемонта,
	//	|	ВТ_Данные.ДатаНачала КАК ДатаНачала,
	//	|	ВТ_Данные.ДатаОкончания КАК ДатаОкончания,
	//	|	ВТ_Данные.Операция КАК Операция,
	//	|	ВТ_Данные.ID_Операции КАК ID_Операции,
	//	|	ВТ_Данные.ПроцентПлан КАК ПроцентПлан,
	//	|	ВТ_Данные.ПроцентФакт КАК ПроцентФакт,
	//	|	ВТ_Данные.Регистратор КАК Регистратор,
	//	|	ВТ_Данные.РегистраторПлан КАК РегистраторПлан,
	//	|	ВТ_Данные.РегистраторФакт КАК РегистраторФакт,
	//	|	ВТ_Данные.ОбъектРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
	//	|{ВЫБРАТЬ
	//	|	ОбъектРемонта.*,
	//	|	ВидРемонта.*,
	//	|	ДатаНачала,
	//	|	ДатаОкончания,
	//	|	Операция.*,
	//	|	ID_Операции,
	//	|	ПроцентПлан,
	//	|	ПроцентФакт,
	//	|	Регистратор,
	//	|	РегистраторПлан,
	//	|	РегистраторФакт,
	//	|	ОбъектИерархии}
	//	|ИЗ
	//	|	ВТ_Данные КАК ВТ_Данные";
	//	
	//	торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
	//	
	//Иначе

	//	торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

	//	СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
	//	ПолучитьСодержательнуюЧастьЗапроса()+
	//	"ВЫБРАТЬ
	//	|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
	//	|	ВТ_Данные.ВидРемонта КАК ВидРемонта,
	//	|	ВТ_Данные.ДатаНачала КАК ДатаНачала,
	//	|	ВТ_Данные.ДатаОкончания КАК ДатаОкончания,
	//	|	ВТ_Данные.Операция КАК Операция,
	//	|	ВТ_Данные.ID_Операции КАК ID_Операции,
	//	|	ВТ_Данные.ПроцентПлан КАК ПроцентПлан,
	//	|	ВТ_Данные.ПроцентФакт КАК ПроцентФакт,
	//	|	ВТ_Данные.Регистратор КАК Регистратор,
	//	|	ВТ_Данные.РегистраторПлан КАК РегистраторПлан,
	//	|	ВТ_Данные.РегистраторФакт КАК РегистраторФакт,		
	//	|	ВТ_Данные.ОбъектРемонта КАК ОбъектИерархии
	//	|{ВЫБРАТЬ
	//	|	ОбъектРемонта.*,
	//	|	ВидРемонта.*,
	//	|	ДатаНачала,
	//	|	ДатаОкончания,
	//	|	Операция.*,
	//	|	ID_Операции,
	//	|	ПроцентПлан,
	//	|	ПроцентФакт,
	//	|	Регистратор,
	//	|	РегистраторПлан,
	//	|	РегистраторФакт,
	//	|	ОбъектИерархии}
	//	|ИЗ
	//	|	ВТ_Данные КАК ВТ_Данные";
	//	
	//КонецЕсли;
	//
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	//ЗапросТекст =
	//"ВЫБРАТЬ
	//|	торо_ПроцентВыполненныхРабот.Регистратор КАК Регистратор,
	//|	торо_ПроцентВыполненныхРабот.IDРемонта КАК IDРемонта,
	//|	торо_ПроцентВыполненныхРабот.IDОперации КАК IDОперации,
	//|	торо_ПроцентВыполненныхРабот.ВидДокумента КАК ВидДокумента,
	//|	торо_ПроцентВыполненныхРабот.Операция КАК Операция,
	//|	торо_ПроцентВыполненныхРабот.IDРодителя КАК IDРодителя,
	//|	торо_ПроцентВыполненныхРабот.Процент КАК Процент
	//|ПОМЕСТИТЬ ВТ_План
	//|ИЗ
	//|	РегистрНакопления.торо_ПроцентВыполненныхРабот КАК торо_ПроцентВыполненныхРабот
	//|ГДЕ
	//|	торо_ПроцентВыполненныхРабот.ВидДокумента В(&СписокПлана)
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	IDРемонта,
	//|	IDОперации,
	//|	IDРодителя
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	торо_ПроцентВыполненныхРабот.Регистратор КАК Регистратор,
	//|	торо_ПроцентВыполненныхРабот.IDРемонта КАК IDРемонта,
	//|	торо_ПроцентВыполненныхРабот.IDОперации КАК IDОперации,
	//|	торо_ПроцентВыполненныхРабот.ВидДокумента КАК ВидДокумента,
	//|	торо_ПроцентВыполненныхРабот.IDРодителя КАК IDРодителя,
	//|	торо_ПроцентВыполненныхРабот.Операция КАК Операция,
	//|	-торо_ПроцентВыполненныхРабот.Процент КАК Процент
	//|ПОМЕСТИТЬ ВТ_Факт
	//|ИЗ
	//|	РегистрНакопления.торо_ПроцентВыполненныхРабот КАК торо_ПроцентВыполненныхРабот
	//|ГДЕ
	//|	торо_ПроцентВыполненныхРабот.ВидДокумента В(&СписокФакта)
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	IDРемонта,
	//|	IDОперации,
	//|	IDРодителя
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(ВТ_План.IDРемонта, ВТ_Факт.IDРемонта) КАК IDРемонта,
	//|	ЕСТЬNULL(ВТ_План.IDОперации, ВТ_Факт.IDОперации) КАК IDОперации,
	//|	ЕСТЬNULL(ВТ_План.Операция, ВТ_Факт.Операция) КАК Операция,
	//|	ЕСТЬNULL(ВТ_План.IDРодителя, ВТ_Факт.IDРодителя) КАК IDРодителя,
	//|	ЕСТЬNULL(ВТ_План.Регистратор, 0) КАК РегистраторПлан,
	//|	ЕСТЬNULL(ВТ_Факт.Регистратор, 0) КАК РегистраторФакт,
	//|	ЕСТЬNULL(ВТ_План.Процент, 0) КАК ПроцентПлан,
	//|	ЕСТЬNULL(ВТ_Факт.Процент, 0) КАК ПроцентФакт
	//|ПОМЕСТИТЬ ВТ_ПланФакт
	//|ИЗ
	//|	ВТ_План КАК ВТ_План
	//|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
	//|		ПО ВТ_План.IDРемонта = ВТ_Факт.IDРемонта
	//|			И (ВТ_Факт.IDОперации = ВТ_План.IDОперации)
	//|			И ВТ_План.IDРодителя = ВТ_Факт.IDРодителя
	//|ГДЕ
	//|	ТИПЗНАЧЕНИЯ(ВТ_Факт.Регистратор) <> ТИП(Документ.торо_ЗакрытиеЗаявокИРемонтов)
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	IDРемонта
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	//|	торо_Ремонты.ВидРемонта КАК ВидРемонта,
	//|	торо_Ремонты.ДатаНачалаФакт КАК ДатаНачалаФакт,
	//|	торо_Ремонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	//|	торо_Ремонты.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	//|	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	//|	торо_Ремонты.ID КАК ID_Ремонта,
	//|	ВТ_ПланФакт.Операция КАК Операция,
	//|	ВТ_ПланФакт.IDОперации КАК ID_Операции,
	//|	ВТ_ПланФакт.ПроцентПлан КАК ПроцентПлан,
	//|	ВТ_ПланФакт.ПроцентФакт КАК ПроцентФакт,
	//|	торо_Ремонты.ОбъектРемонта КАК ОбъектИерархии,
	//|	торо_Ремонты.Регистратор КАК Регистратор,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)
	//|			ТОГДА 1
	//|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	//|			ТОГДА 2
	//|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ПланГрафикРемонта)
	//|				И торо_Ремонты.Регистратор.ДокументОснование = ЗНАЧЕНИЕ(Документ.торо_ПланГрафикРемонта.ПустаяСсылка)
	//|			ТОГДА 3
	//|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ПланГрафикРемонта)
	//|			ТОГДА 6
	//|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	//|				И торо_Ремонты.Регистратор.ДокументОснование = ЗНАЧЕНИЕ(Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПустаяСсылка)
	//|			ТОГДА 4
	//|		КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	//|			ТОГДА 6
	//|		ИНАЧЕ 5
	//|	КОНЕЦ КАК ТипДокумента,
	//|	ВТ_ПланФакт.РегистраторПлан КАК РегистраторПлан,
	//|	ВТ_ПланФакт.РегистраторФакт КАК РегистраторФакт
	//|ПОМЕСТИТЬ ВТ_ДанныеСРегистратором
	//|ИЗ
	//|	ВТ_ПланФакт КАК ВТ_ПланФакт
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	//|		ПО ВТ_ПланФакт.IDРемонта = торо_Ремонты.ID
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ДанныеСРегистратором.ОбъектРемонта КАК ОбъектРемонта,
	//|	ВТ_ДанныеСРегистратором.ВидРемонта КАК ВидРемонта,
	//|	МИНИМУМ(ВЫБОР
	//|			КОГДА ВТ_ДанныеСРегистратором.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ТОГДА ВТ_ДанныеСРегистратором.ДатаНачалаПлан
	//|			ИНАЧЕ ВТ_ДанныеСРегистратором.ДатаНачалаФакт
	//|		КОНЕЦ) КАК ДатаНачала,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА ВТ_ДанныеСРегистратором.ДатаОкончанияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ТОГДА ВТ_ДанныеСРегистратором.ДатаОкончанияПлан
	//|			ИНАЧЕ ВТ_ДанныеСРегистратором.ДатаОкончанияФакт
	//|		КОНЕЦ) КАК ДатаОкончания,
	//|	ВТ_ДанныеСРегистратором.ID_Ремонта КАК ID_Ремонта,
	//|	ВТ_ДанныеСРегистратором.Операция КАК Операция,
	//|	ВТ_ДанныеСРегистратором.ID_Операции КАК ID_Операции,
	//|	ВТ_ДанныеСРегистратором.ПроцентПлан КАК ПроцентПлан,
	//|	ВТ_ДанныеСРегистратором.ПроцентФакт КАК ПроцентФакт,
	//|	ВТ_ДанныеСРегистратором.ОбъектИерархии КАК ОбъектИерархии,
	//|	ВТ_ДанныеСРегистратором.РегистраторПлан КАК РегистраторПлан,
	//|	ВТ_ДанныеСРегистратором.РегистраторФакт КАК РегистраторФакт
	//|ПОМЕСТИТЬ ВТ_ДанныеСырые
	//|ИЗ
	//|	ВТ_ДанныеСРегистратором КАК ВТ_ДанныеСРегистратором
	//|ГДЕ
	//|	ТИПЗНАЧЕНИЯ(ВТ_ДанныеСРегистратором.Регистратор) <> ТИП(Документ.торо_ВыявленныеДефекты)
	//|	И ТИПЗНАЧЕНИЯ(ВТ_ДанныеСРегистратором.Регистратор) <> ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ДанныеСРегистратором.ОбъектРемонта,
	//|	ВТ_ДанныеСРегистратором.ВидРемонта,
	//|	ВТ_ДанныеСРегистратором.ID_Ремонта,
	//|	ВТ_ДанныеСРегистратором.Операция,
	//|	ВТ_ДанныеСРегистратором.ID_Операции,
	//|	ВТ_ДанныеСРегистратором.ПроцентПлан,
	//|	ВТ_ДанныеСРегистратором.ПроцентФакт,
	//|	ВТ_ДанныеСРегистратором.ОбъектИерархии,
	//|	ВТ_ДанныеСРегистратором.РегистраторПлан,
	//|	ВТ_ДанныеСРегистратором.РегистраторФакт
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ОбъектРемонта,
	//|	ВидРемонта,
	//|	ID_Ремонта
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_ДанныеСРегистратором.ОбъектРемонта КАК ОбъектРемонта,
	//|	ВТ_ДанныеСРегистратором.ID_Ремонта КАК ID_Ремонта,
	//|	ВТ_ДанныеСРегистратором.ОбъектИерархии КАК ОбъектИерархии,
	//|	МИНИМУМ(ВТ_ДанныеСРегистратором.ТипДокумента) КАК ТипДокумента
	//|ПОМЕСТИТЬ ВТ_ДанныеДокОснование
	//|ИЗ
	//|	ВТ_ДанныеСРегистратором КАК ВТ_ДанныеСРегистратором
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ДанныеСРегистратором.ОбъектРемонта,
	//|	ВТ_ДанныеСРегистратором.ID_Ремонта,
	//|	ВТ_ДанныеСРегистратором.ОбъектИерархии
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ОбъектРемонта,
	//|	ID_Ремонта
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_ДанныеДокОснование.ОбъектРемонта КАК ОбъектРемонта,
	//|	ВТ_ДанныеДокОснование.ID_Ремонта КАК ID_Ремонта,
	//|	ВТ_ДанныеДокОснование.ОбъектИерархии КАК ОбъектИерархии,
	//|	ВТ_ДанныеДокОснование.ТипДокумента КАК ТипДокумента,
	//|	ВТ_ДанныеСРегистратором.Регистратор КАК Регистратор
	//|ПОМЕСТИТЬ ВТ_ДанныеОснование
	//|ИЗ
	//|	ВТ_ДанныеДокОснование КАК ВТ_ДанныеДокОснование
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСРегистратором КАК ВТ_ДанныеСРегистратором
	//|		ПО ВТ_ДанныеДокОснование.ОбъектРемонта = ВТ_ДанныеСРегистратором.ОбъектРемонта
	//|			И ВТ_ДанныеДокОснование.ID_Ремонта = ВТ_ДанныеСРегистратором.ID_Ремонта
	//|			И ВТ_ДанныеДокОснование.ТипДокумента = ВТ_ДанныеСРегистратором.ТипДокумента
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ДанныеСырые.ОбъектРемонта КАК ОбъектРемонта,
	//|	ВТ_ДанныеСырые.ВидРемонта КАК ВидРемонта,
	//|	ВТ_ДанныеСырые.ДатаНачала КАК ДатаНачала,
	//|	ВТ_ДанныеСырые.ДатаОкончания КАК ДатаОкончания,
	//|	ВТ_ДанныеСырые.ID_Ремонта КАК ID_Ремонта,
	//|	ВТ_ДанныеСырые.Операция КАК Операция,
	//|	ВТ_ДанныеСырые.ID_Операции КАК ID_Операции,
	//|	СУММА(ВТ_ДанныеСырые.ПроцентПлан) КАК ПроцентПлан,
	//|	СУММА(ВТ_ДанныеСырые.ПроцентФакт) КАК ПроцентФакт,
	//|	ВТ_ДанныеОснование.Регистратор КАК Регистратор,
	//|	ВТ_ДанныеСырые.РегистраторПлан КАК РегистраторПлан,
	//|	ВТ_ДанныеСырые.РегистраторФакт КАК РегистраторФакт
	//|ПОМЕСТИТЬ ВТ_Данные1
	//|ИЗ
	//|	ВТ_ДанныеСырые КАК ВТ_ДанныеСырые
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеОснование КАК ВТ_ДанныеОснование
	//|		ПО (ВТ_ДанныеОснование.ОбъектРемонта = ВТ_ДанныеСырые.ОбъектРемонта)
	//|			И (ВТ_ДанныеОснование.ID_Ремонта = ВТ_ДанныеСырые.ID_Ремонта)
	//|ГДЕ
	//|	(ВЫБОР
	//|				КОГДА &ОтборПоВД
	//|					ТОГДА ВТ_ДанныеОснование.ТипДокумента = 1
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ
	//|			ИЛИ ВЫБОР
	//|				КОГДА &ОтборПоВО
	//|					ТОГДА ВТ_ДанныеОснование.ТипДокумента = 2
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ
	//|			ИЛИ ВЫБОР
	//|				КОГДА &ОтборПоППР
	//|					ТОГДА ВТ_ДанныеОснование.ТипДокумента = 3
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ
	//|			ИЛИ ВЫБОР
	//|				КОГДА &ОтборПоРМ
	//|					ТОГДА ВТ_ДанныеОснование.ТипДокумента = 4
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ДанныеСырые.ДатаОкончания,
	//|	ВТ_ДанныеСырые.Операция,
	//|	ВТ_ДанныеСырые.ID_Ремонта,
	//|	ВТ_ДанныеСырые.ID_Операции,
	//|	ВТ_ДанныеСырые.ДатаНачала,
	//|	ВТ_ДанныеСырые.ВидРемонта,
	//|	ВТ_ДанныеСырые.ОбъектРемонта,
	//|	ВТ_ДанныеОснование.Регистратор,
	//|	ВТ_ДанныеСырые.РегистраторПлан,
	//|	ВТ_ДанныеСырые.РегистраторФакт
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_Данные1.ОбъектРемонта КАК ОбъектРемонта,
	//|	ВТ_Данные1.ВидРемонта КАК ВидРемонта,
	//|	ВТ_Данные1.ДатаНачала КАК ДатаНачала,
	//|	ВТ_Данные1.ДатаОкончания КАК ДатаОкончания,
	//|	ВТ_Данные11.ID_Ремонта КАК ID_Ремонта,
	//|	ВТ_Данные11.Операция КАК Операция,
	//|	ВТ_Данные11.ID_Операции КАК ID_Операции,
	//|	ВТ_Данные11.ПроцентПлан КАК ПроцентПлан,
	//|	ВТ_Данные11.ПроцентФакт КАК ПроцентФакт,
	//|	ВТ_Данные1.Регистратор КАК Регистратор,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Данные11.РегистраторПлан) = ТИП(Документ.торо_ПлановыеЗатраты)
	//|			ТОГДА ВТ_Данные1.РегистраторПлан.ДокументПлана
	//|		ИНАЧЕ ВТ_Данные11.РегистраторПлан
	//|	КОНЕЦ КАК РегистраторПлан,
	//|	ВТ_Данные11.РегистраторФакт КАК РегистраторФакт
	//|ПОМЕСТИТЬ ВТ_Данные
	//|ИЗ
	//|	ВТ_Данные1 КАК ВТ_Данные1
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Данные1 КАК ВТ_Данные11
	//|		ПО ВТ_Данные1.ID_Ремонта = ВТ_Данные11.ID_Ремонта
	//|			И ВТ_Данные1.ID_Операции = ВТ_Данные11.ID_Операции
	//|			И ВТ_Данные1.РегистраторПлан = ВТ_Данные11.РегистраторПлан
	//|			И ВТ_Данные1.РегистраторФакт = ВТ_Данные11.РегистраторФакт
	//|{ГДЕ
	//|	(ВТ_Данные1.ДатаНачала >= &НачалоПериода
	//|			И ВТ_Данные1.ДатаНачала <= &КонецПериода)}"
	//	
	//+ "
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|";
	
	// Соединение  ВТ_Данные1 с ВТ_Данные11 необходимо для того, чтобы СКД
	// не съедала группировку по ID_Операции. 
	
	Возврат "";//ЗапросТекст;
	
КонецФункции

#КонецОбласти
