Функция ДатаИлиСудноОбъектаИзменены(Ссылка, Знач ДатаПослеИзменения, Знач СудноПослеИзменения, ПолноеИмяТаблицы) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.vftРейс") Тогда
		ДатаКонтроля = "ДатаНачала";
	Иначе
		ДатаКонтроля = "Дата";
	КонецЕсли; 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ШапкаОбъекта."+ДатаКонтроля+"                                КАК Дата,
	|	ЕСТЬNULL(ШапкаОбъекта.Судно.КодБыстрогоВвода, """") КАК ПрефиксОрганизацииДоИзменения
	|ИЗ
	|	" + ПолноеИмяТаблицы + " КАК ШапкаОбъекта
	|ГДЕ
	|	ШапкаОбъекта.Ссылка = &Ссылка
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ПрефиксСуднаПослеИзменения = ПолучитьФункциональнуюОпцию("ПрефиксыСудов", Новый Структура("Судно", СудноПослеИзменения));
	
	// если задана пустая ссылка на организацию
	ПрефиксСуднаПослеИзменения = ?(ПрефиксСуднаПослеИзменения = Ложь, "", ПрефиксСуднаПослеИзменения);
	
	Возврат Выборка.ПрефиксОрганизацииДоИзменения <> ПрефиксСуднаПослеИзменения
		ИЛИ Не ПрефиксацияОбъектовСлужебный.ДатыОбъектаОдногоПериода(Выборка.Дата, ДатаПослеИзменения, Ссылка);
	//
КонецФункции