// Процедура устанавливает переданное значение в качестве основной организации
// текущего пользователя.
//
// Параметры
//  ОсновнаяОрганизация  - СправочникСсылка.Организации - организация,
//                         которая будет установлена в качестве основной организации.
//
Процедура УстановитьОсновноеСудно(ОсновноеСудно, ПоказыватьОповещение = Истина) Экспорт

	vftОбщегоНазначенияВызовСервера.УстановитьЗначениеПоУмолчанию("ОсновноеСудно", ОсновноеСудно);
	
	Если ЗначениеЗаполнено(ОсновноеСудно) И ПоказыватьОповещение Тогда
	
		ПоказатьОповещениеПользователя(НСтр("ru = 'Установлено основное судно:'"),
			ПолучитьНавигационнуюСсылку(ОсновноеСудно), ОсновноеСудно);
	
	КонецЕсли;
	
	Оповестить("ИзменениеОсновногоСудна", ОсновноеСудно);

КонецПроцедуры

&НаКлиенте
Функция ВыполнитьПервоначальноеЗаполнениеИнформационнойБазы() Экспорт
	Возврат vftОбщегоНазначенияВызовСервера.ВыполнитьПервоначальноеЗаполнениеИнформационнойБазы(); 
КонецФункции

&НаКлиенте
Процедура ПроверитьОбновлениеКонфигурации() Экспорт
	НастройкиОбновления = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().НастройкиОбновления;
	 
	//Если НастройкиОбновления.КонфигурацияИзменена Тогда
	//	ОткрытьФорму("Обработка.ОбновлениеКонфигурации.Форма.Форма");
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновлениеПаролейПользователей() Экспорт
	vftОбщегоНазначенияВызовСервера.ПроверитьПаролиПользователей();	
КонецПроцедуры
 