////////////////////////////////////////////////////////////////////////////////
// Содержит события форм, вызываемые на сервере
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- УправляемаяФорма - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					- Булево - признак отказа от создания формы.
//  СтандартнаяОбработка	- Булево - признак выполнения стандартной (системной) обработки события
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	// ++ rarus makole 2020-10-28 [СТТ БСО.СМ.006]
	// Хранение признака критичности данных
	рарусСинхронизацияССудном.ДобавитьРеквизитКритичностиВыгрузкиНаФорму(Форма, Отказ);
	// -- rarus makole 2020-10-29 [СТТ БСО.СМ.006]
	
	// ++ rarus ilshill 10.02.2021 
	рарусСУБСервер.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	// -- rarus ilshill 10.02.2021
	
	// ++ rarus PleA 03.03.2021
	рарусСинхронизацияССудном.ДобавитьРеквизитНомерВерсииНаСудне(Форма, Отказ);
	// -- rarus PleA
	
	// ++ rarus makole 2021-04-21 [Задача № 28685]
	// Кнопку Отправить в береговую систему сделать аналогично Заявке на снабжение
	рарусИмущественныйУчетСервер.ДобавитьКнопкуОтправкиНаБерег(Форма);
	// -- rarus makole 2021-04-21 [Задача № 28685]
	
	// ++ rarus yukuzi 15.02.2021   //ФТ.СНБ.02. Задача_Штрихкодирование
	рарусШтрихкодирование.ДобавитьЭлементыШтрихкодированияНаФорму(Форма);
	// -- rarus yukuzi 15.02.2021
	
	// ++ rarus PleA 22.06.2021 [РАIT-0023342]
	рарусХранениеВерсий.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	// -- rarus PleA

КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- УправляемаяФорма - форма, из обработчика события которой происходит вызов процедуры.
//	ТекущийОбъект			- Объект - объект, который будет прочитан.
//	ДополнительныеПараметры - Структура - дополнительные параметры.
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект, ДополнительныеПараметры = Неопределено) Экспорт

КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- УправляемаяФорма - форма, из обработчика события которой происходит вызов процедуры.
//	ТекущийОбъект			- Объект - записываемый объект.
//	ПараметрыЗаписи			- Структура - дополнительные параметры записи.
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

#Область СобытияЭлементовФорм

// Серверная переопределяемая процедура, вызываемая из обработчика события элемента.
//
// Параметры:
//   Форма                   - УправляемаяФорма - форма, из которой происходит вызов процедуры.
//   Элемент                 - Строка           - имя элемента-источника события "При изменении".
//   ДополнительныеПараметры - Структура        - значения дополнительных параметров влияющих на обработку.
//
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры = Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
