Процедура ВыполнитьКомандуШтрихкодирование(Форма, ИмяТаблицы, Команда) Экспорт
	Если СтрНайти(Команда.Имя, "Штрихкодирование_ПоискПоШтрихкоду") Тогда
		
		ОчиститьСообщения();
		ДополнительныеПараметры= Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("ИмяТаблицы", ИмяТаблицы);
		Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		ЗаголовокВвода = НСтр("ru = 'Введите штрихкод';
		|en = 'Enter barcode'");
		ПоказатьВводЗначения(Оповещение, "", ЗаголовокВвода);
	ИначеЕсли СтрНайти(Команда.Имя, "Штрихкодирование_ЗагрузитьДанныеИзТСД") Тогда
		ОчиститьСообщения();
		ДополнительныеПараметры= Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("ИмяТаблицы", ИмяТаблицы);
		
		
		МенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
		Новый ОписаниеОповещения("ЗагрузитьИзТСДЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		Форма.УникальныйИдентификатор);
		//тест!!
		//Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзТСДЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		//ПоказатьВводЗначения(Оповещение, "", "тест");

		
	КонецЕсли;

КонецПроцедуры 

Процедура ПоискПоШтрихкодуЗавершение(ДанныеШтрихкодов, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(ДанныеШтрихкодов) тогда
		 СтрокиДляТЧ=рарусШтрихкодированиеВызовСервера.ОбработатьШтрихкоды(ДанныеШтрихкодов);
		 Форма=ДополнительныеПараметры.Форма;
		 ИмяТаблицы=ДополнительныеПараметры.ИмяТаблицы;
		 ТЧ=Форма.Объект[ИмяТаблицы];
		 Для каждого стрТЗ Из СтрокиДляТЧ Цикл
		  	новаяСтрока=ТЧ.Добавить();
		 	ЗаполнитьЗначенияСвойств(новаяСтрока, стрТЗ);
 		 КонецЦикла; 
	КонецЕсли;
КонецПроцедуры
Процедура ЗагрузитьИзТСДЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	//тест!!
	//РезВып=рарусШтрихкодированиеВызовСервера.тест();
	//	Если РезВып.Результат Тогда
	//			СтрокиДляТЧ=рарусШтрихкодированиеВызовСервера.ОбработатьШтрихкоды(РезВып.ТаблицаТоваров);
	Если РезультатВыполнения.Результат Тогда
	    СтрокиДляТЧ=рарусШтрихкодированиеВызовСервера.ОбработатьШтрихкоды(РезультатВыполнения.ТаблицаТоваров);
		 Форма=ДополнительныеПараметры.Форма;
		 ИмяТаблицы=ДополнительныеПараметры.ИмяТаблицы;
		 ТЧ=Форма.Объект[ИмяТаблицы];
		 Для каждого стрТЗ Из СтрокиДляТЧ Цикл
		  	новаяСтрока=ТЧ.Добавить();
		 	ЗаполнитьЗначенияСвойств(новаяСтрока, стрТЗ);
 		 КонецЦикла; 

	Иначе
		ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:""%ОписаниеОшибки%"".';
		|en = 'An error occurred while executing the operation:""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры
