&НаСервере
Функция ПолучитьНормыСледования(ТекущийПункт, ПредыдущийПункт, ПроектСудна, ГрузБалласт, ОсновноеСудно) Экспорт
	
	//raruskzn AydaFZ 15.11.2019{
	//Добавил параметр ОсновноеСудно 
	//raruskzn AydaFZ 15.11.2019 }

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПункт",ТекущийПункт);
	Запрос.УстановитьПараметр("ПредыдущийПункт",ПредыдущийПункт);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	//raruskzn AydaFZ 15.11.2019{
	Запрос.УстановитьПараметр("ОсновноеСудно", ОсновноеСудно);

	Запрос.Текст = "ВЫБРАТЬ
	               |	vftТаблицаМорскихРасстоянийСрезПоследних.Расстояние КАК Расстояние
	               |ИЗ
	               |	РегистрСведений.vftТаблицаМорскихРасстояний.СрезПоследних(
	               |			&Дата,
	               |			ПунктОтправления = &ПредыдущийПункт
	               |				И ПунктСледования = &ТекущийПункт
	               |				И Судно = &ОсновноеСудно) КАК vftТаблицаМорскихРасстоянийСрезПоследних";
	//raruskzn AydaFZ 15.11.2019}
	Результат = Запрос.Выполнить().Выгрузить();
	СтруктураВозврата = Новый Структура;
	Если ГрузБалласт Тогда
		Время = ?(Результат.Количество()=0,0,Результат[0].Расстояние/ПроектСудна.СредняяСкоростьНаМореВГрузу);
	Иначе
		Время = ?(Результат.Количество()=0,0,Результат[0].Расстояние/ПроектСудна.СредняяСкоростьНаМореВБалласте);
	КонецЕсли; 	
	СтруктураВозврата.Вставить("Время", Время*60);
	СтруктураВозврата.Вставить("Расстояние", ?(Результат.Количество()=0,0,Результат[0].Расстояние));
	
	Возврат СтруктураВозврата;	
КонецФункции
 