#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	 //СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	 //Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// ++ rarus zalikh 2021-04-28 [27313]
	//устанавливаем отбор, если он есть, по документу "МероприятиеСУБ"
	Если Параметры.Свойство("ОтборПоМероприятиюСУБ") Тогда
		Параметры.Свойство("ОтборПоМероприятиюСУБ", ОтборПоМероприятиюСУБ);
		Настройки = Список.КомпоновщикНастроек.ФиксированныеНастройки;
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВладелецЗамечания");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ОтборПоМероприятиюСУБ;
	КонецЕсли;
	//устанавливаем отбор, если он есть, по ПВХ "ВопросыДляАнкетирования"
	Если Параметры.Свойство("ОтборПоВопросуДляАнкетирования") Тогда
		Параметры.Свойство("ОтборПоВопросуДляАнкетирования", ОтборПоВопросуДляАнкетирования);
		Настройки = Список.КомпоновщикНастроек.ФиксированныеНастройки;
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВопросАнкетирования");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ОтборПоВопросуДляАнкетирования;
	КонецЕсли;
	// -- rarus zalikh 2021-04-28
	Если Параметры.Свойство("ОткрытыйОтвет") Тогда
		ОткрытыйОтвет = Параметры.ОткрытыйОтвет;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	

	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить(); 
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Закрыт");
	ЭлементОтбора.Использование = Истина; 
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
	ЭлементОформления.Использование = Истина;
	

	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить(); 
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен");
	ЭлементОтбора.Использование = Истина; 
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноОранжевый);
	ЭлементОформления.Использование = Истина;
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить(); 
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Отправлен");
	ЭлементОтбора.Использование = Истина; 
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);
	ЭлементОформления.Использование = Истина;

	                                                              
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;	
		
	Если ЗначениеЗаполнено(ОтборПоМероприятиюСУБ) И ЗначениеЗаполнено(ОтборПоВопросуДляАнкетирования) Тогда
		
		ЗначениеРеквизитовМероприятия = ПолучитьЗначениеРеквизитовДляЗаполнения(ОтборПоМероприятиюСУБ, 
		                                                                        ОтборПоВопросуДляАнкетирования);
		
		ПараметрыЗаполнения = Новый Структура;     
		ПараметрыЗаполнения.Вставить("Судно", ЗначениеРеквизитовМероприятия.Судно);
		ПараметрыЗаполнения.Вставить("Дата",  ЗначениеРеквизитовМероприятия.Дата);
		ПараметрыЗаполнения.Вставить("ВладелецЗамечания", ОтборПоМероприятиюСУБ);
		ПараметрыЗаполнения.Вставить("ВопросАнкетирования", ОтборПоВопросуДляАнкетирования);
		ПараметрыЗаполнения.Вставить("ОписаниеНесоответствия", ОткрытыйОтвет);

		ОткрытьФорму("Справочник.vftНесоответствия.Форма.ФормаЭлементаСУБ",
		        Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения), ЭтотОбъект,,,,);
		
	Иначе	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Невозможно создать замечание из анкеты.';
		|en = 'Unable to create a comment from a questionnaire.'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитовДляЗаполнения(ДокументМероприятие, ВопросАнкет)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументМероприятие, "Судно, Дата");
	
КонецФункции

#КонецОбласти
