// Скрыта видимость полей "Ответственный" и "ОтветКомпании " 19.06.2017 
//по заданию от Комягина Дениса Александровича //rarus dr
#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	vftОбщиеПроцедурыДокументовСервер.ПриСозданииНаСервере(Отказ,Объект);
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьКнопкиИзмененияСтатуса(ЭтаФорма,Элементы.ПодменюСтатус,Объект.Статус);	
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьДоступностьЭлементовФормы(ЭтаФорма);

	ГлавныйУзел = ПланыОбмена.ГлавныйУзел() = Неопределено;
	
	ЭтаФорма.ТолькоПросмотр =  НЕ vftОбщиеПроцедурыДокументовСервер.ПолучитьВозможностьРедактироватьФормуПоСтатусу(Объект.Статус);
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНесоответствийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		Владелец = Объект.Ссылка;
		Форма = ПолучитьФорму("Справочник.vftНесоответствия.ФормаОбъекта");
		Форма.Объект.Владелец 	= Владелец;
		// ++ rarus ilshill - 24.06.2021
		Форма.Объект.ВладелецЗамечания = Владелец; 
		// -- rarus ilshill - 24.06.2021
		Форма.Объект.Судно 		= Объект.Судно;
		Форма.Открыть();
	Иначе
		СообщениеПользователю = новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Доклад не записан. Для добавления несоответствий запишите документ.";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//rarus_AfoD 27.08.2021 < 
	ПриИзмененииОтбораВладелецЗамечаний();
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"Владелец",Объект.Ссылка,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	//rarus_AfoD 27.08.2021 > 
	
	УстановитьДоступностьРеквизитов();
	vftОбщиеПроцедурыДокументовКлиент.УстановитьУсловноеОформление(Список);	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//rarus_AfoD 27.08.2021 < 
	ПриИзмененииОтбораВладелецЗамечаний();
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"Владелец",Объект.Ссылка,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	//rarus_AfoD 27.08.2021 > 
	
	// ++ rarus Камаев П.В. 22.12.2020 Задача № 26135
	Оповестить("ОбновитьСписокЖурналДокументов",,ПолучитьФорму("ОбщаяФорма.vftЖурналДокументов")); 
	// -- rarus Камаев П.В. 22.12.2020
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//rarus_AfoD 27.08.2021 < 
&НаКлиенте
Процедура ПриИзмененииОтбораВладелецЗамечаний()
	
	// очистить связанные отборы
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Список.Отбор.Элементы, НСтр("ru = 'Отбор по владельцам'"), ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора,"Владелец",			Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,,Истина);	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора,"ВладелецЗамечания",	Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,,Истина);	
	//Отбор.Элементы.Удалить(ГруппаОтбора);
	
КонецПроцедуры
//rarus_AfoD 27.08.2021 > 
	
#КонецОбласти 

#Область События_Элементов_Формы

&НаКлиенте
Процедура ОтветКомпанииПриИзменении(Элемент)
	
	Объект.Ответственный = ТекущийПользователь;

КонецПроцедуры

#КонецОбласти

#Область Управление_Доступностью

&НаСервере
Процедура УстановитьДоступностьРеквизитов();
	
	МассивНедоступныхДляРедатированияРеквизитов = ПолучитьЗапрещенныеРеквизиты();
	
	vftОбщиеПроцедурыДокументовСервер.УстановитьДоступностьРеквизитов(ЭтаФорма,МассивНедоступныхДляРедатированияРеквизитов,Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапрещенныеРеквизиты()
	
	Возврат	ПолучитьСоответствиеСтатусаИЗапрещенныхРеквизитов().Получить(Объект.Статус);
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеСтатусаИЗапрещенныхРеквизитов() Экспорт
	
	Соответствие = Новый Соответствие;  

	МассивВсеРеквизиты = vftОбщиеПроцедурыДокументовСервер.ПолучитьВсеЭлементыФормыДокумента(Объект,Ложь);
	
	Если ГлавныйУзел тогда
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Черновик	,МассивВсеРеквизиты);	
		
		МассивОтправлен = vftОбщиеПроцедурыДокументовСервер.СкопироватьМассивСтрок(МассивВсеРеквизиты,"#ОтветКомпании#Ответственный#");		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Отправлен	,МассивОтправлен);
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Получен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Закрыт		,МассивВсеРеквизиты);

	Иначе
		
		МассивЧерновик = Новый Массив;
		МассивЧерновик.Добавить("ОтветКомпании");	
		МассивЧерновик.Добавить("Ответственный");
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Черновик	,МассивЧерновик);
		
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Отправлен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Получен	,МассивВсеРеквизиты);
		Соответствие.Вставить(Перечисления.vftСтатусыДокументовСообщений.Закрыт		,МассивВсеРеквизиты);
		
	КонецЕсли;
	
	Возврат  Соответствие;
	
КонецФункции

&НаКлиенте
Процедура РазрешитьРедактированиеВсехРеквизитов(Команда)
	
РазрешитьРедактированиеВсехРеквизитовСервер();	

КонецПроцедуры

&НаСервере
Процедура РазрешитьРедактированиеВсехРеквизитовСервер()
	
vftОбщиеПроцедурыДокументовСервер.РазрешитьРедактированиеВсехРеквизитов(ЭтаФорма);	

КонецПроцедуры

#КонецОбласти

#Область Кнопки_Изменения_Статуса

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИзмененияСтатуса(Команда)
	
	Объект.Статус = vftОбщиеПроцедурыДокументовКлиент.ПолучитьСтатусПоИмениКоманды(Команда.Имя);
	 	 
	/////rarus_islamr_26.02.18 ++
	ИзменениеДатыПриСтатусеОтправлен();
	/////rarus_islamr_26.02.18 --

КонецПроцедуры

&НаСервере
Функция ПолучитьВозможныеСтатусы() Экспорт
	
	Возврат vftОбщиеПроцедурыДокументовСервер.ПолучитьВозможныеСтатусы();
	
КонецФункции

/////rarus_islamr_26.02.18 ++
 &НаСервере
Функция ИзменениеДатыПриСтатусеОтправлен() 
	
	Если Объект.Статус = Перечисления.vftСтатусыДокументовСообщений.Отправлен Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;	
	
КонецФункции
/////rarus_islamr_26.02.18 --

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) Экспорт
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды() Экспорт
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
