Функция СведенияОВнешнейОбработке() Экспорт
	
	 ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Версия = "1.10";
    ПараметрыРегистрации.БезопасныйРежим = Ложь;
    НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = "АРМ по обеспечению потребностей в ТМЦ на судах";
    НоваяКоманда.Идентификатор = "АРМ по обеспечению потребностей в ТМЦ на судах";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    НоваяКоманда.ПоказыватьОповещение = Ложь;
    
    Возврат ПараметрыРегистрации;
КонецФункции
