#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда
		
		Если СостоитИзДругихУпаковок Тогда
			Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "Коэффициент") * КоличествоУпаковок;
		Иначе
			Родитель           = Справочники.УдалитьУпаковкиНоменклатуры.ПустаяСсылка();
			КоличествоУпаковок = 0;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не СостоитИзДругихУпаковок Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Родитель");
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоУпаковок");		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли