// Описывает учетные механизмы используемые в прикладной конфигурации.
//
// Параметры:
//  МеханизмыКонфигурации - Структура - список учетных механизмов,
//              где Ключ - имя механизма, а Значение - модуль реализующий интерфейс проведения.
//
Процедура ДополнитьУчетныеМеханизмыКонфигурации(МеханизмыКонфигурации) Экспорт
	
	// ++ rarus PleA 04.12.2020 [ФТ.СНБ.01.1]
	МеханизмыКонфигурации.Вставить("ЗаявкаНаСнабжение", "рарусЗаявкаНаСнабжениеСервер");
	// -- rarus PleA
	
	// ++ rarus PleA 26.11.2020 [ФТ.СНБ.01.15]
	МеханизмыКонфигурации.Вставить("АктВыполненныхРаботОказанныхУслуг", "рарусАктВыполненныхРаботОказанныхУслуг");
	// -- rarus PleA
	
	// ++ rarus PaSe 30-11-2020
	МеханизмыКонфигурации.Вставить("ТоварыНаСкладах", "рарусТоварыНаСкладах");
	МеханизмыКонфигурации.Вставить("ТоварыУслугиКПоступлению", "рарусТоварыУслугиКПоступлению");
	// -- rarus PaSe 30-11-2020
	
	// rarus evgenu 2020_12_17 ++ 
	МеханизмыКонфигурации.Вставить("впВыявленныеДефекты", "впВыявленныеДефекты");
	// rarus evgenu 2020_12_17 --
	
	// rarus evgenu 2020_12_18 ++ 
	МеханизмыКонфигурации.Вставить("впСостоянияОбъектовРемонта", "впСостоянияОбъектовРемонта");
	// rarus evgenu 2020_12_18 --
	
	// ++ rarus makole 2020-12-29 [ФТ.ИМ.01.01]
	// Добавить движение прихода по регистру накопления «Имущество на судах»
	МеханизмыКонфигурации.Вставить("рарусИмущественныйУчет", "рарусИмущественныйУчетСервер");
	// -- rarus makole 2020-12-29 
	
	// ++ rarus yukuzi 30.12.2020   // Снабжение ТОИР 2 Приоритет
	МеханизмыКонфигурации.Вставить("рарусТоварыЗаявокНаСнабжение", "рарусТоварыЗаявокНаСнабжение");
	// -- rarus yukuzi 30.12.2020

КонецПроцедуры
