&НаСервере
Функция ПолучитьМассивСмежныхПунктов(Пункт, Значение = "") Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пункт",Пункт);
	// ++ rarus Камаев П.В. 03.04.2020 Задача № 20785
	Если ТипЗнч(Значение) = Тип("ДокументСсылка.vftРейс") Тогда
		МодельРДО = Значение.Судно.Проект.МодельРДО;
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.vftСуда") Тогда
		МодельРДО = Значение.Проект.МодельРДО;
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.vftПроектыСудов") Тогда
		МодельРДО = Значение.МодельРДО;
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.впМодельРДО") Тогда
		МодельРДО = Значение;
	Иначе
		МодельРДО = Справочники.впМодельРДО.ПустаяСсылка();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МодельРДО1", МодельРДО);
	Запрос.УстановитьПараметр("МодельРДО2", МодельРДО);
	
	//Для СГФ смотрим и по пустому Модели РДО
	Если МодельРДО = Справочники.рарусСправочникСсылок.МодельРДО_СГФ.Значение Тогда
		Запрос.УстановитьПараметр("МодельРДО2", Справочники.впМодельРДО.ПустаяСсылка());
	КонецЕсли;	
	
	// -- rarus Камаев П.В. 03.04.2020
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	vftСвязьПунктовСледования.ПунктСмежный КАК ПунктСмежный
	|ИЗ
	|	РегистрСведений.vftСвязьПунктовСледования КАК vftСвязьПунктовСледования
	|ГДЕ
	|	vftСвязьПунктовСледования.ПунктТекущий = &Пункт
	// ++ rarus Камаев П.В. 03.04.2020 Задача № 20785
	|	И (vftСвязьПунктовСледования.МодельРДО = &МодельРДО1
	|	ИЛИ vftСвязьПунктовСледования.МодельРДО = &МодельРДО2)";
	// -- rarus Камаев П.В. 03.04.2020
	МассивСмежныхПунктов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПунктСмежный");
	// rarus_KloA_21.11.2014 < 
	МассивСмежныхПунктов.Добавить(Пункт);
	// rarus_KloA_21.11.2014 > 
	Возврат МассивСмежныхПунктов;
КонецФункции
 