
Функция ПодготовитьТаблицуДвижений(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	  Запрос.УстановитьПараметр("Ссылка", Ссылка);
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.ОбъектРемонта КАК ОбъектРемонта,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыПо КАК ДатаРаботыПо,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.НовоеЗначение КАК НовоеЗначение,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.НаработкаПоРемонту КАК НаработкаПоРемонту
	                 |ИЗ
	                 |	Документ.впУчетНаработкиОборудования.НаработкаОбъектов КАК впУчетНаработкиОборудованияНаработкаОбъектов
	                 |ГДЕ
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.Ссылка = &Ссылка
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	впУчетНаработкиОборудованияПодчиненныеОбъекты.ПодчиненныйОбъект,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.Показатель,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыПо,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.НовоеЗначение,
	                 |	NULL
	                 |ИЗ
	                 |	Документ.впУчетНаработкиОборудования.НаработкаОбъектов КАК впУчетНаработкиОборудованияНаработкаОбъектов
	                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.впУчетНаработкиОборудования.ПодчиненныеОбъекты КАК впУчетНаработкиОборудованияПодчиненныеОбъекты
	                 |		ПО впУчетНаработкиОборудованияНаработкаОбъектов.Ссылка = впУчетНаработкиОборудованияПодчиненныеОбъекты.Ссылка
	                 |			И впУчетНаработкиОборудованияНаработкаОбъектов.ОбъектРемонта = впУчетНаработкиОборудованияПодчиненныеОбъекты.Объект
	                 |			И (впУчетНаработкиОборудованияНаработкаОбъектов.Ссылка = &Ссылка)";
	  
	  Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции