#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДанныеВыбораБаржа(Текст) Экспорт
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос=Новый Запрос;
	//Запрос.УстановитьПараметр("Сторонние",Справочники.Суда.СторонниеОбъекты);
	Запрос.УстановитьПараметр("СтрокаПоиска","%"+Текст+"%");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Суда.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.vftСуда КАК Суда
	|ГДЕ
	|	Суда.Наименование ПОДОБНО &СтрокаПоиска
	|	И НЕ Суда.ЭтоГруппа
	//|	И Суда.Родитель <> &Сторонние
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ДанныеВыбора;
КонецФункции

#КонецЕсли
