&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ПараметрыЗакрытия());
	
КонецПроцедуры

&НаСервере
Функция ПараметрыЗакрытия()
	
	Структура = Новый Структура();
	Структура.Вставить("ДатаВходящегоДокумента", ДатаВходящегоДокумента);
	Структура.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
	Структура.Вставить("Комментарий", Комментарий);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура КонтрольЗаполненияПараметров()
	
	ПараметрыЗаполнены = Истина;
	
	Если НЕ ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
		ПараметрыЗаполнены = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерВходящегоДокумента) Тогда
		ПараметрыЗаполнены = Ложь;
	КонецЕсли;
	
	Элементы.ОК.Доступность = ПараметрыЗаполнены;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерВходящегоДокументаПриИзменении(Элемент)
	
	КонтрольЗаполненияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаПриИзменении(Элемент)
	
	КонтрольЗаполненияПараметров();
	
КонецПроцедуры

