// Заполняет настройки, влияющие на использование плана обмена.
// 
// Параметры:
//  Настройки - Структура - настройки плана обмена по умолчанию, см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию,
//                          описание возвращаемого значения функции.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	//raruskzn AydaFZ 21.11.2019 Задача № 17711{	
	Настройки.ИмяКонфигурацииИсточника 								= "Судовой модуль VP";
	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена 		= Ложь;
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса 					= Ложь;
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки 		= Истина;
	//Настройки.Алгоритмы.НастроитьИнтерактивнуюВыгрузку			= Истина;
	//raruskzn AydaFZ 21.11.2019}
	
КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
// 
// Параметры:
//  ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                       см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                       описание возвращаемого значения.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	//raruskzn AydaFZ 21.11.2019 {
	
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника 				= НСтр("ru = 'Настройки обмена Судовой модуль - ERP';
																			|en = 'Configure 1C:ERPShipboard module exchange'");
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными 	= Истина;
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена 		= ОбменДаннымиСервер.ВсеТранспортыСообщенийОбменаКонфигурации();
	ОписаниеВарианта.ИмяКонфигурацииКорреспондента 				= НСтр("ru = 'УПП'");
	//raruskzn AydaFZ 21.11.2019}

КонецПроцедуры
