
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// ++ rarus makole 2021-04-26 [РАIT-0023284]
	// Добавление дополнительных реквизитов в заявки, позволяющих группировать/отбирать их более детально. 
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.рарусКатегорииЗаявокНаСнабжение.Плановая"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.рарусКатегорииЗаявокНаСнабжение.Внеплановая"));
	// -- rarus makole 2021-04-26 [РАIT-0023284]
КонецПроцедуры
