
&НаКлиенте
Процедура Настройки(Команда)
	
	ИнвертироватьПанельНастройки();
	УстановитьВидимостьПанелиНастроек();
	
КонецПроцедуры

&НаКлиенте 
Процедура ИнвертироватьПанельНастройки()
	
	ПанельНастроек = НЕ ПанельНастроек;
	Элементы.КнопкаНастройки.Пометка = ПанельНастроек;
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьВидимостьПанелиНастроек()
	
	Элементы.ГруппаНастройки.Видимость = ПанельНастроек;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПанельНастроек = ЛОЖЬ;
	УстановитьВидимостьПанелиНастроек();
	//rarus_rasuli_30.03.18 ++
	ЕслиСтатусПустой();
	//rarus_rasuli_30.03.18 --	
	vftОбщиеПроцедурыДокументовКлиент.УстановитьУсловноеОформлениеРапорт(Список);
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппаСудовПриИзменении(Элемент)
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппаСудовОчистка(Элемент, СтандартнаяОбработка)
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
КонецПроцедуры

//rarus_rasuli_30.03.18 ++
&НаСервере
Функция ЕслиСтатусПустой()
	Выборка = Документы.vftРапортОПоврежденииНеисправности.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		Если не ЗначениеЗаполнено(Выборка.Статус) Тогда
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Если  ЗначениеЗаполнено(Объект.Статус2) Тогда
				Объект.Статус = Объект.Статус2;
			Иначе
				Объект.Статус = Перечисления.vftСтатусыДокументаРапортОПовреждении.Черновик;
			КонецЕсли;
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

//rarus_rasuli_30.03.18 --

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ++ rarus ilshill 12.02.2021
			
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ") Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;	
		ЭтаФорма.Заголовок = "Рапорт о техническом недостатке";
		
	КонецЕсли;
	// -- rarus ilshill 12.02.2021

КонецПроцедуры

