
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
	Иначе
		Объект.Судно = vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно");
		СтруктураПредРейса = получитьСтруктуруПредРейса();
		Объект.ДатаНачала = СтруктураПредРейса.ДатаНачала;
		Объект.ПортОтправления = СтруктураПредРейса.ПортОтправления;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПредРейса()
	СтруктураВозврата = Новый Структура("ДатаНачала,ПортОтправления");
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Судно", vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно"));
	Запись = РегистрыСведений.vftТаблицаДвижения.ПолучитьПоследнее(,СтруктураОтбора);
	ОкончаниеВыгрузки = Константы.vftОкончаниеВыгрузки.Получить();
	Если Запись.ВидОперации = ОкончаниеВыгрузки Тогда
		СтруктураВозврата.ДатаНачала = Запись.Начало;
		СтруктураВозврата.ПортОтправления = Запись.Пункт;
	КонецЕсли; 
	
	Возврат СтруктураВозврата;
КонецФункции
 
 
 
