
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ИспользоватьФункционалСУБ = ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ");
	
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Отправлен"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Закрыт"));
		
	Если ИспользоватьФункционалСУБ Тогда		
		ДанныеВыбора.Удалить(ДанныеВыбора.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен")));
	КонецЕсли;

КонецПроцедуры
