///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;
// ++ rarus Камаев П.В. 06.10.2020 Задача № 24459
//Перем глЗавершитьРаботуСистемы Экспорт;
Перем глПередаватьДанныеПриВыходе Экспорт;
Перем глЭтоГлавныйУзел Экспорт;
// -- rarus Камаев П.В. 06.10.2020

// Конец СтандартныеПодсистемы

// ++ rarus yukuzi 31.01.2021   // ФТ.СНБ.02. Задача_Штрихкодирование
// ПодключаемоеОборудование
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте
// Конец ПодключаемоеОборудование
// -- rarus yukuzi 31.01.2021


#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	//++rarus markim	
	Если vftОбщегоНазначенияВызовСервера.ЭтоПолноправныйПользовательИБ() Тогда
		Результат = vftОбщегоНазначенияВызовСервера.СоздатьПервогоАдминистратора();
		Если Результат<>Неопределено Тогда
			ЗавершитьРаботуСистемы(Ложь, Истина);
		КонецЕсли; 
		
	КонецЕсли; 
	
	// ++ rarus kloa 07.09.2017 
	Результат = vftОбщегоНазначенияВызовСервера.ПроверитьРолиПользователей();
	Если Результат = Ложь Тогда
		ЗавершитьРаботуСистемы(Ложь, Истина);
	КонецЕсли; 
	// -- rarus kloa 07.09.2017 	
	
	//rarus yukuzi 22.06.2021 - закомментировано до момента необходимости штрихкодирования
	//// ++ rarus yukuzi 31.01.2021   // ФТ.СНБ.02. Задача_Штрихкодирование
	//// ПодключаемоеОборудование
	//МенеджерОборудованияКлиент.ПередНачаломРаботыСистемы();
	//// Конец ПодключаемоеОборудование
	//// -- rarus yukuzi 31.01.2021
	
	// ++ rarus yukuzi 18.10.2021   //
	//vftОбщегоНазначенияВызовСервера.РазместитьИнфопанельНаНачальнойСтранице();
	// -- rarus yukuzi 18.10.2021
	// ++ rarus yukuzi 21.10.2021   //
	ИзмененаНастройка=vftОбщегоНазначенияВызовСервера.РазместитьИнфопанельНаНачальнойСтранице();
	Если ИзмененаНастройка тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	// -- rarus yukuzi 21.10.2021


КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// rarus_KloA_28.07.2014 < 
	//Если это подчиненный узел, тогда
	//выполним создание пользователя- Пользователь
	//назначим ему основное судно
	Если vftОбщегоНазначенияВызовСервера.ЭтоПолноправныйПользовательИБ() Тогда
		vftОбщегоНазначенияКлиент.ВыполнитьПервоначальноеЗаполнениеИнформационнойБазы();	
	КонецЕсли; 
	// rarus_KloA_28.07.2014 >
	
	// rarus_KloA_01.08.2014 < 
	//	vftОбщегоНазначенияКлиент.ПроверитьОбновлениеКонфигурации();
	vftОбщегоНазначенияКлиент.ПроверитьОбновлениеПаролейПользователей();
	// rarus_KloA_01.08.2014 > 
	
	// ++ rarus Титков 03.06.2020 21929
	// временно отказались от автозаполнения
	//vftОбщегоНазначенияВызовСервера.УстановитьЗаголовокСистемы();
	// -- rarus Титков 03.06.2020 21929
	
	// ++ rarus Камаев П.В. 24.07.2020 Задача № 22963
	vftОбщегоНазначенияВызовСервера.ОбработкаДублейПриЗапуске(); 
	// -- rarus Камаев П.В. 24.07.2020
	
	// ++ rarus Камаев П.В. 06.10.2020 Задача № 24459 
	ПередаватьДанныеПриВыходе = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("ПередаватьДанныеПриВыходе", "ПередаватьДанныеПриВыходе");
	Если ПередаватьДанныеПриВыходе = Истина Тогда
		глПередаватьДанныеПриВыходе = Истина;
	Иначе
		глПередаватьДанныеПриВыходе = Ложь;
	КонецЕсли;
	глЭтоГлавныйУзел = vftОбщегоНазначения.ЭтоГлавныйУзел();
	// -- rarus Камаев П.В. 06.10.2020
	
	// ++ rarus makole 2020-12-21
	Если Не глЭтоГлавныйУзел Тогда
		рарусОбщегоНазначенияВызовСервера.ЗапуститьРегламентноеЗаданиеОбновленияСоставаПользователей();
	КонецЕсли;
    // -- rarus makole 2020-12-21
	
	// ++ rarus PleA 03.03.2021 
	рарусОбщегоНазначенияВызовСервера.УстановитьВерсиюКонфигурацииСудна();
	// -- rarus PleA
	
		
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// ++ rarus Камаев П.В. 06.10.2020 Задача № 24459 
	//Если глПередаватьДанныеПриВыходе И НЕ глЗавершитьРаботуСистемы И НЕ глЭтоГлавныйУзел Тогда
	//	Отказ = Истина;
	//	ТекстПредупреждения = "Для отправки данных в центральную базу судового модуля нажмите ""Продолжить работу"".";
	//	ПодключитьОбработчикОжидания("ВыполнитьПередачуДанныхВГлавныйУзел", 0.1, Истина);
	//	Возврат;
	//КонецЕсли;
	//глЗавершитьРаботуСистемы = Ложь;
	// -- rarus Камаев П.В. 06.10.2020
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	// rarus_KloA_04.08.2014 < 
	//	vftОбщегоНазначенияКлиент.ПроверитьОбновлениеПаролейПользователей(); //rarus markim - серверные вызовы запрещены, переносим в регзадания
	// rarus_KloA_04.08.2014 >
	
КонецПроцедуры

#КонецОбласти                                
