///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	//rarus yukuzi 22.06.2021 - закомментировано до момента необходимости штрихкодирования
	//// ++ rarus yukuzi 31.01.2021   //  ФТ.СНБ.02. Задача_Штрихкодирование
	//// ПодключаемоеОборудование
	//Если ИменаПараметровСеанса = Неопределено Тогда
	//	
	//	// Раздел безусловной установки параметров сеанса.
	//	
	//	// Конец УниверсальныеМеханизмы
	//	// Переопределяемый блок
	//	//
	//	// Конец переопределяемого блока.
	//	
	//	// УниверсальныеМеханизмы
	//Иначе
	//	// Установка параметров сеанса "по требованию".
	//	// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
	//	// следует инициализировать сразу группой. для того, чтобы избежать их повторной инициализации, 
	//	// имена уже установленных параметров сеанса сохраняются в структуре УстановленныеПараметры.
	//	УстановленныеПараметры = Новый Массив();
	//	Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
	//		УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
	//	КонецЦикла;
	//КонецЕсли;
	//
	//// Конец ПодключаемоеОборудование
	//// -- rarus yukuzi 31.01.2021
	
	
КонецПроцедуры
// ++ rarus yukuzi 31.01.2021   //  ФТ.СНБ.02. Задача_Штрихкодирование
Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	// Конец УниверсальныеМеханизмы
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Конец УниверсальныеМеханизмы
	
	// Переопределяемый блок
	// ПодключаемоеОборудование
	МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры);
	// Конец ПодключаемоеОборудование
	// Конец переопределяемого блока.
	
КонецПроцедуры

// -- rarus yukuzi 31.01.2021



#КонецОбласти

#КонецЕсли