
#Область События_Формы

&НаКлиенте
Процедура Настройки(Команда)
	
	ИнвертироватьПанельНастройки();
	УстановитьВидимостьПанелиНастроек();
	
КонецПроцедуры

&НаКлиенте 
Процедура ИнвертироватьПанельНастройки()
	
	ПанельНастроек = НЕ ПанельНастроек;
	Элементы.КнопкаНастройки.Пометка = ПанельНастроек;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПанельНастроек = ЛОЖЬ; 	
	УстановитьВидимостьПанелиНастроек();
	vftОбщиеПроцедурыДокументовКлиент.УстановитьУсловноеОформление(Список);	
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);

КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппаСудовПриИзменении(Элемент)
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппаСудовОчистка(Элемент, СтандартнаяОбработка)
	vftОбщиеПроцедурыДокументовКлиент.УстановитьПараметрГруппаСудов(Список,ОтборГруппаСудов);
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	 ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);
	 
КонецПроцедуры

#КонецОбласти

#Область Служебные
&НаКлиенте
Функция ПолучитьМассивВыделенныхДокументовСписка()
	МассивДокументов = Новый массив;	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для каждого элемент_списка Из ВыделенныеСтроки Цикл
		
		МассивДокументов.Добавить(Элементы.Список.ДанныеСтроки(Элемент_Списка).Документ);
		
	КонецЦикла;

	Возврат МассивДокументов;
КонецФункции

&НаКлиенте 
Процедура УстановитьВидимостьПанелиНастроек()
	
	Элементы.ГруппаНастройки.Видимость = ПанельНастроек;
	
КонецПроцедуры

#КонецОбласти

#Область Создание_Документов
&НаКлиенте
Процедура СоздатьСообщениеОПотенциальномИнциденте(Команда)
	
	ОткрытьФорму("Документ.vftСообщениеОПотенциальномИнциденте.ФормаОбъекта",,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьАнализСУБ(Команда)
	
	ОткрытьФорму("Документ.vftАнализСУБ.ФормаОбъекта",,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор);
	 
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокладОСостоянииБезопасности(Команда)
	
	ОткрытьФорму("Документ.vftДокладОСостоянииБезопасности.ФормаОбъекта",,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор);
	  
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокладОНесоответствии(Команда)
	
	ОткрытьФорму("Справочник.vftДокладыОНесоответствии.ФормаОбъекта",,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор);
	  
КонецПроцедуры




#КонецОбласти

#Область Печать

&НаКлиенте
Процедура СообщениеОПотенциальномИнцидентеWord(Команда)
	
	МассивТД = vftОбщиеПроцедурыДокументовСервер.ПолучитьТабличныеДокументыДокладОНесоответвтии(ПолучитьМассивВыделенныхДокументовСписка());
	
	vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивТД,"Документ.VftСообщениеОПотенциальномИнциденте.ПФ_DOC_СообщениеОПотенциальномИнциденте");

КонецПроцедуры

&НаКлиенте
Процедура СообщениеОПотенциальномИнцидентe(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.VftСообщениеОПотенциальномИнциденте", "СообщениеОПотенциальномИнциденте", 
			ПолучитьМассивВыделенныхДокументовСписка(), ЭтаФорма);
	

КонецПроцедуры

&НаКлиенте
Процедура АнализСУБ(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.vftАнализСУБ", "АнализСУБ", 
			ПолучитьМассивВыделенныхДокументовСписка(), ЭтаФорма);
	   
КонецПроцедуры

&НаКлиенте
Процедура АнализСУБWord(Команда)
	
	МассивТД = vftОбщиеПроцедурыДокументовСервер.ПолучитьТабличныеДокументыАнализСУБ(ПолучитьМассивВыделенныхДокументовСписка());
	
	vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивТД,"Документ.vftАнализСУБ.ПФ_DOC_АнализСУБ",1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокладОСостоянииБезопасностиWord(Команда)
	
	МассивТД = vftОбщиеПроцедурыДокументовСервер.ПолучитьТабличныеДокладОСостоянииБезопасности(ПолучитьМассивВыделенныхДокументовСписка());
	
	vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивТД,"Документ.vftДокладОСостоянииБезопасности.ПФ_DOC_ДокладОСостоянииБезопасности");

КонецПроцедуры

&НаКлиенте
Процедура ДокладОСостоянииБезопасности(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.vftДокладОСостоянииБезопасности", "ДокладОСостоянииБезопасности", 
				ПолучитьМассивВыделенныхДокументовСписка(), ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДокладОНесоответствии(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.vftДокладыОНесоответствии", "ДокладОНесоответствии", 
				ПолучитьМассивВыделенныхДокументовСписка(), ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДокладОНесоответствииWord(Команда)
	
	МассивТД = vftОбщиеПроцедурыДокументовСервер.ПолучитьТабличныеДокладОНесоответствие(ПолучитьМассивВыделенныхДокументовСписка());
	
	// ++ rarus kloa 08.01.2019  
	//vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивТД,"Справочник.vftДокладыОНесоответствии.ПФ_DOC_ДокладОНесоответствии");
	Каталог = Неопределено;
	МассивДокладов = Новый Массив;
	МассивРешений = Новый Массив;
	МассивДонесений = Новый Массив;
	Для каждого ТекДокумент  Из МассивТД Цикл
		Если ТекДокумент.Раздел = "Доклад" Тогда
			МассивДокладов.Добавить(ТекДокумент);	
		ИначеЕсли ТекДокумент.Раздел = "Решение" Тогда 
			МассивРешений.Добавить(ТекДокумент);
		ИначеЕсли ТекДокумент.Раздел = "Донесение" Тогда 
			МассивДонесений.Добавить(ТекДокумент);
		КонецЕсли; 
	КонецЦикла; 
	
	vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивДокладов,"Справочник.vftДокладыОНесоответствии.ПФ_DOC_ДокладОНесоответствии",,Каталог);
	vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивРешений,"Справочник.vftДокладыОНесоответствии.ПФ_DOC_РешениеПоДокладу",,Каталог);
	vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивДонесений,"Справочник.vftДокладыОНесоответствии.ПФ_DOC_ДонесениеОбУстранении",,Каталог);
	// -- rarus kloa 08.01.2019 
	

КонецПроцедуры

#КонецОбласти

// ++ rarus Камаев П.В. 22.12.2020 Задача № 26135
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьСписокЖурналДокументов" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры
// -- rarus Камаев П.В. 22.12.2020

