
// ++ rarus Камаев П.В. 16.10.2020 Задача № 24841
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиПродолжение", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиПродолжение()
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		СписокПриАктивизацииСтрокиНаСервере(ТекСтрока);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(Узел)
	
	Если ПланыОбмена.Полный.ЭтотУзел() <> Узел
		И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") 
		И ЗначениеЗаполнено(Узел) Тогда
		
		ПомощникСозданияОбменаДанными = Обработки["ПомощникСозданияОбменаДанными"].Создать();
		ПомощникСозданияОбменаДанными.Инициализация(Узел);
		
		Попытка
			Обработки["ПомощникСозданияОбменаДанными"].ВыгрузитьНастройкиПодключенияДляПодчиненногоУзлаРИБ(
				ПомощникСозданияОбменаДанными);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Обмен данными'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
				
	КонецЕсли;
	
КонецПроцедуры
// -- rarus Камаев П.В. 16.10.2020