&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивТД = vftОбщиеПроцедурыДокументовСервер.ПолучитьТабличныеДокладОСостоянииБезопасности(ПараметрКоманды);
	
	Макет	= ПолучитьМакетДляПечати();

	vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивТД, Макет, 0);
	
	//vftОбщиеПроцедурыДокументовКлиент.СохранитьТабличныеДокументыВDOCX(МассивТД, "Документ.vftДокладОСостоянииБезопасности.ПФ_DOC_ДокладОСостоянииБезопасности");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетДляПечати()
	
	Макет = ?(ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ"),
	               "Документ.vftДокладОСостоянииБезопасности.ПФ_DOC_ДокладОСостоянииБезопасностиСУБ",
	                            "Документ.vftДокладОСостоянииБезопасности.ПФ_DOC_ДокладОСостоянииБезопасности");

	Возврат Макет;
	
КонецФункции