
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ID_Ремонта");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// ++ rarus selmik 29.09.2021 РАIT-0023505
	НастройкаВидимостиУточненияПричиныЗакрытияПереноса();
	// -- rarus selmik 29.09.2021 РАIT-0023505	
КонецПроцедуры

// ++ rarus selmik 29.09.2021 РАIT-0023505
&НаКлиенте
Процедура НастройкаВидимостиУточненияПричиныЗакрытияПереноса()
	Если Причина = ПредопределенноеЗначение("Справочник.впПричиныЗакрытияРемонтов.Прочее") Тогда
		Элементы.УточнениеПричиныЗакрытияПереноса.Видимость = Истина;
	Иначе
		Элементы.УточнениеПричиныЗакрытияПереноса.Видимость = Ложь;
		УточнениеПричиныЗакрытияПереноса = "";
	КонецЕсли;
КонецПроцедуры // -- rarus selmik 29.09.2021 РАIT-0023505


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Элементы.Причина.Заголовок = ?(ВидОперации = 1, "Причина переноса", "Причина отмены");
	Элементы.НоваяДатаНачала.Видимость = ВидОперации = 1;
	Элементы.НоваяДатаОкончания.Видимость = ВидОперации = 1;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НоваяДатаНачалаПР =  ПроверяемыеРеквизиты.Найти("НоваяДатаНачала");
	НоваяДатаНачалаПР =  ПроверяемыеРеквизиты.Найти("НоваяДатаОкончания");
	Если ВидОперации = 0 Тогда
		Если ЗначениеЗаполнено(НоваяДатаНачалаПР) Тогда
			ПроверяемыеРеквизиты.Удалить(НоваяДатаНачалаПР);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяДатаНачалаПР) Тогда
			ПроверяемыеРеквизиты.Удалить(НоваяДатаНачалаПР);
		КонецЕсли;
		
	Иначе
		Если НЕ ЗначениеЗаполнено(НоваяДатаНачалаПР) Тогда
			ПроверяемыеРеквизиты.Добавить("НоваяДатаНачала");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяДатаНачалаПР) Тогда
			ПроверяемыеРеквизиты.Добавить("НоваяДатаОкончания");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда      
		Возврат;  
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ВидОперации, НоваяДатаНачала, НоваяДатаОкончания, Причина, ID_Ремонта, УточнениеПричины",
	ВидОперации, НоваяДатаНачала, НоваяДатаОкончания, Причина, ID_Ремонта, УточнениеПричиныЗакрытияПереноса);
	
	Оповестить("ЗаполнитьДокументОтменыПереноса", СтруктураПараметров);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

// ++ rarus selmik 29.09.2021 РАIT-0023505
&НаКлиенте
Процедура ПричинаПриИзменении(Элемент)	
	НастройкаВидимостиУточненияПричиныЗакрытияПереноса();	
КонецПроцедуры  // -- rarus selmik 29.09.2021 РАIT-0023505


#КонецОбласти
