////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура впОбменТОиР20СМ31_ЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// ++ rarus PleA 12.11.2020 [ФТ.СНБ.01.04]
	//Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	//
	//ДобавитьРегистрациюНаУзле(Источник);
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("впОбменТОиР20СМ31", Источник, Отказ, РежимЗаписи, РежимПроведения);	
	// -- rarus PleA
	
КонецПроцедуры

Процедура впОбменТОиР20СМ31_ЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("впОбменТОиР20СМ31", Источник, Отказ,Замещение);
КонецПроцедуры

Процедура впОбменТОиР20СМ31_ЗарегистрироватьУдалениеДокументаПередУдалением(Источник, Отказ) Экспорт
	
	ДобавитьРегистрациюНаУзле(Источник);
	
КонецПроцедуры

Процедура впОбменТОиР20СМ31_ЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("впОбменТОиР20СМ31", Источник, Отказ);
КонецПроцедуры

Процедура впОбменТОиР20СМ31_ЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("впОбменТОиР20СМ31", Источник, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРегистрациюНаУзле(Источник)
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелДляОтправки = впОбменДаннымиПовтИсп.ПолучитьУзелДляРегистрацииИзменений("впОбменТОиР20СМ31");
	Если УзелДляОтправки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Источник.ОбменДанными.Получатели.Добавить(УзелДляОтправки);
	
КонецПроцедуры	

#КонецОбласти 
