#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
			
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик;	
	КонецЕсли;
		
	рарусСУБСервер.ОбработкаЗаполнениеДокументовСУБ(ЭтотОбъект);
					
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда 
		
		МассивНепроверяемыхРеквизитов.Добавить("Судно");
		МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитана");	
		МассивНепроверяемыхРеквизитов.Добавить("Статус");		
		МассивНепроверяемыхРеквизитов.Добавить("ВыводыПоСостояниюБезопасности");	
		МассивНепроверяемыхРеквизитов.Добавить("ПериодОбзора");
		МассивНепроверяемыхРеквизитов.Добавить("ВыполнениеРаботПоПланГрафикам");
		МассивНепроверяемыхРеквизитов.Добавить("ОтчетЗаНевыполненнуюРаботу");

		
	КонецЕсли;
					
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли