Функция СвернутаяКопияТаблицы(Таблица, Знач КолонкиГруппировок) Экспорт

	КолонкиСуммирования = Новый Массив;
	
	Если ТипЗнч(КолонкиГруппировок) <> Тип("Массив") тогда
		КолонкиГруппировок = СтрРазделить(КолонкиГруппировок,",", Ложь);	
	КонецЕсли;
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Если ТипЗнч(Колонка.ТипЗначения.ПривестиЗначение()) = Тип("Число") Тогда
			Если КолонкиГруппировок.Найти(Колонка.Имя)  = Неопределено Тогда
				КолонкиСуммирования.Добавить(Колонка.Имя);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	ТаблицаСвернутая = ОбщегоНазначенияУТ.СвернутаяКопияТаблицы(
		Таблица,
		СтрСоединить(КолонкиГруппировок, ","), ,
		СтрСоединить(КолонкиСуммирования,",")
	);
	
	Возврат ТаблицаСвернутая;

КонецФункции 

Процедура СвернутьТаблицу(Таблица, Знач КолонкиГруппировок = Неопределено) Экспорт

	КолонкиСуммирования = Новый Массив;
	
	Если ТипЗнч(КолонкиГруппировок) = Тип("Строка") тогда
		КолонкиГруппировок = СтрРазделить(КолонкиГруппировок,",", Ложь);
	ИначеЕсли КолонкиГруппировок = Неопределено Тогда 	
		КолонкиГруппировок = Новый Массив;
	КонецЕсли;
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Если ТипЗнч(Колонка.ТипЗначения.ПривестиЗначение()) = Тип("Число") Тогда
			Если КолонкиГруппировок.Найти(Колонка.Имя)  = Неопределено Тогда
				КолонкиСуммирования.Добавить(Колонка.Имя);
			КонецЕсли;	
		Иначе
			КолонкиГруппировок.Добавить(Колонка.Имя);
		КонецЕсли;	
	КонецЦикла;
	
	Таблица.Свернуть(СтрСоединить(КолонкиГруппировок, ","),	СтрСоединить(КолонкиСуммирования,","));
	
КонецПроцедуры 

Процедура УдалитьНеЗаполненныеЭлементыМассива(Массив) Экспорт
	
	МассивКопия = Новый Массив;
	
	Для Каждого ЭлМассива Из Массив цикл
		
		Если ЗначениеЗаполнено(ЭлМассива) тогда
			МассивКопия.Добавить(ЭлМассива);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Массив = МассивКопия;
	
КонецПроцедуры	