
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьСписокВыбораШаблонаДляТопливныхОтчетов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ДобавитьСписокВыбораШаблонаДляТопливныхОтчетов()
	СписокВыбора = Элементы.ШаблонДляТопливныхОтчетовВидТоплива.СписокВыбора;
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.ТопливоСМТ, "СМТ");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.ТопливоМТ01, "МТ 0.1");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.ТопливоМТ05, "МТ 0.5");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.ТопливоМТ15, "МТ 1.5");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.МаслоГД, "Масло ГД");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.МаслоДГ, "Масло ДГ");
	СписокВыбора.Добавить("Масло", "Масло ГД+ДГ");
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) Экспорт
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды() Экспорт
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
