
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ОбъектРемонта", 
                                                                ПараметрыВыполненияКоманды.Источник.Параметры.Ключ));
	ОткрытьФорму("РегистрСведений.впТекущееСостояниеОР.ФормаСписка", 
					ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
					ПараметрыВыполненияКоманды.Уникальность, 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
