
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступность()
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = ЕстьОшибкиАдреса();
	
КонецПроцедуры

&НаКлиенте
Процедура IPАдресНачалаДиапазонаПриИзменении(Элемент)
	
	ОбновитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступность()
	
	Элементы.IPАдресОкончанияДиапазона.Доступность = АдресНачалаДиапазонаВведенПолностью();
	
КонецПроцедуры

&НаКлиенте
Функция АдресНачалаДиапазонаВведенПолностью()
	
	Если Запись.IPАдресНачалаДиапазона = "" Тогда
		Возврат Ложь
	Иначе
		МассивПодстрок = СтрРазделить(Запись.IPАдресНачалаДиапазона, ".");
		Для Каждого Подстрока Из МассивПодстрок Цикл
			Если СокрЛП(Подстрока) = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ЕстьОшибкиАдреса()
	
	ЕстьОшибкиАдреса1 = РезультатПроверки(Запись.IPАдресНачалаДиапазона, 	"Элементы.IPАдресНачалаДиапазона");			
	ЕстьОшибкиАдреса2 = РезультатПроверки(Запись.IPАдресОкончанияДиапазона, "Элементы.IPАдресОкончанияДиапазона");			
	ЕстьОшибкиАдреса3 = Ложь;
	
	// Адрес2 должен быть больше Адреса1
	Если Не ЕстьОшибкиАдреса1 И Не ЕстьОшибкиАдреса2 Тогда
		
		Если Запись.IPАдресОкончанияДиапазона = "" Тогда
			Возврат Ложь
		КонецЕсли;
				
		Массив1 = СтрРазделить(Запись.IPАдресНачалаДиапазона, ".");
		Массив2 = СтрРазделить(Запись.IPАдресОкончанияДиапазона, ".");
		ТекстОшибки = "";
		
		Для Индекс = 0 По 3 Цикл
			
			СимволПередТекстомОшибки = ?(ТекстОшибки = "", "", Символы.ПС);
			
			Подстрока1 = Массив1[Индекс];
			Подстрока2 = Массив2[Индекс];
			СимволыПодстроки1 = ?(СокрЛП(Подстрока1) = "", "0", СокрЛП(Подстрока1));
			СимволыПодстроки2 = ?(СокрЛП(Подстрока2) = "", "0", СокрЛП(Подстрока2));
			ЧислоИзПодстроки1 = Число(СимволыПодстроки1);
			ЧислоИзПодстроки2 = Число(СимволыПодстроки2);
			
			Если ЧислоИзПодстроки1 > ЧислоИзПодстроки2 Тогда
				ТекстОшибки = ТекстОшибки + СтрШаблон("%1Адрес начала диапазона не может быть меньше адреса окончания диапазона", СимволПередТекстомОшибки);
			    Прервать;
			ИначеЕсли ЧислоИзПодстроки2 > ЧислоИзПодстроки1 Тогда
			    Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		ЕстьОшибкиАдреса3 = НЕ ПустаяСтрока(ТекстОшибки);
		
		Если ЕстьОшибкиАдреса3 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ЕстьОшибкиАдреса1 ИЛИ ЕстьОшибкиАдреса2 ИЛИ ЕстьОшибкиАдреса3;
	
КонецФункции

&НаКлиенте
Функция РезультатПроверки(Адрес, Поле)
	
	Если Адрес = "" И Поле = "Элементы.IPАдресНачалаДиапазона" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен адрес начала диапазона",,Поле);
		Возврат Истина;
	ИначеЕсли Адрес = "" Тогда // Конец диапазона заполнять не обязательно, можно указывать конкретный адрес
		Возврат Ложь
	КонецЕсли;
		
	МассивПодстрок = СтрРазделить(Адрес, ".");
		
	МассивРазрядов = Новый Массив;
	Проверка0 	= 0; // адрес не может быть 0.0.0.0
	Проверка172 = 0; // адрес не может быть в диапазоне 172.16.0.0 - 172.31.255.255
	Проверка192 = 0; // адрес не может быть 192.168.Х.Х
	Проверка127 = 0; // адрес не может быть 127.0.0.1
	ТекстОшибки = "";
	
	Для Индекс = 0 По 3 Цикл // По маске у нас всегда 4 элемента массива
		
		Подстрока = МассивПодстрок[Индекс];
		СимволыПодстроки = ?(СокрЛП(Подстрока) = "", "0", СокрЛП(Подстрока));
		ЧислоИзПодстроки = Число(СимволыПодстроки);
		
		СимволПередТекстомОшибки = ?(ТекстОшибки = "", "", Символы.ПС);
		
		Если ЧислоИзПодстроки > 255 Тогда
			ТекстОшибки = ТекстОшибки + СтрШаблон("%1В %2 разряде число превышает 255", СимволПередТекстомОшибки, Индекс + 1);
		КонецЕсли;
		
		Если Индекс = 0 И ЧислоИзПодстроки = 10 Тогда
			ТекстОшибки = ТекстОшибки + СтрШаблон("%1Адрес не может начинаться с 10", СимволПередТекстомОшибки);
		КонецЕсли;
		
		Если Поле = "Элементы.IPАдресНачалаДиапазона" И ЧислоИзПодстроки = 0 Тогда
			Проверка0 = Проверка0 + 1;
			Если Проверка0 = 4 Тогда
				ТекстОшибки = ТекстОшибки + СтрШаблон("%1Адрес не может состоять только из нулей", СимволПередТекстомОшибки);
			КонецЕсли;
		КонецЕсли;
		
		Если (Индекс = 0 И ЧислоИзПодстроки = 172)
			ИЛИ (Индекс = 1 И ЧислоИзПодстроки >= 16 И ЧислоИзПодстроки <= 31) Тогда
			Проверка172 = Проверка172 + 1;
			Если Проверка172 = 2 Тогда
				ТекстОшибки = ТекстОшибки + СтрШаблон("%1Адрес не может быть в диапазоне 172.16.0.0 - 172.31.255.255", СимволПередТекстомОшибки);
			КонецЕсли;
		КонецЕсли;
		
		Если (Индекс = 0 И ЧислоИзПодстроки = 192)
			ИЛИ (Индекс = 1 И ЧислоИзПодстроки = 168) Тогда
			Проверка192 = Проверка192 + 1;
			Если Проверка192 = 2 Тогда
				ТекстОшибки = ТекстОшибки + СтрШаблон("%1Адрес не может быть 192.168.Х.Х", СимволПередТекстомОшибки);
			КонецЕсли;
		КонецЕсли;
		
		Если (Индекс = 0 И ЧислоИзПодстроки = 127)
			ИЛИ (Индекс = 1 И ЧислоИзПодстроки = 0)
			ИЛИ (Индекс = 2 И ЧислоИзПодстроки = 0)
			ИЛИ (Индекс = 3 И ЧислоИзПодстроки = 1) Тогда
			Проверка127 = Проверка127 + 1;
			Если Проверка127 = 4 Тогда
				ТекстОшибки = ТекстОшибки + СтрШаблон("%1Адрес не может быть 127.0.0.1", СимволПередТекстомОшибки);
			КонецЕсли;
		КонецЕсли;
		
		МассивРазрядов.Добавить(ЧислоИзПодстроки);
		
	КонецЦикла;
	
	ЕстьОшибки = НЕ ПустаяСтрока(ТекстОшибки);
	
	Если ЕстьОшибки Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,,Поле);
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции
