Функция ОбъектДоступенДляРедактирования(Ссылка, ИгнорироватьРазрешениеПоПравам = Ложь) Экспорт		
	
	Возврат РассчитатьОбъектДоступенДляРедактирования(Ссылка, ИгнорироватьРазрешениеПоПравам);
	
КонецФункции

Функция РассчитатьОбъектДоступенДляРедактирования(Ссылка, ИгнорироватьРазрешениеПоПравам = Ложь)

	Разрешения = ПолучитьРазрешенияПоСсылке(Ссылка);
	
	Если Разрешения.РазрешеноПоСсылке тогда
		возврат Истина;
	КонецЕсли;	
	
	Если Не ИгнорироватьРазрешениеПоПравам тогда
		Если Разрешения.РазрешеноПоПравам тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если Не Разрешения.РазрешеноБизнесЛогика тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Разрешения.РазрешеноОбластьРедактирования тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Разрешения.РазрешеноОбмен;

КонецФункции // ()

Функция ПолучитьРазрешенияПоСсылке(Ссылка)
	
	Разрешения = Новый Структура("РазрешеноПоСсылке, РазрешеноПоПравам, РазрешеноБизнесЛогика, РазрешеноОбластьРедактирования, РазрешеноОбмен", Ложь, Ложь, Ложь, Ложь, Ложь);
	
	Если Не ЗначениеЗаполнено(Ссылка) тогда
		Разрешения.РазрешеноПоСсылке = Истина;		
	КонецЕсли;	
	
	Разрешения.РазрешеноПоПравам = ПолучитьРазрешениеРедактированияПоПравам();
	
	Разрешения.РазрешеноБизнесЛогика = ПолучитьРазрешениеРедактированияБизнесЛогики(Ссылка);
	
	Разрешения.РазрешеноОбластьРедактирования = рарусЗаявкаНаСнабжениеСервер.ЭтоРедактированиеНаСудне(Ссылка);
	
	Разрешения.РазрешеноОбмен = ПолучитьРазрешениеРедактированияПоРегистрацииКОбмену(Ссылка);

	Возврат Разрешения;
	
КонецФункции	

Функция ПолучитьРазрешениеРедактированияПоПравам()
		
	Возврат Пользователи.ЭтоПолноправныйПользователь();

КонецФункции 
 
Функция ПолучитьРазрешениеРедактированияБизнесЛогики(Ссылка) Экспорт

	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
	
	РедактированиеВозможно = Ложь;
	
	Попытка 
		РедактированиеВозможно = Менеджер.ОбъектДоступенДляРедактирования(Ссылка);
	Исключение		
		ВызватьИсключение нСтр(СтрШаблон("ru='в менеджере объекта %1 не найдена процедура ""ОбъектДоступенДляРедактирования""'", Менеджер), "ru") 
	КонецПопытки;

	Возврат РедактированиеВозможно;
	
КонецФункции 

Функция ПолучитьРазрешениеРедактированияПоРегистрацииКОбмену(Ссылка)
	
	Возврат рарусСостоянияРегистрацииОбъектовНаПланахОбменаСервер.ПланОбменаПолныйОбъектДоступенДляРедактирования(Ссылка);
	
КонецФункции	

Функция ЕстьПравоОтправкиНаБерег(Пользователь = Неопределено) Экспорт
	
	Возврат Пользователи.РолиДоступны(РольПравоОтправкиНаБерег(), Пользователь);
	
КонецФункции

Функция РольПравоОтправкиНаБерег()
	
	Возврат "рарусПравоОтправкиНаБерег";
	
КонецФункции	