///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// В модулях менеджеров указанных списков должна быть размещена процедура обработчика,
// в которую передаются следующие параметры.
// 
//  Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
// Далее пример процедуры для модуля менеджера.
//
//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - добавить описания профилей групп доступа (Структура).
//                        Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - содержит свойства:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// ++ rarus makole 2021-01-20 [Задача № 26677]
	// Настроить прототип организации прав доступа на примере 1-го приоритета снабжения
	
	// Описание для заполнения профиля "Капитан (дополнительные права)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "ce81fd63-0ece-11eb-8925-005056b5077b";
	ОписаниеПрофиля.Наименование  = "Капитан (дополнительные права)";
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеИзменениеМеханизмовСинхронизацииСудноБерег"  );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеПросмотрСоответствияПользователяФизическомуЛицу"  );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПравоОтправкиНаБерег"                                                );
	// ++ rarus makole 2021-04-01
	ОписаниеПрофиля.Роли.Добавить       (  "рарусИзменениеСостоянияОтправкиОбъекта"                                   );
	// -- rarus makole 2021-04-01
	//	// ++ rarus ilshil 22.07.2021
	ОписаниеПрофиля.Роли.Добавить      (  "рарусПросмотрОтчетаДокументыСудов"                                            );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеАнализовСУБ"                                           );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеДокладовОСостоянииБезопасности"                        );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеНесоответствийИДокладов"                               );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеРапортОПоврежденииНеисправности"                       );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеСообщенийОПотенциальноймИнцидиенте"                    );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусИспользованиеОтчетаПланГрафикаМероприятийСУБ"                            );	
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаГрафикМероприятийСУБ"                                      );	
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеМероприятийСУБ"                                       );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеОтчетСУБ"                                             );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеАнализСУБПрисоединенныеФайлы"                         );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеvftДокладыОНесоответствииПрисоединенныеФайлы"         );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеСообщениеОПотенциальномИнцидентеПрисоединенныеФайлы"  );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеПрисоединенныхФайловЗамечания"                        );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеПрисоединенныхФайловСвидетельстваСудов"               );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеСвидетельстваСудов"                                   );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусИспользованиеЖурналаСообщенийСУБ"                                        );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПодсистемаСУБ"                                                           );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПрисоединенныхФайловЗамечания"                                     );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеВидаДокументовОсвидетельствования"                                 );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеВидовМероприятийСУБ"                                               );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеГруппыДокуметовСудов"                                              );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеЗоныОтветственности"                                               );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеКлассификаторовКодовЗамечаний"                                     );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеКлассификаторовКодовУстраненияЗамечаний"                           );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеКонтролирующихОрганов"                                             );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПрисоединенныхФайловСвидетельстваСудов"                            );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПрисоединенныхФайловСУБ"                                           );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеСвидетельстваСудов"                                                );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеТиповОсвидетельствования"                                          );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеТиповСудов"                                                        );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеУчений"                                                            );
	ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеОпросов"                                                   );
	ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеОтветовНаВопросыАнкет"                                     );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаПоЗамечаниям"                                              );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаПоПроведеннымМероприятиямСУБ"                              );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаПоСудовымСвидетельствам"                                   );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПросмотрСправочникаСтепениРиска"                                   );
	ОписаниеПрофиля.Роли.Добавить       (  "ЧтениеОтветовНаВопросыАнкет"                                                  );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеТребований"                                                        );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеПросмотрСоответствияПользователяФизическомуЛицу"      );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеКонвенции"                                                         );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеДополнительныхДанныхЗамечаний"                                     );
 	// -- rarus ilshil 22.07.2021
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Описание для заполнения профиля "Пользователь".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "9efef89b-5b17-11eb-8156-14dda9d639df";
	ОписаниеПрофиля.Наименование  = "Пользователь";
	ОписаниеПрофиля.Роли.Добавить       (  "vftПользователь"                   );
	ОписаниеПрофиля.Роли.Добавить       (  "Администрирование"                 );
	ОписаниеПрофиля.Роли.Добавить       (  "БазовыеПраваБСП"                   );
	ОписаниеПрофиля.Роли.Добавить       (  "ВыполнениеСинхронизацииДанных"     );
	ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеПользователей"  );
	ОписаниеПрофиля.Роли.Добавить       (  "ОбновлениеКонфигурацииБазыДанных"  );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусБазовыеПраваПользователей"    );
	// ++ rarus makole 2021-04-05 [ВПIT-0022308]
	// Добавить в базовый профиль пользователя СМ роль "Редактирование, отправка по почте, сохранение в файл печатных форм"  
	ОписаниеПрофиля.Роли.Добавить       (  "РедактированиеПечатныхФорм"  	   );
	// -- rarus makole 2021-04-05 [ВПIT-0022308]
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Описание для заполнения профиля "Снабжение (дополнительные права)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "ac4380cb-5b19-11eb-8156-14dda9d639df";
	ОписаниеПрофиля.Наименование  = "Снабжение (дополнительные права)";
	//ОписаниеПрофиля.Роли.Добавить       (  "vftДобавлениеСправочниковНСИ"                                  );
	ОписаниеПрофиля.Роли.Добавить       (  "ИзменениеВыполнениеЗадач"                                      );
	ОписаниеПрофиля.Роли.Добавить       (  "ИспользованиеОбработкиТекущиеДела"                             );
	ОписаниеПрофиля.Роли.Добавить       (  "ПросмотрСвязанныеДокументы"                                    );
	//ОписаниеПрофиля.Роли.Добавить       (  "рарусБазовыеПраваПользователей"                                );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеАктовВыполненныхРаботОказанныхУслуг"   );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеЗаявкиНаСнабжение"                     );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеЗаявкиНаСнабжениеПрисоединенныеФайлы"  );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеПриходТМЦ"                             );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеиИзменениеРегистрацииОбмена"                    );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусОтражениеУслуг"                                           );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеВидовНоменклатуры"                                  );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеСостоянийЗаявкиНаСнабжение"                         );
	ОписаниеПрофиля.Роли.Добавить       (  "РедактированиеРеквизитовОбъектов"                              );
	ОписаниеПрофиля.Роли.Добавить       (  "ЧтениеГрафиковРаботы"                                          );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеДокументовИмущественногоУчета"         );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеСоответствияПользователяФизическомуЛицу"            );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеНомеклатурыПоставщиков"                             );
	// ++ rarus makole 2021-04-01
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПросмотрСостоянияОтправкиОбъекта"                   );
	// -- rarus makole 2021-04-01
	// ++ rarus makole 2021-06-15
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПросмотрСправочникаБереговыеСлужбы"                 );
	// -- rarus makole 2021-06-15
	// ++ rarus makole 2021-06-17
	// Добавлены роли 2 приоритета
	ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеЛичныхВариантовОтчетов"                     );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаВедомостьТМЦ"                 			   );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаМинимальныеЗапасыТМЦ"                 	   );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПросмотрМинимальныхОстатковНоменклатуры"            );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеЦенНоменклатуры"                 				   );
	// ++ rarus makole 2021-06-23 [РАIT-0023341]
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрИспользованиеОтчетаСостояниеВыполненияЗаявокНаСнабжение");
	// -- rarus makole 2021-06-23 [РАIT-0023341]
	// -- rarus makole 2021-06-17
	// ++ rarus makole 2021-08-02
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПросмотрТоваровДругогоКачества"					   );
	// ++ rarus ilshil 10.08.2021
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеШтрихкодовНоменклатуры"					           );
	// -- rarus ilshil 10.08.2021
    //rarus_AfoD 01.09.2021 < 
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПросмотрПлановыеСрокиОсвидетельствованийРМРС"       );
	//rarus_AfoD 01.09.2021 > 
	// -- rarus makole 2021-08-02
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	// -- rarus makole 2021-01-20 [Задача № 26677]
	
	// ++ rarus selmik 20.02.2021
	// Описание для заполнения профиля "Классический ТОИР".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "c3e36486-7357-11eb-815e-14dda9d639df";
	ОписаниеПрофиля.Наименование  = "Классический ТОИР";
	ОписаниеПрофиля.Роли.Добавить       (  "рарусТОИР_Изменение"                  );
	ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеВариантовОтчетов"  );
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	// -- rarus selmik 20.02.2021
	
	// ++ rarus makole 2021-06-15
	// Роли перенесены в профиль "Снабжение"
	//// ++ rarus makole 2021-03-18 [ФТ.ИМ]
	//// Описание для заполнения профиля "Имущественный учёт".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	//ОписаниеПрофиля.Идентификатор = "9adc0ee5-8801-11eb-8162-14dda9d639df";
	//ОписаниеПрофиля.Наименование  = "Имущественный учёт";
	//ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеВариантовОтчетов"                    );
	//ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеДокументовИмущественногоУчета"  );
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//// -- rarus makole 2021-03-18 [ФТ.ИМ]
	// -- rarus makole 2021-06-15

	// ++ rarus ilshil 22.07.2021
	// Описание для заполнения профиля "Аудитор".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "09ecf2dd-ead5-11eb-80d1-14dda9d639df";
	ОписаниеПрофиля.Наименование  = "Аудитор";
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаДокументыСудов"                                            );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеАнализовСУБ"                                           );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеДокладовОСостоянииБезопасности"                        );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеНесоответствийИДокладов"                               );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеРапортОПоврежденииНеисправности"                       );
	ОписаниеПрофиля.Роли.Добавить       (  "vtfДобавлениеИИзменениеСообщенийОПотенциальноймИнцидиенте"                    );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусИспользованиеОтчетаПланГрафикаМероприятийСУБ"                            );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеМероприятийСУБ"                                       );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеОтчетСУБ"                                             );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеАнализСУБПрисоединенныеФайлы"                         );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеvftДокладыОНесоответствииПрисоединенныеФайлы"         );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеСообщениеОПотенциальномИнцидентеПрисоединенныеФайлы"  );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеПрисоединенныхФайловЗамечания"                        );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеПрисоединенныхФайловСвидетельстваСудов"               );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеСвидетельстваСудов"                                   );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусИспользованиеЖурналаСообщенийСУБ"                                        );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПодсистемаСУБ"                                                           );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПрисоединенныхФайловЗамечания"                                     );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеВидаДокументовОсвидетельствования"                                 );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеВидовМероприятийСУБ"                                               );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеГруппыДокуметовСудов"                                              );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеЗоныОтветственности"                                               );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеКлассификаторовКодовЗамечаний"                                     );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеКлассификаторовКодовУстраненияЗамечаний"                           );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеКонтролирующихОрганов"                                             );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПрисоединенныхФайловСвидетельстваСудов"                            );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПрисоединенныхФайловСУБ"                                           );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеСвидетельстваСудов"                                                );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеТиповОсвидетельствования"                                          );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеТиповСудов"                                                        );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеУчений"                                                            );
	ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеОпросов"                                                   );
	ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеОтветовНаВопросыАнкет"                                     );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаПоЗамечаниям"                                              );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаПоПроведеннымМероприятиямСУБ"                              );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПросмотрОтчетаПоСудовымСвидетельствам"                                   );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПросмотрСправочникаСтепениРиска"                                   );
	ОписаниеПрофиля.Роли.Добавить       (  "ЧтениеОтветовНаВопросыАнкет"                                                  );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеТребований"                                                        );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусДобавлениеИзменениеПросмотрСоответствияПользователяФизическомуЛицу"      );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеКонвенции"                                                         );
    //rarus_AfoD 01.09.2021 < 
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеПросмотрПлановыеСрокиОсвидетельствованийРМРС"                      );
	//rarus_AfoD 01.09.2021 > 
	ОписаниеПрофиля.Роли.Добавить       (  "рарусПолномочияАудитора"                                                      );
	ОписаниеПрофиля.Роли.Добавить       (  "рарусЧтениеДополнительныхДанныхЗамечаний"                                     );
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	// -- rarus ilshil 22.07.2021

	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта (например, задачи ЗадачаИсполнителя),
// от "ведущего" объекта (например,  бизнес-процесса Задание), которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте 2 вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов указанных типов.
//
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками:
//   ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   Имя          - Строка - идентификатор права, например ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии ОбщаяФорма.НастройкиПравОбъектов.
//
//   Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   Подсказка    - Строка - подсказка к заголовку права,
//                  например "Добавление, изменение и пометка удаления папок".
//
//   НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   ТребуемыеПрава - Массив Из Строка - имена прав, требуемых для этого права -
//                  например, право "ДобавлениеФайлов" требует права "ИзменениеФайлов".
//
//   ЧтениеВТаблицах - Массив Из Строка - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц",
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   ИзменениеВТаблицах - Массив Из Строка - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа, могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект, для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка и т. п.
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
