
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокПриходовИзПараметров();
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПриходовИзПараметров()
	
	Перем СписокПрихода;
	
	СписокПрихода = Неопределено;
	Если Параметры.Свойство("СписокПрихода", СписокПрихода)
		И СписокПрихода <> Неопределено Тогда 
		
		Для Каждого Приход Из СписокПрихода цикл
			
			ДокументыПрихода.Добавить().ДокументПрихода = Приход;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПриходаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДокументыПриходаДокументПрихода Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ДокументПрихода);
	КонецЕсли;
	
КонецПроцедуры

