#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.впЗаявкаНаСнабжение") тогда
		рарусЗаявкаНаСнабжениеСервер.ЗаполнитьПриходТМЦПоЗаявке(ЭтотОбъект, ДанныеЗаполнения);
	// ++ rarus makole 2021-01-22 [ФТ.ИМ.01.01]
	// На основании инвентаризации формировать списание/оприходование с регистра имущества 
	// на судах документом Расход ТМЦ/Приход ТМЦ/Изменение статуса(в судовом модуле)
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
	    И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.рарусИнвентаризацияТМЦ") Тогда
		рарусИмущественныйУчетСервер.ЗаполнитьПриходТМЦПоИнвентаризации(ЭтотОбъект, ДанныеЗаполнения);
	// -- rarus makole 2021-01-22 [ФТ.ИМ.01.01]
	КонецЕсли;	
	
	Если ЭтоНовый() Тогда
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	// ++ rarus makole 2021-03-31
	//ПолученВБМ = Ложь;
	СформированСМ = Истина;
	// -- rarus makole 2021-03-31
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	// ++ rarus makole 2021-03-31
	////DEL_PaSe Контроль возможности изменения документа//
	////ПроверитьДоступностьРедактированияОбъекта(Отказ);
	ПроверитьДоступностьРедактированияОбъекта(Отказ);
	// -- rarus makole 2021-03-31
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДоступностьРедактированияОбъекта

Процедура ПроверитьДоступностьРедактированияОбъекта(Отказ)
	
	// ++ rarus makole 2021-03-31
	//Если СформированСМ Тогда
	//	Если НЕ ЭтоНовый() Тогда
	//		//Если будут дополнительные ограничения	
	//		//Отказ = Не рарусСостоянияРедактированияОбъектов.ОбъектДоступенДляРедактирования(Ссылка);
	//		Если НЕ рарусСостоянияРегистрацииОбъектовНаПланахОбменаСервер.ПланОбменаПолныйОбъектДоступенДляРедактирования(Ссылка) Тогда
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//Иначе
	//	Если НЕ ДополнительныеСвойства.Свойство("ЗагрузкаИзБМ") Тогда
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Отказ тогда
	//	ОбщегоНазначения.СообщитьПользователю("Объект не доступен для редактирования");
	//КонецЕсли;
	
	// После загрузки объекта из БМ ему устанавливается состояние ЗагруженИзБМ до окончания загрузки.
	// Затем статус меняется на Отправлен и редактирование созданных в БМ документов запрещается
	Отказ = Отказ ИЛИ НЕ (СформированСМ ИЛИ рарусИмущественныйУчетСервер.ЭтоЗагруженИзБМ(Ссылка));
	Если НЕ СформированСМ
		 И НЕ рарусИмущественныйУчетСервер.ЭтоЗагруженИзБМ(Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ создан в береговом модуле, редактирование запрещено");
	КонецЕсли;
	// -- rarus makole 2021-03-31

КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеСлужебныхРеквизитов

Процедура ИнициализироватьДокумент(ДанныеЗаполнения)
	
	Дата = ТекущаяДатаСеанса();
	
	Если Не ЗначениеЗаполнено(Подразделение) тогда
		Подразделение = vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно");
	КонецЕсли;
	
	// ++ rarus makole 2021-01-22 	
	//Организация = Константы.впОсновнаяОрганизация.Получить();
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = рарусОбщегоНазначенияСервер.ОсновнаяОрганизация();
	КонецЕсли;
	// -- rarus makole 2021-01-22 
	
	Ответственный = Пользователи.ТекущийПользователь();
	СформированСМ = Истина;
	//ПолученВБМ = Ложь; // DEL ++ rarus makole 2021-03-31
	
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаУПоставщика;
		Если ЗначениеЗаполнено(Распоряжение) И ТипЗнч(Распоряжение) = Тип("ДокументСсылка.впПеремещениеТоваров") Тогда
			ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ПриходПоПеремещению;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли