
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	МассивНепроверяемыхРеквизитов = Справочники.Номенклатура.НепроверяемыеРеквизиты(ЭтотОбъект);
	
	// Защита от ошибки SQL: Переполнение поля.
	ПроверитьКратностьМеры("Вес", Отказ);
	ПроверитьКратностьМеры("Объем", Отказ);
	ПроверитьКратностьМеры("Площадь", Отказ);
	ПроверитьКратностьМеры("Длина", Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьКратностьМеры(Мера, Отказ)
	СообщениеКратностьБолее = НСтр("ru = 'Кратность более 10 000 000 / 1';
									|en = 'Multiplier more than 10 000 000 / 1'");
	СообщениеКратностьМенее = НСтр("ru = 'Кратность менее 1 / 99 999 999';
									|en = 'Multiplier less than 1 / 99 999 999'");
	Если ЭтотОбъект[Мера + "Использовать"]
		И ЗначениеЗаполнено(ЭтотОбъект[Мера + "Знаменатель"]) Тогда
		Если ЭтотОбъект[Мера + "Числитель"] / ЭтотОбъект[Мера + "Знаменатель"] < 0.0000001 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СообщениеКратностьБолее,
				,
				"Объект." + Мера + "Знаменатель",
				,
				Отказ);
		ИначеЕсли ЭтотОбъект[Мера + "Числитель"] / ЭтотОбъект[Мера + "Знаменатель"] > 99999999 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СообщениеКратностьМенее,
				,
				"Объект." + Мера + "Числитель",
				,
				Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти