// ++ rarus Чернавин Г.К 12.03.2020

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Дата") Тогда
		РедактируемоеЗначение = Параметры.Дата;
		ПолеЧасов = Формат(Час(РедактируемоеЗначение),"ЧЦ=2; ЧН=; ЧВН=");
		ПолеМинут = Формат(Минута(РедактируемоеЗначение),"ЧЦ=2; ЧН=; ЧВН=");
		ПолеКалендаря = ?(ЗначениеЗаполнено(РедактируемоеЗначение), РедактируемоеЗначение, ТекущаяДата());
	КонецЕсли;
	Параметры.Свойство("ИмяЭлемента", ИмяЭлемента);
КонецПроцедуры


&НаКлиенте
Процедура ПолеЧасовРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	Значение = Число(ПолеЧасов);
	Если Направление = 1 Тогда
		Значение = Мин(23, Значение+1);
	Иначе
		Значение = Макс(0, Значение-1);
	КонецЕсли;
	
	ПолеЧасов = Формат(Значение,"ЧЦ=2; ЧН=; ЧВН=");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеМинутРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	Значение = Число(ПолеМинут);
	Если Направление = 1 Тогда
		Значение = Мин(59, Значение+1);
	Иначе
		Значение = Макс(0, Значение-1);
	КонецЕсли;
	
	ПолеМинут = Формат(Значение,"ЧЦ=2; ЧН=; ЧВН=");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеЧасовПриИзменении(Элемент)
	
	Попытка
		Значение = Число(ПолеЧасов);
	Исключение
		Значение=0;
	КонецПопытки;
	
	Значение = Макс(0, Мин(23, Значение));
	ПолеЧасов = Формат(Значение,"ЧЦ=2; ЧН=; ЧВН=");
КонецПроцедуры

&НаКлиенте
Процедура ПолеМинутПриИзменении(Элемент)
	
	Попытка
		Значение = Число(ПолеМинут);
	Исключение
		Значение=0;
	КонецПопытки;
	
	Значение = Макс(0, Мин(59, Значение));
	ПолеМинут = Формат(Значение,"ЧЦ=2; ЧН=; ЧВН=");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	Попытка
		Часы=Макс(0,Мин(23,Число(ПолеЧасов)));
	Исключение
		Часы=0;
	КонецПопытки;
	
	Попытка
		Минуты=Макс(0,Мин(59,Число(ПолеМинут)));
	Исключение
		Минуты=0;
	КонецПопытки;
	
	Результат = ПолеКалендаря+Часы*3600+Минуты*60;
	СтруктураЗакрытия = Новый Структура;
	СтруктураЗакрытия.Вставить("Результат", Результат);
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		СтруктураЗакрытия.Вставить("ИмяЭлемента", ИмяЭлемента);
	КонецЕсли;
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры


// -- rarus Чернавин Г.К 12.03.2020
