////////////////////////////////////////////////////////////////////////////////
// торо_Печать: методы для печати.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выводит документ на печать.
//
// Параметры:
//		ИмяОбъектаМетаданных - Строка - Имя объекта метаданных. Например "Документ.торо_АктОВыполненииЭтапаРабот".
//		ИмяПечатнойФормы - Строка - имя печатной формы.
//		МассивОбъектов - Массив, Ссылка - ссылка или массив ссылок на печатаемые объекты.
//		ПараметрыПечати - Структура - дополнительные параметры.
//
Процедура НапечататьДокумент(ИмяОбъектаМетаданных, ИмяПечатнойФормы, МассивОбъектов, ПараметрыПечати = Неопределено) Экспорт
	
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			ИмяОбъектаМетаданных, ИмяПечатнойФормы, МассивОбъектов, Неопределено, ПараметрыПечати);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапроситьУПользователяДополнительныеПараметрыПередПечатью(ПараметрыПечати) Экспорт
	
	Если ПараметрыПечати.ОбъектыПечати.Количество() = 1 Тогда
		
		РемонтыОборудования = впПечатьСервер.ПолучитьСтруктуруДанныхРемонтовОборудования(ПараметрыПечати.ОбъектыПечати[0], "РемонтыОборудования");
		
		ДополнительныеПараметры = Новый Структура("ПараметрыПечати", ПараметрыПечати);
		
		Если РемонтыОборудования.Количество() = 1 Тогда
			МассивID = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РемонтыОборудования[0].ID);
			ПослеВыбораРемонтовДляПечати(МассивID, ДополнительныеПараметры);
		Иначе 		
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораРемонтовДляПечати", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("ОбщаяФорма.впФормаВыбораИзОбъектовОборудования", Новый Структура("РемонтыОборудования, КлючНазначенияИспользования", РемонтыОборудования, "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПараметрыПечати.Идентификатор), ПараметрыПечати.Форма, ПараметрыПечати.ОбъектыПечати[0],,,ОписаниеОповещения);
		КонецЕсли;
	Иначе
		
		НапечататьДокумент(ПараметрыПечати.МенеджерПечати, ПараметрыПечати.Идентификатор, ПараметрыПечати.ОбъектыПечати, Новый Структура);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПослеВыбораРемонтовДляПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыПечати = ДополнительныеПараметры.ПараметрыПечати;
	Параметры = Новый Структура("МассивID", Результат);
	
	НапечататьДокумент(ПараметрыПечати.МенеджерПечати,
			ПараметрыПечати.Идентификатор,
			ПараметрыПечати.ОбъектыПечати,
			Параметры);

КонецПроцедуры

#КонецОбласти
